
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ПараметрыСеанса.ЭтоМобильныйКлиент;
	Если ЭтоМобильныйКлиент Тогда
		МК_НастроитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ВариантОтвета = Истина;
	
	Если БольшеНеСпрашивать Тогда
		ЗапомнитьВариантОтвета(ВариантОтвета);
	КонецЕсли;
	
	Закрыть(ВариантОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСоздавать(Команда)
	
	ВариантОтвета = Ложь;
	
	Если БольшеНеСпрашивать Тогда
		ЗапомнитьВариантОтвета(ВариантОтвета);
	КонецЕсли;
	
	Закрыть(ВариантОтвета);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗапомнитьВариантОтвета(ВариантОтвета)
	
	Отсутствия.УстановитьПерсональнуюНастройку("ВопросСоздатьПисьмоБольшеНеСпрашивать", Истина);
	Отсутствия.УстановитьПерсональнуюНастройку("ВопросСоздатьПисьмоВариантОтвета", ВариантОтвета);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

&НаСервере
Процедура МК_НастроитьЭлементыФормы()
	
	СворачиваниеЭлементовПоВажности = СворачиваниеЭлементовФормыПоВажности.НеИспользовать;
	ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;

	Элементы.МК.Видимость = Истина;
	Элементы.ГруппаКоманднаяПанель.Видимость = Ложь;
	Элементы.Переместить(Элементы.Создать, Элементы.МК_НижняяПанель);
	МК.ОформитьАкцентнуюКнопку(Элементы.Создать);
	Элементы.Переместить(Элементы.НеСоздавать, Элементы.МК_НижняяПанель);
	МК.ОформитьДополнительнуюКнопку(Элементы.НеСоздавать);
	Элементы.НеСоздавать.Отображение = ОтображениеКнопки.Текст;
	
	Элементы.Переместить(Элементы.Декорация2, Элементы.МК);
	Элементы.Переместить(Элементы.МК_ДекорацияОтступ, Элементы.МК);
	Элементы.Переместить(Элементы.БольшеНеСпрашивать, Элементы.МК);
	Элементы.Переместить(Элементы.МК_НижняяПанель, Элементы.МК);
	
	Элементы.БольшеНеСпрашивать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

КонецПроцедуры
	
#КонецОбласти

#КонецОбласти