
&ИзменениеИКонтроль("ОбновитьМиникарточку")
Процедура ЦППК_ОбновитьМиникарточку(Форма) Экспорт 
	
	Список = Форма.Элементы.Список;
	
#Удаление
	ТекущиеДанные = РаботаСоСпискамиДокументовКлиент.ПолучитьДанныеТекущейСтрокиСписка(Список, Список.ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Форма.ТекущийДокумент = Неопределено;
		
	ИначеЕсли Форма.ИмяФормы = "РегистрСведений.МоиДокументы.Форма.ФормаМоиДокументы" Тогда 
		Форма.ТекущийДокумент = ТекущиеДанные.Документ;
		
	Иначе
		Форма.ТекущийДокумент = ТекущиеДанные.Ссылка;
		
		Форма.ТекущийРегистрационныйНомер = ТекущиеДанные.РегистрационныйНомер;
		
	КонецЕсли;
	
#КонецУдаления
#Вставка
	Если Форма.ИмяФормы = "Справочник.ДокументыПредприятия.Форма.ФормаСпискаСПапками" Тогда
		
		ТекущиеДанные = ЦППК_ОбщийМодульВызовСервера.ПолучитьДанныеИзКлючаЗаписи(Список.ТекущаяСтрока, "Документ");
		
		Если ТекущиеДанные = Неопределено Тогда
			Форма.ТекущийДокумент = Неопределено;
		Иначе
			Форма.ТекущийДокумент = ТекущиеДанные;
			Форма.ТекущийРегистрационныйНомер = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные, "РегистрационныйНомер");
		КонецЕсли;	
		
	Иначе
		
		ТекущиеДанные = РаботаСоСпискамиДокументовКлиент.ПолучитьДанныеТекущейСтрокиСписка(Список, Список.ТекущаяСтрока);
		Если ТекущиеДанные = Неопределено Тогда
			Форма.ТекущийДокумент = Неопределено;
		ИначеЕсли Форма.ИмяФормы = "РегистрСведений.МоиДокументы.Форма.ФормаМоиДокументы" Тогда 
			Форма.ТекущийДокумент = ТекущиеДанные.Документ;
		Иначе
			Форма.ТекущийДокумент = ТекущиеДанные.Ссылка;
			Форма.ТекущийРегистрационныйНомер = ТекущиеДанные.РегистрационныйНомер;
		КонецЕсли;
		
	КонецЕсли;
#КонецВставки  

	ТекущийДокумент = Форма.ТекущийДокумент;
	ПрочтениеУстановлено = Ложь;
	
	ДопПараметры = ОбзорОбъектовКлиентСервер.НовыйДопПараметрыМиникарточки();
	ДопПараметры.ПоказыватьУдаленныеФайлы = Форма.ПоказыватьУдаленныеФайлы;
	Если ТипЗнч(Форма.ВидДокументаКэш) = Тип("Структура") Тогда
		ДопПараметры.ПредыдущийВидДокумента = Форма.ВидДокументаКэш.Ссылка;
	КонецЕсли;
	ДанныеМиникарточки = ОбзорСпискаДокументов.ПолучитьДанныеМиникарточки(ТекущийДокумент, ДопПараметры);
	
	Если ПрочтениеУстановлено Тогда	
		Оповестить("ПрочтениеОбновитьСписок", ТекущийДокумент);
	КонецЕсли;
	
	Форма.ОбзорHTML = ДанныеМиникарточки.Обзор;  
	
	Форма.ДокументПодписан = ДанныеМиникарточки.ДокументПодписан;
	
	Если ТипЗнч(ДанныеМиникарточки.ВидДокументаКэш) = Тип("Структура") Тогда
		Форма.ВидДокументаКэш = Новый Структура;
		Форма.ВидДокументаКэш = ДанныеМиникарточки.ВидДокументаКэш;
		ВидимостьКомандСервиса1CShare = ИнтеграцияShareДокументооборотКлиентСервер.ВидимостьКомандСервиса1CShare(Форма,
			Форма.ВидДокументаКэш);
		Если ВидимостьКомандСервиса1CShare.ИспользоватьСервис1CShare Тогда				
			Форма.Элементы.ОбщаяКомандаПоделитьсяДокументомShare.Видимость = ВидимостьКомандСервиса1CShare.Видимость;
		КонецЕсли;
	КонецЕсли;
	
	#Если МобильныйКлиент Тогда
		МК_КлиентСервер.АдаптироватьHtmlПодЭкранМобильногоПриНеобходимости(Форма.ОбзорHTML);
	#КонецЕсли
	
	Форма.ЗапретитьРедактироватьФайлы = ДанныеМиникарточки.ЗапретитьРедактироватьФайлы;
		
	Форма.ЗапретитьУдалятьФайлы = ДанныеМиникарточки.ЗапретитьУдалятьФайлы;
	Форма.СостояниеТекст = ДанныеМиникарточки.СостояниеТекст;
	
	ЗаполнитьДеревоФайлов(Форма, ДанныеМиникарточки);
	
	Форма.СписокЗадачи.Очистить();
	Для Каждого Строка Из ДанныеМиникарточки.Задачи Цикл
		НоваяСтрока = Форма.СписокЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Форма.КоличествоЗадач = ДанныеМиникарточки.Задачи.Количество();
	
	УстановитьДоступностьКомандМиникарточкиПоСостоянию(Форма, ДанныеМиникарточки);
	Форма.ДоступныеПоля = ДанныеМиникарточки.ОбщиеДоступныеПоля;
	Форма.НедоступныеПоля = ДанныеМиникарточки.ОбщиеНедоступныеПоля;
	
	Если СтрНайти(Форма.ИмяФормы, "ДокументыПредприятия") <> 0 Тогда
		
		Форма.ТекущееСостояниеОбработки = ДанныеМиникарточки.СостояниеОбработки;
		
		Форма.ТекущийЧислоРолейФайлов = ДанныеМиникарточки.ТекущийЧислоРолейФайлов;
		
		Если Не ЗначениеЗаполнено(Форма.ПереключательПоказыватьПодробности) Тогда 
			Форма.ПереключательПоказыватьПодробности = "Описание";
			Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.ГруппаСодержаниеФайлы;
		КонецЕсли;
		ВывестиЗаголовкиПереключателя(Форма);
	Иначе 
		ВывестиЗаголовкиЗакладок(Форма);
	КонецЕсли;
	
КонецПроцедуры
