#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	ВидУчастниковЗадачОбъект = Исполнитель.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Исполнитель'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Исполнители'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Контролер.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Контролер'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Контролеры'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = ОбеспечивающийПодписание.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Обеспечивающий подписание'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Обеспечивающие подписание'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = ОбрабатывающийРезолюцию.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Обрабатывающий резолюцию'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Обрабатывающие резолюцию'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Истина;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = ОбрабатывающийРезультат.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Обрабатывающий результат'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Обрабатывающие результат'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Истина;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Ознакомляемый.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Ознакомляемый'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Ознакомляемые'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = ОзнакомляемыйСРезультатом.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Ознакомляемый с результатом'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Ознакомляемые с результатом'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Истина;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = ОтКого.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'От кого'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'От кого'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Истина;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Ответственный.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Ответственный'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Ответственные'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Истина;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Подписывающий.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Подписывающий'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Подписывающие'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Приглашенный.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Приглашенный'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Приглашенные'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Проверяющий.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Проверяющий'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Проверяющие'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Истина;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Рассматривающий.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Рассматривающий'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Рассматривающие'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = РассматривающийВопрос.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Рассматривающий вопрос'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Рассматривающие вопрос'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = РассматривающийЗапрос.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Рассматривающий запрос'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Рассматривающие запрос'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Регистратор.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Регистратор'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Регистраторы'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Согласующий.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Согласующий'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Согласующие'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
	ВидУчастниковЗадачОбъект = Утверждающий.ПолучитьОбъект();
	ВидУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Утверждающий'");
	ВидУчастниковЗадачОбъект.МножественноеЧисло = НСтр("ru = 'Утверждающие'");
	ВидУчастниковЗадачОбъект.ЭтоИсполнитель = Истина;
	ВидУчастниковЗадачОбъект.ЭтоОтветственный = Ложь;
	ВидУчастниковЗадачОбъект.ЭтоПроверяющий = Ложь;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидУчастниковЗадачОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыУчастниковЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыУчастниковЗадач КАК ВидыУчастниковЗадач
	|ГДЕ
	|	НЕ ВидыУчастниковЗадач.ПометкаУдаления
	|	И ВидыУчастниковЗадач.Наименование ПОДОБНО &СтрокаПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыУчастниковЗадач.Наименование";
	
	ОбъектМетаданных = Метаданные.Справочники.ВидыУчастниковЗадач;
	Если Не МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(ОбъектМетаданных.ТабличныеЧасти.Найти("Представления") = Неопределено) Тогда
		
		Если МультиязычностьСервер.ИспользуетсяПервыйДополнительныйЯзык() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"ВидыУчастниковЗадач.Наименование ПОДОБНО &СтрокаПоиска",
				"(ВидыУчастниковЗадач.Наименование ПОДОБНО &СтрокаПоиска ИЛИ ВидыУчастниковЗадач.НаименованиеЯзык1 ПОДОБНО &СтрокаПоиска)");
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли