
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Стандартные") Тогда
		Параметры.Отбор.Очистить();
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЭтоНастройкаДействияРегистрацииУтверждения = Ложь;
	
	Если Параметры.Отбор.Свойство("Ссылка")
		И (ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СправочникСсылка.НастройкиДействийРегистрации")
		Или ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СправочникСсылка.НастройкиДействийУтверждения")) Тогда
		
		ЭтоНастройкаДействияРегистрацииУтверждения = Истина;
		
	КонецЕсли;
	
	Параметры.Вставить("Стандартные");
	ДанныеВыбора = ПолучитьДанныеВыбора(Параметры);
	
	Если ЭтоНастройкаДействияРегистрацииУтверждения Тогда
		
		КоличествоЭлементов = ДанныеВыбора.Количество();
		Для Индекс = 1 По КоличествоЭлементов Цикл
			
			ОбратныйИндекс = КоличествоЭлементов - Индекс;
			ЭлементДанныхВыбора = ДанныеВыбора[ОбратныйИндекс];
			
			Если ЭлементДанныхВыбора.Значение.Значение = РазрешеноДобавлять Тогда
				ДанныеВыбора.Удалить(ОбратныйИндекс);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли