
#Область ОбработчикиСобытийФормы

	&НаКлиенте
	Процедура ПриЗакрытии(ЗавершениеРаботы)
		
		Если ОбщегоНазначенияДокументооборотКлиент.ПриЗакрытии(ЗавершениеРаботы) Тогда
			Возврат;
		КонецЕсли;
		
		Если ВсегдаРегистрировать Тогда 
			ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(
				"НастройкиРаботыСДокументами", 
				"ВариантПредупрежденияПриЗакрытииВходящего", 
				"ВсегдаРегистрировать");
			ОбновитьПовторноИспользуемыеЗначения();
		КонецЕсли;	
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

	&НаКлиенте
	Процедура Зарегистрировать(Команда)
		
		Закрыть("Зарегистрировать");
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура НеРегистрировать(Команда)
		
		Закрыть("НеРегистрировать");
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Отмена(Команда)
		
		Закрыть("Отмена");
		
	КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	#Область СлужебныеПроцедурыИФункции_НагрузочноеТестирование
		// Функции-обертки для программного вызова команд и обработчиков, как-будто они вызываются интерактивно.
		
		&НаКлиенте
		Функция НТ_НеРегистрировать() Экспорт
			
			НеРегистрировать(Неопределено); //@skip-check invocation-form-event-handler
			Возврат Истина;
			
		КонецФункции
	
	#КонецОбласти

#КонецОбласти