&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		Для каждого ПараметрОтбора Из Параметры.Отбор Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, ПараметрОтбора.Ключ, ПараметрОтбора.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("Ответственный") 
		И ТипЗнч(Параметры.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
		
		СотрудникиПользователя = Сотрудники.СотрудникиПользователя(Параметры.Ответственный);
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникиПользователя", СотрудникиПользователя);
		
	КонецЕсли;
	
КонецПроцедуры
