#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает список с подразделениями, в которых переданный пользователь является руководителем
// с учетом делегирования прав по ежедневным отчетам или всех прав
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Массив - Массив подразделений, где пользователь руководит непосредственно
//	или через делегирование. Отсортирован по представлениям подразделений.
//
Функция МассивПодразделенийДляПросмотраОтчетовОТрудозатратах(Сотрудник) Экспорт

	ЗапросПользователей = Новый Запрос;
	ЗапросПользователей.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиРолейИДелегаты.РольСотрудник КАК РольСотрудник
		|ИЗ
		|	РегистрСведений.ИсполнителиРолейИДелегаты КАК ИсполнителиРолейИДелегаты
		|ГДЕ
		|	ИсполнителиРолейИДелегаты.ИсполнительДелегат = &ИсполнительДелегат
		|	И ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования В (""ЕжедневныеОтчеты"", """")";
	
	ЗапросПользователей.УстановитьПараметр("ИсполнительДелегат", Сотрудник);
	МассивПользователей = ЗапросПользователей.Выполнить().Выгрузить().ВыгрузитьКолонку("РольСотрудник");
	МассивПользователей.Добавить(Сотрудник);
	
	Подразделения = СтруктураПредприятия.ПодчиненныеПодразделения(МассивПользователей, Истина);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Подразделения);
	СписокПодразделений.СортироватьПоЗначению();
	
	Возврат СписокПодразделений.ВыгрузитьЗначения();
	
КонецФункции

#КонецОбласти

#КонецЕсли
