#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПереключитьОтображениеУдаленных(Список, ПоказыватьУдаленныеНедействительные);
	Элементы.ФормаПоказыватьУдаленныеНедействительные.Пометка = ПоказыватьУдаленныеНедействительные;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьУдаленныеНедействительные(Команда)
	
	ПоказыватьУдаленныеНедействительные = Не ПоказыватьУдаленныеНедействительные;
	Элементы.ФормаПоказыватьУдаленныеНедействительные.Пометка = ПоказыватьУдаленныеНедействительные;
	ПереключитьОтображениеУдаленных(Список, ПоказыватьУдаленныеНедействительные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьОтображениеУдаленных(Список, ПоказыватьУдаленныеНедействительные)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, , , НЕ ПоказыватьУдаленныеНедействительные,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто,
		Строка(Новый УникальныйИдентификатор));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Недействителен", Ложь, , , НЕ ПоказыватьУдаленныеНедействительные,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто,
		Строка(Новый УникальныйИдентификатор));
		
КонецПроцедуры

#КонецОбласти