////////////////////////////////////////////////////////////////////////////////
// Работа с процессами по обработкам объектов (повторного использования): содержит
// функции с закэшированными результатами для работы с процессами по обработкам объектов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает необходимость выполнения обработки объектов процессами.
//
// Возвращаемое значение:
//  Булево
//
Функция ВыполнятьОбработкуОбъектовПроцессами() Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектов.ВыполнятьОбработкуОбъектовПроцессами();
	
КонецФункции

#КонецОбласти