#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение категорий и разделов в зависимости от варианта отчета.
// 
// Параметры:
//  КлючВариантаОтчета - Строка - Строковое название варианта отчета
//  СписокКатегорий    - СписокЗначений Из Строка - В список добавляются необходимые категории
//  СписокРазделов     - СписокЗначений Из Строка - В список добавляются необходимые категории
//
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.НастройкаИАдминистрирование));
	
	Если КлючВариантаОтчета = "Основной" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Администрирование);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли