
&После("ОбработкаЗаполнения")
Процедура ЦППК_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Родитель")
			И Родитель <> ДанныеЗаполнения.Родитель Тогда
			
			//++AxelSoft Шарапова 02.09.2024 САНФ-028203
			Если ТипЗнч(ДанныеЗаполнения.Родитель) = Тип("ФиксированныйМассив") И ДанныеЗаполнения.Родитель.Количество() > 0 Тогда
				Родитель = ДанныеЗаполнения.Родитель[0];
			Иначе
				Родитель = ДанныеЗаполнения.Родитель;
			КонецЕсли;
			//--AxelSoft Шарапова 02.09.2024 САНФ-028203
		КонецЕсли;
		
	Конецесли;
		
КонецПроцедуры
