// Возвращает список наименований стандартных разделов поиска
//
Функция ПолучитьСтандартныеРазделыПоиска() Экспорт
	
	НаименованияСтандартныхРазделов = ПолучитьНаименованияСтандартныхРазделовПоиска();
	Результат = Новый СписокЗначений;
	Для каждого Наименование Из НаименованияСтандартныхРазделов Цикл
		Результат.Добавить(ПолучитьСтандартныйРазделПоискаПоНаименованию(Наименование), Наименование);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена стандартных разделов поиска
Функция ПолучитьНаименованияСтандартныхРазделовПоиска() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(НСтр("ru = 'Документы и файлы'"));
	Результат.Добавить(НСтр("ru = 'Файлы'"));
	Результат.Добавить(НСтр("ru = 'Задачи и процессы'"));
	Результат.Добавить(НСтр("ru = 'Обработки объектов'"));
	Результат.Добавить(НСтр("ru = 'Документы, без файлов'"));
	Результат.Добавить(НСтр("ru = 'Входящие письма, без файлов'"));
	Результат.Добавить(НСтр("ru = 'Исходящие письма, без файлов'"));
	Результат.Добавить(НСтр("ru = 'Проекты'"));
	Результат.Добавить(НСтр("ru = 'Мероприятия, без файлов'"));
	Результат.Добавить(НСтр("ru = 'Форум, без файлов'"));
	Результат.Добавить(НСтр("ru = 'Календарь'"));
	Результат.Добавить(НСтр("ru = 'Контрагенты и контактные лица'"));
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак того, что передано наименование стандартного раздела поиска.
//
Функция ЭтоСтандартныйРазделПоиска(Наименование) Экспорт
	
	НаименованияСтандартныхРазделов = ПолучитьНаименованияСтандартныхРазделовПоиска();
	Возврат НаименованияСтандартныхРазделов.Найти(Наименование) <> Неопределено;
	
КонецФункции

// Возвращает массив метаданных для предопределенного раздела поиска
//
Функция ПолучитьСтандартныйРазделПоискаПоНаименованию(Наименование) Экспорт
	
	Результат = Новый Массив;
	Если ВРег(Наименование) = ВРег(НСтр("ru = 'Документы и файлы'")) Тогда
		Результат.Добавить("Метаданные.Справочники.ДокументыПредприятия");
		Результат.Добавить("Метаданные.Справочники.Файлы");
		Результат.Добавить("Метаданные.Справочники.ВерсииФайлов");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Файлы'")) Тогда
		Результат.Добавить("Метаданные.Справочники.Файлы");
		Результат.Добавить("Метаданные.Справочники.ВерсииФайлов");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Задачи и процессы'")) Тогда
		Результат.Добавить("Метаданные.Задачи.ЗадачаИсполнителя");
		Результат.Добавить("Метаданные.БизнесПроцессы.Исполнение");
		Результат.Добавить("Метаданные.БизнесПроцессы.КомплексныйПроцесс");
		Результат.Добавить("Метаданные.БизнесПроцессы.Ознакомление");
		Результат.Добавить("Метаданные.БизнесПроцессы.Рассмотрение");
		Результат.Добавить("Метаданные.БизнесПроцессы.Регистрация");
		Результат.Добавить("Метаданные.БизнесПроцессы.Согласование");
		Результат.Добавить("Метаданные.БизнесПроцессы.Утверждение");
		Результат.Добавить("Метаданные.Документы.ДействиеЗадачи");
		Результат.Добавить("Метаданные.Документы.Задача");

	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Обработки объектов'")) Тогда
		Результат.Добавить("Метаданные.Справочники.ОбработкиОбъектов");
		Результат.Добавить("Метаданные.Справочники.ДействияИсполнения");
		Результат.Добавить("Метаданные.Справочники.ДействияОзнакомления");
		Результат.Добавить("Метаданные.Справочники.ДействияПодписания");
		Результат.Добавить("Метаданные.Справочники.ДействияРегистрации");
		Результат.Добавить("Метаданные.Справочники.ДействияСогласования");
		Результат.Добавить("Метаданные.Справочники.ДействияУтверждения");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Документы, без файлов'")) Тогда
		Результат.Добавить("Метаданные.Справочники.ДокументыПредприятия");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Входящие письма, без файлов'")) Тогда
		Результат.Добавить("Метаданные.Документы.ВходящееПисьмо");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Исходящие письма, без файлов'")) Тогда
		Результат.Добавить("Метаданные.Документы.ИсходящееПисьмо");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Проекты'")) Тогда
		Результат.Добавить("Метаданные.Справочники.Проекты");
		Результат.Добавить("Метаданные.Справочники.ПроектныеЗадачи");
	
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Мероприятия, без файлов'")) Тогда
		Результат.Добавить("Метаданные.Справочники.Мероприятия");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Форум, без файлов'")) Тогда
		Результат.Добавить("Метаданные.Справочники.ТемыОбсуждений");
		Результат.Добавить("Метаданные.Справочники.СообщенияОбсуждений");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Календарь'")) Тогда
		Результат.Добавить("Метаданные.Справочники.ЗаписиРабочегоКалендаря");
		
	ИначеЕсли ВРег(Наименование) = ВРег(НСтр("ru = 'Контрагенты и контактные лица'")) Тогда
		Результат.Добавить("Метаданные.Справочники.Контрагенты");
		Результат.Добавить("Метаданные.Справочники.КонтактныеЛица");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру настроек поиска по умолчанию
//
Функция ПолучитьНастройкиПоискаПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИскатьСочетанияСлов", 0);
	Результат.Вставить("РезультатовНаСтранице", 20);
	Результат.Вставить("ОтображатьТекстовоеОписание", Истина);
	Результат.Вставить("ОтображатьДополнительнуюИнформацию", Истина);
	Результат.Вставить("ВыделятьСловаЦветом", Ложь);
	Результат.Вставить("ИскатьСловаСОшибками", Ложь);
	Результат.Вставить("ПорогНечеткости", 20);
	Результат.Вставить("РазделыПоиска", ПолучитьСтандартныеРазделыПоиска());
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку с дополнительной информацией по объекту
//
Функция ПолучитьДополнительнуюИнформациюПоОбъекту(Ссылка) Экспорт
	
	ТипЗначения = ТипЗнч(Ссылка);
	Результат = "";
	
	Если ТипЗначения = Тип("РегистрСведенийКлючЗаписи.ТекстыВерсийФайлов") Тогда
		
		Версия = Ссылка.Версия;
		Владелец = ПолучитьЗначениеРеквизитаБезопасно(Версия, "Владелец", "");
		ВладелецФайла = Неопределено;
		Если ЗначениеЗаполнено(Владелец) Тогда
			Файл = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл: %1'"), Владелец);
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Файл);
			ВладелецФайла = ПолучитьЗначениеРеквизитаБезопасно(Владелец, "ВладелецФайла", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			СтрокаВладелецФайла = СтрШаблон(
				НСтр("ru = 'Принадлежит: <font color=""#006699""><a href = v8doc:%1>%2 (%3)</a></font>'"),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ПолучитьНавигационнуюСсылку(ВладелецФайла)),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(ВладелецФайла)),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(ТипЗнч(ВладелецФайла))));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", СтрокаВладелецФайла);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ТипЗначения = Тип("РегистрСведенийКлючЗаписи.ТекстыФайлов") Тогда
		
		Файл = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл: %1'"), Ссылка.Файл);
		ВладелецФайла = ПолучитьЗначениеРеквизитаБезопасно(Ссылка.Файл, "ВладелецФайла", "");
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Файл);
		Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			СтрокаВладелецФайла = СтрШаблон(
				НСтр("ru = 'Принадлежит: <font color=""#006699""><a href = v8doc:%1>%2 (%3)</a></font>'"),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ПолучитьНавигационнуюСсылку(ВладелецФайла)),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(ВладелецФайла)),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(ТипЗнч(ВладелецФайла))));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", СтрокаВладелецФайла);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Не (Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения)
		Или Документы.ТипВсеСсылки().СодержитТип(ТипЗначения)
		Или Задачи.ТипВсеСсылки().СодержитТип(ТипЗначения)
		Или БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗначения)) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗначения = Тип("СправочникСсылка.ВерсииФайлов") Тогда
		Владелец = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "Владелец", "");
		Если ЗначениеЗаполнено(Владелец) Тогда
			Файл = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл: %1'"), Владелец);
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Файл);
		КонецЕсли;
	КонецЕсли;
	
	ИнформацияОВладельце = "";
	Папка = "";
	Владелец = "";
	Если ТипЗначения = Тип("СправочникСсылка.Файлы") Тогда
		ВладелецФайла = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "ВладелецФайла", "");
		Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			Если ТипЗнч(ВладелецФайла) = Тип("СправочникСсылка.ПапкиФайлов") Тогда
				Папка = ПолучитьПолныйПутьПапки(ВладелецФайла);
			ИначеЕсли ДелопроизводствоКлиентСервер.ЭтоДокумент(ВладелецФайла) Тогда
				Владелец = Строка(ВладелецФайла);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВерсииФайлов") Тогда
		ВладелецВерсии = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "Владелец", "");
		Если ЗначениеЗаполнено(ВладелецВерсии) Тогда
			ВладелецФайла = ПолучитьЗначениеРеквизитаБезопасно(ВладелецВерсии, "ВладелецФайла", "");
			Если ЗначениеЗаполнено(ВладелецФайла) Тогда
				Если ТипЗнч(ВладелецФайла) = Тип("СправочникСсылка.ПапкиФайлов") Тогда
					Папка = ПолучитьПолныйПутьПапки(ВладелецФайла);
				ИначеЕсли ДелопроизводствоКлиентСервер.ЭтоДокумент(ВладелецФайла) Тогда
					Владелец = Строка(ВладелецФайла);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
		ПапкаДокумента = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "Папка", "");
		Если ЗначениеЗаполнено(ПапкаДокумента) Тогда
			Папка = ПолучитьПолныйПутьПапки(ПапкаДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Папка) Тогда
		Папка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Папка: %1'"), Папка);
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Папка);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Владелец) Тогда
		Владелец = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Принадлежит документу: %1'"), Владелец);
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Владелец);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ПредметыЗадачи = МультипредметностьКлиентСервер.ПолучитьМассивСтруктурПредметовОбъекта(Ссылка);
		
		Если ПредметыЗадачи.Количество() > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			Предметы = МультипредметностьКлиентСервер.ПредметыСтрокой(ПредметыЗадачи, Ложь, Ложь);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		Если Не ПустаяСтрока(Предметы) Тогда
			Если ПредметыЗадачи.Количество() = 1 Тогда
				Предметы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Предмет: %1'"), Предметы);
			Иначе
				Предметы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Предметы: %1'"), Предметы);
			КонецЕсли;
		Иначе
			Предметы = НСтр("ru = 'Предмет не задан'");
		КонецЕсли;
		ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Предметы);
	КонецЕсли;
	
	Если ТипЗначения = Тип("СправочникСсылка.Мероприятия") Тогда
		
		ДатаНачала = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "ДатаНачала", "");
		ДатаОкончания = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "ДатаОкончания", "");
		
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Начало: %1'"), Формат(ДатаНачала, "ДФ='dd.MM.yyyy hh:mm'"));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Окончание: %1'"), Формат(ДатаОкончания, "ДФ='dd.MM.yyyy hh:mm'"));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗначения = Тип("СправочникСсылка.ПроектныеЗадачи") Тогда
		
		Проект = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "Владелец", "");
		
		Если ЗначениеЗаполнено(Проект) Тогда
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Проект: ""%1"".'"), Строка(Проект));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВстроеннаяПочтаКлиентСервер.ЭтоПисьмо(Ссылка) Тогда
		
		Тема = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "Тема", "");
		
		Если ЗначениеЗаполнено(Тема) Тогда
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Тема: ""%1"".'"), Строка(Тема));
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
		КонецЕсли;
		
		Если ТипЗначения = Тип("ДокументСсылка.ВходящееПисьмо") Тогда
			
			ОтправительАдресат = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "ОтправительАдресат", "");
			
			Если ЗначениеЗаполнено(ОтправительАдресат) Тогда
				Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'От кого: %1.'"), Строка(ОтправительАдресат));
				ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗначения = Тип("ДокументСсылка.ИсходящееПисьмо") Тогда
			
			ПолучателиПисьмаСтрокой = ПолучитьЗначениеРеквизитаБезопасно(Ссылка, "ПолучателиПисьмаСтрокой", "");
			
			Если ЗначениеЗаполнено(ПолучателиПисьмаСтрокой) Тогда
				Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Кому: %1.'"), Строка(ПолучателиПисьмаСтрокой));
				ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Описание);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКатегорииДанных") Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КатегорииОбъектов.КатегорияДанных КАК Категория
			|ИЗ
			|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КатегорииДанных КАК КатегорииДанных
			|		ПО КатегорииОбъектов.КатегорияДанных = КатегорииДанных.Ссылка
			|ГДЕ
			|	КатегорииОбъектов.ОбъектДанных = &ОбъектДанных");
		
		Запрос.УстановитьПараметр("ОбъектДанных", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Категории = "";
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ДобавитьЗначениеКСтрокеЧерезРазделитель(Категории, ", ", Выборка.Категория);
			КонецЦикла;
			
			Если Выборка.Количество() = 1 Тогда
				Категории = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Категория: %1'"), Категории);
			Иначе
				Категории = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Категории: %1'"), Категории);
			КонецЕсли;
			
			ДобавитьЗначениеКСтрокеЧерезРазделитель(Результат, "; ", Категории);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Принимает массив ссылок на объекты - результаты поиска
// Возвращает соответствие с дополнительной информацией по объектам
//
Функция ПолучитьДополнительнуюИнформациюПоОбъектам(Массив) Экспорт
	
	Результат = Новый Соответствие;
	Для каждого Элемент Из Массив Цикл
		Результат.Вставить(Элемент, ПолучитьДополнительнуюИнформациюПоОбъекту(Элемент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолныйПутьПапки(Папка)
	
	Если Не ЗначениеЗаполнено(Папка) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекПапка = Папка;
	Результат = " \ " + Строка(ТекПапка);
	Родитель = ПолучитьЗначениеРеквизитаБезопасно(ТекПапка, "Родитель", "");
	Пока ЗначениеЗаполнено(Родитель) Цикл
		ТекПапка = Родитель;
		Результат = " \ " + Строка(ТекПапка) + Результат;
		Родитель = ПолучитьЗначениеРеквизитаБезопасно(ТекПапка, "Родитель", "");
	КонецЦикла;
	
	Возврат Сред(Результат, 4);
	
КонецФункции

Функция ПолучитьЗначениеРеквизитаБезопасно(Ссылка, ИмяРеквизита, ЗначениеПриОшибке = Неопределено)
	
	Попытка
		ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	Исключение
		ЗначениеРеквизита = ЗначениеПриОшибке;
	КонецПопытки;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции
