///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа,
//                               см. УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
//  ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
//  ОписаниеПапки.Имя           = "ДополнительныеПрофили";
//  ОписаниеПапки.Идентификатор = "69a066e7-ce81-11eb-881c-b06ebfbf08c7";
//  ОписаниеПапки.Наименование  = НСтр("ru = 'Дополнительные профили'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписанияПрофилей.Добавить(ОписаниеПапки);
//
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Родитель = "ДополнительныеПрофили";
//  ОписаниеПрофиля.Идентификатор = "70179f20-2315-11e6-9bff-d850e648b60c";
//  ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование, отправка по почте, сохранение в файл печатных форм (дополнительно)'",
//  	ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительно назначается пользователям, которым должна быть доступна возможность редактирования,
//  	|перед печатью, отправка по почте и сохранение в файл сформированных печатных форм.'");
//  ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ОбновлятьИзмененныеПрофили = Ложь;
	ПараметрыОбновления.ЗапретитьИзменениеПрофилей = Ложь;
	
	// Описание для заполнения профиля "Делопроизводители".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "eeb325ab-db51-11de-a544-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Делопроизводители'");
	ОписаниеПрофиля.Роли.Добавить("РаботаСДеламиХраненияДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки"); // для заполнения по ИНН
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДелХраненияДокументов");
	ОписаниеПрофиля.Роли.Добавить("АнализДелопроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВЖурналПередачиДокументов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСДокументамиПредприятия");
	ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДокументовПредприятия"); // Для ограничения по виду доступа "ВидыДокументов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаКонтрагентов"); // Для ограничения по виду доступа "ГруппыДоступаКонтрагентов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаФизическихЛиц"); // Для ограничения по виду доступа "ГруппыДоступаФизическихЛиц"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВопросовДеятельности"); // Для ограничения по виду доступа "ВопросыДеятельности"
	ОписаниеПрофиля.Роли.Добавить("РегистрацияДокументовПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ОписаниеПрофиля.Роли.Добавить("РаботаСМероприятиями");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеИВыгрузкаОтчетовВССТУ");
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеПоЗапросу"); // Для ограничения доступности команды Распознать.
	ОписаниеПрофиля.Роли.Добавить("ЗапускДействийРегламентированнойОбработкиВнеОчереди");
	ОписаниеПрофиля.Роли.Добавить("ПомещениеДействийВИсторию");
	ОписаниеПрофиля.Роли.Добавить("УстановкаРезультатовДействиямОбработки");
	ОписаниеПрофиля.Роли.Добавить("УсовершенствованиеЭлектронныхПодписей");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Контроль задач и бизнес-процессов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "7bc7f2d8-db69-11de-a544-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Контроль задач и бизнес-процессов'");
	ОписаниеПрофиля.Роли.Добавить("КонтрольЗадачИБизнесПроцессов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Ответственные за НСИ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "7bc7f2da-db69-11de-a544-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственные за НСИ'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("АнализДелопроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаКонтрагентов"); // Для ограничения по виду доступа "ГруппыДоступаКонтрагентов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаФизическихЛиц"); // Для ограничения по виду доступа "ГруппыДоступаФизическихЛиц"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВопросовДеятельности"); // Для ограничения по виду доступа "ВопросыДеятельности"
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТоваровИУслуг");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКалендарныхГрафиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбработкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщихКатегорий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеестров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРекомендованныхНастроек");
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");  // 1СПАРКРиски
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски");  // 1СПАРКРиски
	ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Описание для заполнения профиля "Пользователи".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "c999acb1-d5f5-11de-a544-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователи'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗадачами");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗадачамиИБизнесПроцессами");
	ОписаниеПрофиля.Роли.Добавить("РаботаСДокументамиПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускМобильногоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаПередачиДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДокументовПредприятия"); // Для ограничения по виду доступа "ВидыДокументов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаКонтрагентов"); // Для ограничения по виду доступа "ГруппыДоступаКонтрагентов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаФизическихЛиц"); // Для ограничения по виду доступа "ГруппыДоступаФизическихЛиц"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВопросовДеятельности"); // Для ограничения по виду доступа "ВопросыДеятельности"
	ОписаниеПрофиля.Роли.Добавить("ПодготовкаСогласияНаОбработкуПерсональныхДанных");
	ОписаниеПрофиля.Роли.Добавить("РежимТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("РаботаССоцсетямиИYouTube"); // Ссылки на соцсети и YouTube на начальной странице
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗаметкамиДокументооборота");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСПКОРП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФактическихТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("РаботаСоВстроеннойЭлектроннойПочтой");
	ОписаниеПрофиля.Роли.Добавить("РаботаСМероприятиями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокМероприятий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("РаботаСКонтрольнымиТочками");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");  // Библиотека электронного документооборота
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");  // Использование универсального отчета
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");  // 1СПАРКРиски
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКаналовОбсуждений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеестров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРекомендованныхНастроек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСервисаDSS");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваРаботаСРечью");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМЭДО");
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	КонецЕсли;
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСогласийНаОбработкуПерсональныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписей");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУведомленийЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписанияДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентамиДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументовПоДокументамДО");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисShare");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Руководители подразделений".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "a35aa932-db5a-11de-a544-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководители подразделений'");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕжедневныхОтчетовСотрудниковПодразделения");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗадачамиСотрудниковПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФактическихТрудозатратСотрудниковПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрПротоколаРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗамещающихИПомощников");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Контроль ежедневных отчетов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f478ced5-eae5-11de-a248-00179ab398dc";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Контроль ежедневных отчетов'");
	ОписаниеПрофиля.Роли.Добавить("КонтрольЕжедневныхОтчетов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Руководители проектов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "b6e385e5-3d95-4ff3-819d-21a41547a1ad";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководители проектов'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФактическихТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнение профиля "Ответственные за МЭДО"
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "4a3c2c1a-3290-11ed-9ec2-4cedfb9508c3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственные за МЭДО'");
	ОписаниеПрофиля.Роли.Добавить("РаботаСМЭДО");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("РаботаСДокументамиПредприятия");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияДокументовПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций"); // Для ограничения по виду доступа "Организации"	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДокументовПредприятия"); // Для ограничения по виду доступа "ВидыДокументов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрифовДоступа"); // Для ограничения по виду доступа "ГрифыДоступа"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаКонтрагентов"); // Для ограничения по виду доступа "ГруппыДоступаКонтрагентов"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппДоступаФизическихЛиц"); // Для ограничения по виду доступа "ГруппыДоступаФизическихЛиц"
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВопросовДеятельности"); // Для ограничения по виду доступа "ВопросыДеятельности"
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	// Роли БЭД
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Мониторинг процессов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "9e3284ad-5a96-4fe6-a496-b29d9b6ed802";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Мониторинг процессов'");
	ОписаниеПрофиля.Роли.Добавить("РаботаСМониторингомПроцессов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Контроль самочувствия сотрудников".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ef65f931-bd18-473c-831f-9ab1b40bf0f9";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за учет самочувствия сотрудников'");
	ОписаниеПрофиля.Роли.Добавить("КонтрольСамочувствияСотрудников");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Уничтожение персональных данных".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "d439374c-5c12-4661-9ad3-b4fd3880cbf9";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Уничтожение персональных данных'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОбУничтоженииПерсональныхДанных");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Описание для заполнения профиля "Пользователи сервиса Таймлист".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f4445076-62d5-43e6-9c9a-f5774bfa8940";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователи сервиса Таймлист'");
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеТаймлист");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профили для работы с ЭДО
	
	// Оператор ЭДО
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f29fef1f-bac3-460c-a165-07230eac7a6c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Операторы ЭДО'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументовДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУведомленийЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентамиДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументовПоОрганизациямДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Ответственный за ЭДО и МЧД
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "bd0ef8cc-f453-4eb0-b77e-398f7990b955";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственные за ЭДО и МЧД'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭДДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписанияДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДКонтрагентовЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДОрганизацийЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентамиДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументовДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУведомленийЭДО");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДОДокументооборот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументовПоОрганизациямДокументооборот");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
//
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений:
//   * ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   * Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   * Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   * Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   * НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   * ТребуемыеПрава - Массив из Строка - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   * ЧтениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   * ИзменениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, для которого записываются наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

// Заполняет свойства видов доступа, добавленных прикладным разработчиком
// в план видов характеристик ВидыДоступа, как предопределенные элементы.
//
// Параметры:
//  Свойства - Структура со свойствами,
//             описание которых см. в комментарии к функции
//             ПланыВидовХарактеристик.ВидыДоступа.СвойстваВидовДоступа().
//
Процедура ЗаполнитьСвойстваВидаДоступа(Знач Свойства) Экспорт

	Если Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ВидыДокументов Тогда
		Свойства.Таблицы.Добавить("Справочник.ВидыДокументов");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГрифыДоступа Тогда
		Свойства.Таблицы.Добавить("Справочник.ГрифыДоступа");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		//Свойства.ВидДоступаИспользуется = "Константы.ИспользоватьГрифыДоступа.Получить()";
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ВопросыДеятельности Тогда
		Свойства.Таблицы.Добавить("Справочник.ВопросыДеятельности");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		//Свойства.ВидДоступаИспользуется = "Константы.ИспользоватьВопросыДеятельности.Получить()";
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Организации Тогда
		Свойства.Таблицы.Добавить("Справочник.Организации");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		//Свойства.ВидДоступаИспользуется = "Константы.ИспользоватьУчетПоОрганизациям.Получить()";
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыДоступаКонтрагентов Тогда
		Свойства.Таблицы.Добавить("Справочник.ГруппыДоступаКонтрагентов");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ГруппыДоступаФизическихЛиц Тогда
		Свойства.Таблицы.Добавить("Справочник.ГруппыДоступаФизическихЛиц");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.Подразделения Тогда
		Свойства.Таблицы.Добавить("Справочник.СтруктураПредприятия");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		
	ИначеЕсли Свойства.ВидДоступа = ПланыВидовХарактеристик.ВидыДоступа.ВидыМероприятий Тогда
		Свойства.Таблицы.Добавить("Справочник.ВидыМероприятий");
		Свойства.ВидДоступаБезГруппЗначенияДоступа            = Истина;
		Свойства.ВидДоступаЕдинственныйДляТипаЗначенияДоступа = Истина;
		//Свойства.ВидДоступаИспользуется = "Константы.ИспользоватьУправлениеМероприятиями.Получить()";
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает вид используемого интерфейса для настройки прав доступа.
//
//  Упрощенный интерфейс удобен для конфигураций с небольшим количеством пользователей,
// так как много функций не требуются и они могут быть скрыты (скрытие не может быть
// выполнено только лишь функциональной опцией, так как потребуется пересмотр
// содержимого групп доступа и профилей).
//
// Возвращаемое значение:
//  Булево
//
Функция УпрощенныйИнтерфейсНастройкиПравДоступа() Экспорт
	
	Возврат Ложь;
	
КонецФункции
