#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.СовместнаяРабота));
	
	Если КлючВариантаОтчета = "РеестрРешенийПротоколов" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.МероприятияСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоМероприятиям);
		
	ИначеЕсли КлючВариантаОтчета = "РеестрПорученийПротоколов" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.МероприятияСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоМероприятиям);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
