#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПересчета = НачалоГода(ТекущаяДатаСеанса());
	УдалитьСтарыеЗначения = Ложь;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.УдалитьСтарыеЗначения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.УдалитьСтарыеЗначения.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Пересчитать(Команда)
	
	НастройкиПересчета = Новый Структура("ДатаПересчета, УдалитьСтарыеЗначенияПоказателей");
	НастройкиПересчета.Вставить("ДатаПересчета", ДатаПересчета);
	НастройкиПересчета.Вставить("УдалитьСтарыеЗначения", УдалитьСтарыеЗначения);
	
	Закрыть(НастройкиПересчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

