
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаименованиеЭтапа = Параметры.НаименованиеЭтапа;
	ПорядокВыполненияУчастниками = Параметры.ПорядокВыполненияУчастниками;
	СпособПодписания = Параметры.СпособПодписания;
	
	ПодписаниеНаБумаге = Перечисления.СпособыПодписанияПредметаПроцесса.НаБумаге;
	
	Если Не ЗначениеЗаполнено(ПорядокВыполненияУчастниками) Тогда		
		ПорядокВыполнения = Перечисления.ПорядокВыполненияЭтапаПроцесса;		
		Если СпособПодписания = ПодписаниеНаБумаге Тогда
			ПорядокВыполненияУчастниками = ПорядокВыполнения.Последовательно;
		Иначе
			ПорядокВыполненияУчастниками = ПорядокВыполнения.Параллельно;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПорядокВыполненияУчастниками.ТолькоПросмотр = (СпособПодписания = ПодписаниеНаБумаге);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ЗначениеЗаполнено(НаименованиеЭтапа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указано наименование этапа'"),,,
			"НаименованиеЭтапа");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПорядокВыполненияУчастниками) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указан порядок выполнения этапа'"),,,
			"ПорядокВыполненияУчастниками");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НаименованиеЭтапа", НаименованиеЭтапа);
	Результат.Вставить("ПорядокВыполненияУчастниками", ПорядокВыполненияУчастниками);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти