
&НаКлиенте
&ИзменениеИКонтроль("СозданиеВнутреннегоДокументаНаОсновании")
Процедура ЦППК_СозданиеВнутреннегоДокументаНаОсновании(Результат, Параметры)

	Если НЕ ЗначениеЗаполнено(Результат) ИЛИ Результат = "ПрерватьОперацию" Тогда
		Возврат;
	КонецЕсли; 
	
    ПараметрыФормы = ДелопроизводствоКлиент.ПараметрыФормыДляСозданияДокумента(
	Результат, Параметры.ПараметрКоманды);
	
	#Вставка
	Если Параметры.ПараметрыВыполненияКоманды.Источник.ВидИТематикаТекст = "Журнал ТУ-1"
		Или Параметры.ПараметрыВыполненияКоманды.Источник.ВидИТематикаТекст = "Журнал ТУ-2" Тогда
		
		ПараметрыВыполненияКоманды = Новый Структура;
		ПараметрыВыполненияКоманды.Вставить("Источник", Параметры.ПараметрыВыполненияКоманды.Источник);
		ПараметрыВыполненияКоманды.Вставить("Уникальность", Новый УникальныйИдентификатор);
		
		Если ПараметрыФормы.ШаблонДокумента = ШаблонПоНаименованию("Журнал ТУ-2") Тогда
			
			ТТС_ЖурналыТУКлиент.ОбработкаКомандыЖТУНаОсновании(Неопределено, ПараметрыВыполненияКоманды, "ЖТУ2");
			Возврат;
			
		ИначеЕсли ПараметрыФормы.ШаблонДокумента = ШаблонПоНаименованию("Журнал ТУ-3") Тогда
			
			ТТС_ЖурналыТУКлиент.ОбработкаКомандыЖТУНаОсновании(Неопределено, ПараметрыВыполненияКоманды, "ЖТУ3");
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;	
	#КонецВставки

	Открытьформу("Справочник.ДокументыПредприятия.ФормаОбъекта", ПараметрыФормы, Параметры.ПараметрыВыполненияКоманды.Источник);

КонецПроцедуры  

Функция ШаблонПоНаименованию(ИмяШаблона)

	 Возврат Справочники.ШаблоныДокументов.НайтиПоНаименованию(ИмяШаблона);
    
КонецФункции 
 
Функция ДокументПоНаименованию(ИмяДокумента)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|ГДЕ
	|	НЕ ДокументыПредприятия.ПометкаУдаления
	|	И ДокументыПредприятия.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
КонецФункции


