
&ИзменениеИКонтроль("ПроверитьВозможностьСменыКлючевыхРеквизитов")
Функция ЦППК_ПроверитьВозможностьСменыКлючевыхРеквизитов(ВидОбъектаИзменен, Предмет)

	ОписаниеВозврата = Новый Структура("НадоЗадатьВопрос, Отказ, ТекстОшибки, ТекстВопроса",
	Ложь, Ложь, "", "");

	Если Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат ОписаниеВозврата;
	КонецЕсли;		

	СтруктураРезультата = ПравилаОбработкиВызовСервера.ПолучитьЗапущеннуюОбработкуИНастройки(Предмет);
	ОбработкаОбъекта = СтруктураРезультата.ОбработкаОбъекта;

	Если Не ЗначениеЗаполнено(ОбработкаОбъекта) Тогда
		Возврат ОписаниеВозврата;
	КонецЕсли;	

	#Вставка
	Если ОбщегоНазначенияДокументооборотВызовСервера.РолиДоступны("ЦППК_ИзменениеВидаДокументаПриЗапущеннойОбработке") Тогда
		Возврат ОписаниеВозврата;
	КонецЕсли;	
	#КонецВставки
	
	Если ВидОбъектаИзменен Тогда
		ОписаниеВозврата.Отказ = Истина;
		ОписаниеВозврата.ТекстОшибки = НСтр("ru = 'Изменение вида документа, запущенного в обработку, запрещено. 
		|Остановите обработку и повторите действие.'");
	КонецЕсли;	

	ПроверятьСхемуПриПерезаполненииОбработки = СтруктураРезультата.ПроверятьСхемуПриПерезаполненииОбработки;

	Если Не ПроверятьСхемуПриПерезаполненииОбработки Тогда //упрощенный режим

		ОписаниеВозврата.НадоЗадатьВопрос = Истина;
		ОписаниеВозврата.ТекстВопроса = НСтр("ru = 'Изменен реквизит, влияющий на обработку документа. 
		|Это может привести к некорректному прохождению обработки. 
		|Вы уверены?'");

	Иначе // умный режим (с проверкой схемы)

		ПравилаОбработкиВызовСервера.ПроверитьВозможностьСменыРеквизитовСПроверкойСхемы(
		Предмет, ОбработкаОбъекта, ОписаниеВозврата.Отказ, ОписаниеВозврата.ТекстОшибки);	

	КонецЕсли;

	Возврат ОписаниеВозврата;

КонецФункции
