#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Если не введено ни одно условие, тогда создаем строку с пустыми значениями.
	Если УсловияОтображения.Количество() = 0 Тогда
		НоваяСтрока = УсловияОтображения.Добавить();
		НоваяСтрока.Организация = Неопределено;
		НоваяСтрока.ВидДокумента = Неопределено;
		НоваяСтрока.СостояниеДокумента = Неопределено;
		НоваяСтрока.ГрифДоступа = Неопределено;
		НоваяСтрока.ВопросДеятельности = Неопределено;
		НоваяСтрока.ШаблонДокумента = Неопределено;
		НоваяСтрока.ШаблонПроцесса = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли