////////////////////////////////////////////////////////////////////////////////
// Пользователи документооборот (вызов сервера)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет, что текущий пользователь является служебным пользователем <Не указан>
//
// Возвращаемое значение:
//  Булево
//
Функция ТекущийПользовательНеУказан() Экспорт
	
	Возврат ПользователиДокументооборот.ТекущийПользовательНеУказан();
	
КонецФункции

#КонецОбласти