////////////////////////////////////////////////////////////////////////////////
// Работа с процессами по действиям (повторного использования): содержит
// функции с закэшированными результатами по обработке действий процессами.
//  
//////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти