
#Область ПрограммныйИнтерфейс

// Открывает форму для указания количества спикеров и последующего начала операции расшифровки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма-владелец.
//  Файлы - СписокЗначений Из СправочникСсылка.Файлы
//        - СправочникСсылка.Файлы
//  Оповещение - ОписаниеОповещения
//
Процедура НачатьРасшифровку(Форма, Файлы, Оповещение) Экспорт
	
	ПараметрыФормы = Новый Структура("ФайлыНаРасшифровку, РежимПолученияРасшифровки", Файлы, Истина);
	
	ОткрытьФорму("ОбщаяФорма.ТаймлистСпикеры", ПараметрыФормы, Форма,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму для указания имен спикеров и последующего начала операции получения автопротокола.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма-владелец.
//  Файл - СправочникСсылка.Файлы
//  Оповещение - ОписаниеОповещения
//  ОтборСотрудников - СписокЗначений Из СправочникСсылка.Сотрудники - список доступных к выбору сотрудников
//
Процедура НачатьПолучениеАвтопротокола(Форма, Файл, Оповещение, ОтборСотрудников = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("ФайлНаПолучениеАвтопротокола, РежимПолученияАвтопротокола, ОтборСотрудников",
		Файл, Истина, ОтборСотрудников);
	
	ОткрытьФорму("ОбщаяФорма.ТаймлистСпикеры", ПараметрыФормы, Форма,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти