#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей Нумераторов
//
// Возвращаемое значение:
//   Структура:
//   *  Наименование - Строка
//   *  Периодичность - ПеречислениеСсылка.ПериодичностьНумераторов
//   *  ФорматНомера - Строка
//   *  НезависимаяНумерацияПоВидуДокумента - Булево
//   *  НезависимаяНумерацияПоВопросуДеятельности - Булево
//   *  НезависимаяНумерацияПоГрифуДоступа - Булево
//   *  НезависимаяНумерацияПоОрганизациям - Булево
//   *  НезависимаяНумерацияПоПодразделению - Булево
//   *  НезависимаяНумерацияПоПроекту - Булево
//   *  НезависимаяНумерацияПоТематике - Булево
//   *  НезависимаяНумерацияПоУзлуКОД - Булево
//   *  ТипСвязи - СправочникСсылка.ТипыСвязей
//   *  Назначение - ПеречислениеСсылка.НазначенияНумераторов
//
Функция ПолучитьСтруктуруНумераторов() Экспорт
	
	ПараметрыНумераторов = Новый Структура;
	ПараметрыНумераторов.Вставить("Наименование");
	ПараметрыНумераторов.Вставить("Периодичность");
	ПараметрыНумераторов.Вставить("ФорматНомера");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоОрганизациям");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоСвязанномуДокументу");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПодразделению");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВидуДокумента");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПроекту");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВопросуДеятельности");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоТематике");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоГрифуДоступа");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоУзлуКОД");
	ПараметрыНумераторов.Вставить("ТипСвязи");
	ПараметрыНумераторов.Вставить("Назначение");
	ПараметрыНумераторов.Вставить("Пример");
	
	Возврат ПараметрыНумераторов;
	
КонецФункции

// Создает и записывает в БД Нумератор
//
// Параметры:
//  СтруктураНумератора - см. Справочники.Нумераторы.ПолучитьСтруктуруНумераторов
//
// Возвращаемое значение:
//  СправочникСсылка.Нумераторы
//
Функция СоздатьНумератор(СтруктураНумератора) Экспорт
	
	НовыйНумератор = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйНумератор, СтруктураНумератора);
	НовыйНумератор.Записать();
	
	Возврат НовыйНумератор.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли