#Область ПрограммныйИнтерфейс

// см. НастройкиДействий.ИмяСправочникаПоВидуДействия
// 
Функция ИмяСправочникаПоВидуДействия(Знач ВидДействия) Экспорт
	
	Возврат НастройкиДействий.ИмяСправочникаПоВидуДействия(ВидДействия);
	
КонецФункции

// см. НастройкиДействий.КоличествоНастроекПравилОбработки
//
Функция КоличествоНастроекПравилОбработки(РазрезНастройки) Экспорт 
	
	Возврат НастройкиДействий.КоличествоНастроекПравилОбработки(РазрезНастройки);
	
КонецФункции

// Включает или выключает настройку правила обработки
// 
// Параметры:
// 	ПравилоОбработки - СправочникСсылка.ПравилаОбработки - ссылка на правило обраобтки
// 	ВидДействия - СправочникСсылка.ВидыДействий - ссылка на вид действия
// 	НастройкаВключена - Булево - признак включения или выключения настройки.
//
Процедура ПереключитьНастройкуДействия(ПравилоОбработки, ВидДействия, НастройкаВключена) Экспорт 
	
	РегистрыСведений.ПравилаОбработкиОбъектов.ПереключитьНастройкуДействия(
		ПравилоОбработки, ВидДействия, НастройкаВключена);
	
КонецПроцедуры

// см. НастройкиДействий.ЗаполнитьДействияДляПравилаОбработки
//
Процедура ЗаполнитьДействияДляПравилаОбработки(Действия, КлючНастроек) Экспорт 
	
	НастройкиДействий.ЗаполнитьДействияДляПравилаОбработки(Действия, КлючНастроек);
	
КонецПроцедуры

// см. НастройкиДействий.УдалитьНастройкуДействияПравилаОбработки
//
Процедура УдалитьНастройкуДействияПравилаОбработки(ПравилоОбработки, ВидДействия, Настройка) Экспорт 
	
	НастройкиДействий.УдалитьНастройкуДействияПравилаОбработки(ПравилоОбработки, ВидДействия, Настройка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти