#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидДокумента") Тогда
		
		Если Параметры.Свойство("МассивРоли") Тогда      
			
			МассивРоли = Параметры.МассивРоли;
			
		Иначе	
		
			ВидДокумента = Параметры.ВидДокумента;
			ТаблРоли = Делопроизводство.РолиФайловДляВидаДокументов(ВидДокумента);
			МассивРоли = ТаблРоли.ВыгрузитьКолонку("Роль");
			
		КонецЕсли;	
		
		Если МассивРоли.Количество() <> 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Ссылка",
				МассивРоли);
		КонецЕсли;		
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
