#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Индекс картинки коллекция взаимодействия сотрудников.
// 
// Параметры:
//  СостояниеОбработки - ПеречислениеСсылка.СостоянияОбработкиОбъектов.
// 
// Возвращаемое значение:
//  Число - Индекс картинки коллекции взаимодействия сотрудников.
//  
Функция ИндексКартинкиКоллекцияВзаимодействияСотрудников(СостояниеОбработки) Экспорт
	
	Если СостояниеОбработки = Завершена Тогда
		ИндексКартинки = 0;
	ИначеЕсли СостояниеОбработки = Выполняется Тогда
		ИндексКартинки = 1;
	ИначеЕсли СостояниеОбработки = Остановлена Тогда
		ИндексКартинки = 2;
	Иначе
		ИндексКартинки = 3;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

#КонецОбласти

#КонецЕсли