#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет предопределенные области.
// 
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	ЭлементыСОсобымПорядком = Новый Соответствие;
	ЭлементыСОсобымПорядком[Справочники.ОбластиЗамещения.ДокументыПоручение] = 1;
	ЭлементыСОсобымПорядком[Справочники.ОбластиЗамещения.ДокументыПросмотрИРедактирование] = 2;
	
	Для Каждого КлючИЗначение Из ЭлементыСОсобымПорядком Цикл
		ОбластьСсылка = КлючИЗначение.Ключ;
		ПорядокПлан = КлючИЗначение.Значение;
		ПорядокФакт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбластьСсылка, "Порядок");
		Если ПорядокФакт = ПорядокПлан Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ОбластьОбъект = ОбластьСсылка.ПолучитьОбъект();
			ОбластьОбъект.Порядок = ПорядокПлан;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбластьОбъект);
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при обновлении предопределенной области замещения ""%1"": %2'"),
				ОбластьОбъект.ИмяПредопределенного,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				"ОбластиЗамещения",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ОбластиЗамещения,,
				ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

