#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ответственных лиц по заданной организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации -
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Поля:
//	* Период - Дата -
//	* Организация - СправочникСсылка.Организации -
//	* ОтветственноеЛицо - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций -
//	* Сотрудник - СправочникСсылка.Сотрудники -
Функция ТаблицаПоОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Период,
		|	Т.Организация,
		|	Т.ОтветственноеЛицо,
		|	Т.Сотрудник
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК Т
		|ГДЕ
		|	Т.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ОтветственноеЛицо
		|АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Организация", Организация);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли