Функция ЕстьОтметкаОПроверке(Документ, Роль) Экспорт
	ЗаписьОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьМенеджерЗаписи();
	ЗаписьОтметкиОПроверке.ВнутреннийДокумент = Документ;
	ЗаписьОтметкиОПроверке.РольИсполнителя = Роль;
	ЗаписьОтметкиОПроверке.Прочитать();
	
	Возврат ЗаписьОтметкиОПроверке.Выбран();
КонецФункции

Функция ПолучитьОтметкиОПроверке(Документ) Экспорт
	НаборОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьНаборЗаписей();
	НаборОтметкиОПроверке.Отбор.ВнутреннийДокумент.Установить(Документ);
	НаборОтметкиОПроверке.Прочитать();
	
	ОтметкиОПроверке = НаборОтметкиОПроверке.Выгрузить();
	Возврат ОтметкиОПроверке;
КонецФункции

Процедура ЗаписатьОтметкуОПроверке(ДанныеПроверки) Экспорт
	ЗаписьОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьОтметкиОПроверке,ДанныеПроверки);
	ЗаписьОтметкиОПроверке.Записать();
КонецПроцедуры
