//#Область ОбработчикиСобытий


//#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Функция НаименованиеЗадачиПоУмолчанию(Тип, ФункцияУчастника = Неопределено, Результат = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ФункцияУчастника) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезолюцию Тогда
			Возврат НСтр("ru = 'Обработать резолюцию'");
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.Рассматривающий Тогда
			Возврат НСтр("ru = 'Рассмотреть'");
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат Тогда
			Возврат НСтр("ru = 'Обработать резолюцию'");
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковПодписания.ОбрабатывающийРезультат Тогда
			Если Результат = Перечисления.РезультатыПодписания.НеПодписано Тогда
				Возврат НСтр("ru = 'Обработать замечания подписания'")
			Иначе
				Возврат НСтр("ru = 'Ознакомиться с результатом подписания'");
			КонецЕсли;
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковПодписания.ОбеспечивающийПодписание Тогда
			Возврат НСтр("ru = 'Обеспечить подписание'");
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковРегистрации.ОбрабатывающийРезультат Тогда
			Если Результат = Перечисления.РезультатыРегистрации.НеЗарегистрировано Тогда
				Возврат НСтр("ru = 'Обработать замечания регистрации'")
			Иначе
				Возврат НСтр("ru = 'Ознакомиться с регистрацией'");
			КонецЕсли;
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковСогласования.ОбрабатывающийРезультат Тогда
			Если Результат = Перечисления.РезультатыСогласования.НеСогласовано Тогда
				Возврат НСтр("ru = 'Обработать замечания согласования'")
			Иначе
				Возврат НСтр("ru = 'Ознакомиться с результатом согласования'");
			КонецЕсли;
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковСогласования.ОбеспечивающийСогласование Тогда
			Возврат НСтр("ru = 'Обеспечить согласование'");
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковУтверждения.ОбрабатывающийРезультат Тогда
			Если Результат = Перечисления.РезультатыУтверждения.НеУтверждено Тогда
				Возврат НСтр("ru = 'Обработать замечания утверждения'")
			Иначе
				Возврат НСтр("ru = 'Ознакомиться с результатом утверждения'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Тип = Перечисления.ТипыДействий.Исполнение Тогда
		Возврат НСтр("ru = 'Исполнить'");
	ИначеЕсли Тип = Перечисления.ТипыДействий.Ознакомление Тогда
		Возврат НСтр("ru = 'Ознакомиться'");
	ИначеЕсли Тип = Перечисления.ТипыДействий.Подписание Тогда
		Возврат НСтр("ru = 'Подписать'");
	ИначеЕсли Тип = Перечисления.ТипыДействий.Регистрация Тогда
		Возврат НСтр("ru = 'Зарегистрировать'");
	ИначеЕсли Тип = Перечисления.ТипыДействий.Согласование Тогда
		Возврат НСтр("ru = 'Согласовать'");
	ИначеЕсли Тип = Перечисления.ТипыДействий.Утверждение Тогда
		Возврат НСтр("ru = 'Утвердить'");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
