#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийСотрудник = Сотрудники.ОсновнойСотрудник();
	
	Если Запись.Установил = Неопределено Тогда 
		Запись.Установил = ТекущийСотрудник;
	КонецЕсли;	
	
	Если Не ПользователиСерверПовтИсп.ЭтоПолноправныйПользовательИБ() Тогда 
		Если ((ТипЗнч(Запись.Установил) <> Тип("СправочникСсылка.Пользователи")) И
			(ТипЗнч(Запись.Установил) <> Тип("СправочникСсылка.Сотрудники"))) Или
			(Запись.Установил <> ТекущийСотрудник) Тогда 
			
			ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Элементы.Установил.ТолькоПросмотр = Истина;
		Элементы.Мероприятие.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаИсторияСостояний", Запись.Мероприятие, ЭтотОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановилОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СотрудникиКлиент.СотрудникОбработкаВыбора(Запись, "Установил", ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти