////////////////////////////////////////////////////////////////////////////////
// Работа с рабочим столом (сервер, повторное использование).
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истину, если Алгоритм выполнен положительно. 
// 
// Параметры:
//  СсылкаНаАлгоритм - СправочникСсылка.АлгоритмыПроверки - ссылка на Алгоритм.
// 
// Возвращаемое значение:
//  Булево - Истина, если Алгоритм выполнен успешно
//
Функция АлгоритмПоПользователюВыполняется(СсылкаНаАлгоритм) Экспорт
	
	Возврат РаботаСАлгоритмамиПроверки.АлгоритмПоПредметуВыполняется(
		Пользователи.ТекущийПользователь(),
		СсылкаНаАлгоритм);
	
КонецФункции

// Формирует данные всех блоков навигации.
//  
// Параметры:
//  СУчетомНастроек - Булево.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные блоков навигации:
// 	 * Ключ - СправочникСсылка.БлокиНавигации.
// 	 * Значение -  Структура - Данные блока навигации. См. Справочники.БлокиНавигации.НовыйДанныеБлокаНавигации.
//
Функция ДанныеВсехБлоковНавигации(СУчетомНастроек) Экспорт
	
	ДанныеВсехБлоковНавигации = Справочники.БлокиНавигации.ДанныеВсехБлоковНавигации(СУчетомНастроек);
	
	Возврат ДанныеВсехБлоковНавигации;
	
КонецФункции

// Формирует данные всех виджетов.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные виджетов:
// 	 * Ключ - СправочникСсылка.Виджеты.
// 	 * Значение -  Структура - Данные виджета. См. Справочники.Виджеты.НовыйДанныеВиджета.
//
Функция ДанныеВсехВиджетов() Экспорт
	
	ДанныеВсехВиджетов = Справочники.Виджеты.ДанныеВсехВиджетов();
	
	Возврат ДанныеВсехВиджетов;
	
КонецФункции

// Формирует данные всех групповых показателей.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные групповых показателей:
// 	 * Ключ - СправочникСсылка.ГрупповыеПоказатели.
// 	 * Значение -  Структура - Данные показателя. См. Справочники.ГрупповыеПоказатели.ДанныеГрупповогоПоказателя.
//
Функция ДанныеВсехГрупповыхПоказателей() Экспорт
	
	ДанныеВсехГрупповыхПоказателей = Справочники.ГрупповыеПоказатели.ДанныеВсехГрупповыхПоказателей();
	
	Возврат ДанныеВсехГрупповыхПоказателей;
	
КонецФункции

// Формирует данные всех команд.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные команд:
// 	 * Ключ - СправочникСсылка.КомандыВиджетов.
// 	 * Значение -  Структура - Данные команды. См. Справочники.КомандыВиджетов.НовыйДанныеКоманды.
//
Функция ДанныеВсехКоманд() Экспорт
	
	ДанныеВсехКоманд = Справочники.КомандыВиджетов.ДанныеВсехКоманд();
	
	Возврат ДанныеВсехКоманд;
	
КонецФункции

// Формирует данные всех показателей.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные показателей:
// 	 * Ключ - СправочникСсылка.ПоказателиВиджетов.
// 	 * Значение -  Структура - Данные показателя. См. Справочники.ПоказателиВиджетов.СтруктураДанныеПоказателя.
//
Функция ДанныеВсехПоказателей() Экспорт
	
	ДанныеВсехПоказателей = Справочники.ПоказателиВиджетов.ДанныеВсехПоказателей();
	
	Возврат ДанныеВсехПоказателей;
	
КонецФункции

// Определяет команды доступных реестров.
// 
// Возвращаемое значение:
//  Массив из Структура - Данные команд реестров. См. Справочники.Реестры.КомандыРеестра.
//
Функция КомандыДоступныхРеестров() Экспорт
	
	ДоступныеРеестры = Справочники.Реестры.ДоступныеРеестры();
	КомандыДоступныхРеестров = Справочники.Реестры.КомандыРеестров(ДоступныеРеестры);
	
	Возврат КомандыДоступныхРеестров;
	
КонецФункции

// Получает цвет стиля по имени (кеширование для производительности).
//
// Параметры:
//  ИмяЦветаСтиля - Строка.
// 
// Возвращаемое значение:
//  Цвет - Цвет стиля.
//
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

// Получает шрифт стиля по имени (кеширование для производительности).
//
// Параметры:
//  ИмяШрифтаСтиля - Строка.
// 
// Возвращаемое значение:
//  Шрифт - Шрифт стиля.
//
Функция ШрифтСтиля(ИмяШрифтаСтиля) Экспорт
	
	Возврат ШрифтыСтиля[ИмяШрифтаСтиля];
	
КонецФункции

#КонецОбласти