#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧтоМеняем = Параметры.ЧтоМеняем;
	Замечание = Параметры.Замечание;
	Автор = Параметры.Автор;
	РеальныйАвтор = Параметры.РеальныйАвтор;
	Комментарий = Параметры.Комментарий;
	
	// Сохраним возможность увидеть прежние комментарии типа "Замена".
	НаЧтоМеняем = Параметры.НаЧтоМеняем;
	КлючСохраненияПоложенияОкна = ?(ЗначениеЗаполнено(Замечание), "НаЧтоМеняем", "Замечание");
	КлючНазначенияИспользования = ?(ЗначениеЗаполнено(Замечание), "НаЧтоМеняем", "Замечание");
	
	ЭтоМобильныйКлиент = ПараметрыСеанса.ЭтоМобильныйКлиент;
	Если ЭтоМобильныйКлиент Тогда
		МК_НастроитьЭлементыФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

&НаСервере
Процедура МК_НастроитьЭлементыФормы()
	
	Элементы.МК_НижнийБлок.Видимость = Истина;
	
	Элементы.Переместить(Элементы.ФормаОК, Элементы.МК_НижнийБлок);
	МК.ОформитьАкцентнуюКнопку(Элементы.ФормаОК);
	
	МК.ВыровнятьЭлементФормы(Элементы.Автор);
	МК.ВыровнятьЭлементФормы(Элементы.РеальныйАвтор);

КонецПроцедуры
	
#КонецОбласти

#КонецОбласти
