
&ИзменениеИКонтроль("ИзменитьСрокДействияДокумента")
Процедура ЦППК_ИзменитьСрокДействияДокумента(Объект, Параметры)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("ДатаНачалаДействия", Объект.ДатаНачалаДействия);
	ПараметрыФормы.Вставить("ДатаОкончанияДействия", Объект.ДатаОкончанияДействия);
	ПараметрыФормы.Вставить("Бессрочный", Объект.Бессрочный);            
#Вставка
	//Zayc +  23.05.2016 Добавление реквизитита ДоИсполненияОбязательств
	ПараметрыФормы.Вставить("ДоИсполненияОбязательств", Объект.ДоИсполненияОбязательств);
	//Zayc -  23.05.2016
#КонецВставки
	ПараметрыФормы.Вставить("ПорядокПродления", Объект.ПорядокПродления);
	ПараметрыФормы.Вставить("Пользователь", Параметры.ТекущийПользователь);
	ПараметрыФормы.Вставить("ДокументИсточникИзменения", Параметры.СрокДействияДокументИсточникИзменения);
	ПараметрыФормы.Вставить("Комментарий", Параметры.СрокДействияКомментарий);

	Если Параметры.Свойство("НеИзменятьСрокДействия") Тогда 
		ПараметрыФормы.Вставить("НеИзменятьСрокДействия", Параметры.НеИзменятьСрокДействия);
	КонецЕсли;

	ОткрытьФорму("Справочник.ДокументыПредприятия.Форма.ИзменениеСрокаДействия",
	ПараметрыФормы, 
	Параметры.ЭтаФорма,,,,
	Параметры.ОписаниеОповещения,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&ИзменениеИКонтроль("ПредупредитьПриРегистрации")
Процедура ЦППК_ПредупредитьПриРегистрации(ОписаниеОповещения, Отказ) Экспорт
	
#Удаление
	ПоказыватьПредупреждениеПриРегистрации = 
		ДелопроизводствоКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСДокументами().ПоказыватьПредупреждениеПриРегистрации;
		
	Если ПоказыватьПредупреждениеПриРегистрации = Истина Тогда  
			
		Отказ = Истина;                        	
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ОписаниеОтветаНаВопрос = Новый ОписаниеОповещения(
			"ПредупредитьПриРегистрацииПродолжение",
			ЭтотОбъект,
			ПараметрыОбработчика);
		
		ОткрытьФорму("ОбщаяФорма.ПредупреждениеПриРегистрации",,,,,, 
			ОписаниеОтветаНаВопрос, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	КонецЕсли;
#КонецУдаления
#Вставка
	Отказ = Истина;
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);
#КонецВставки
	
КонецПроцедуры	
