// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Все возможные состояния входящего документа.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния входящего документа
Функция СостоянияВходящегоДокумента() Экспорт
	
	Состояния = Новый СписокЗначений(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументПолучен);
	Состояния.Добавить(ВходящийДокументЗарегистрирован);
	Состояния.Добавить(ИсходящееУведомлениеЕщеНеОтправлено);
	Состояния.Добавить(ИсходящаяКвитанцияЕщеНеОтправлена);
	Состояния.Добавить(ОтправленаКвитанция);
	Состояния.Добавить(ОтправленаКвитанцияОбОшибке);
	Состояния.Добавить(ОтправленоУведомление);
	Состояния.Добавить(СозданаИсходящаяКвитанция);
	Состояния.Добавить(СозданоИсходящееУведомление);
	
	Возврат Состояния;
	
КонецФункции

// Все возможные состояния исходящего документа.
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния исходящего документа
Функция СостоянияИсходящегоДокумента() Экспорт
	
	Состояния = Новый СписокЗначений(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументЗарегистрированГотовКОтправке);
	Состояния.Добавить(ДокументОтправлен);
	Состояния.Добавить(ИсходящийДокументЕщеНеОтправлен);
	Состояния.Добавить(ОтправкаОтменена);
	Состояния.Добавить(ПолученаКвитанция);
	Состояния.Добавить(ПолученаКвитанцияОбОшибке);
	Состояния.Добавить(ПолученоУведомление);
	
	Возврат Состояния;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Массив-константа - состояния, являющиеся признаком к обработке входящих уведомлений.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния к отправке
Функция СостоянияВходящиеУведомленияКОбработке() Экспорт

	Состояния = Новый Массив(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументОтправлен); // но ожидается уведомление.
	Состояния.Добавить(ПолученаКвитанция);
	Состояния.Добавить(ПолученоУведомление);
	
	Возврат Состояния;

КонецФункции

// Массив-константа - состояния, являющиеся признаком к обработке полученных входящих документов.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояния к отправке
Функция СостоянияВходящиеДокументыКОбработке() Экспорт
	
	Состояния = Новый Массив(); // СписокЗначений из ПеречислениеСсылка.СостоянияДокументовМЭДО
	Состояния.Добавить(ДокументПолучен);
	Состояния.Добавить(ОтправленаКвитанция);
	Состояния.Добавить(СозданаИсходящаяКвитанция);
	
	Возврат Состояния;
	
КонецФункции

#КонецОбласти

#КонецЕсли