////////////////////////////////////////////////////////////////////////////////
// Работа со сканером (клиент, повторное использование)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вернет Истина, если доступна команда Сканировать - установлена компонента сканирования и есть хоть один сканер
Функция ДоступнаКомандаСканировать() Экспорт

	Возврат РаботаСоСканеромКлиент.ДоступнаКомандаСканировать();
	
КонецФункции // ДоступнаКомандаСканировать()


// Возвращает структуру параметров логирования сканера
// 
// Возвращаемое значение:
//  Структура - "ИспользоватьКаталогЖурналаСканирования, КаталогЖурналаСканирования"
Функция ПараметрыЛогированияСканера() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	Возврат РаботаСФайламиВызовСервера.ПараметрыЛогированияСканера(ИдентификаторКлиента);
	
КонецФункции

#КонецОбласти