&ИзменениеИКонтроль("ВставитьРегистрационныйШтамп")
Процедура ЦППК_ВставитьРегистрационныйШтамп(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;

	Если Элементы.Обзор.Видимость Тогда
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.ФайлыСоздание.ТекущиеДанные;
	КонецЕсли;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстНадписи = Новый Структура;

	Если Элементы.Организация.Видимость Тогда
		ТекстНадписи.Вставить("НазваниеОрганизации", Элементы.Организация.ТекстРедактирования);
	Иначе
		ТекстНадписи.Вставить("НазваниеОрганизации", Форма.НазваниеОрганизации);
	КонецЕсли;

	ТекстНадписи.Вставить("РегНомер", Объект.РегистрационныйНомер);
	ТекстНадписи.Вставить("РегДата", Формат(Объект.ДатаРегистрации,"ДФ=dd.MM.yyyy"));
	#Вставка
	//ВидДокумента = Объект.ВидДокумента;
	//ЭтоВходящийДокумент = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ВидДокумента,
	//			"ЯвляетсяВходящейКорреспонденцией");	
	ЭтоВходящийДокумент = ДелопроизводствоКлиентСервер.ЭтоВходящийДокумент(Объект.Ссылка);
    ТекстНадписи.Вставить("ЭтоВходящийДокумент", ЭтоВходящийДокумент);
	ФЛ = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Зарегистрировал, "Владелец");
	ТекстНадписи.Вставить("Зарегистрировал", ФЛ);
	#КонецВставки
	ТекущийФайл = ТекущиеДанные.Ссылка;
	ДанныеОШтрихкодеФайла = ШтрихкодированиеСервер.ПолучитьДанныеДляВставкиШтрихкодаВОбъект(ТекущийФайл,, Истина);

	Если ДанныеОШтрихкодеФайла <> Неопределено И ДанныеОШтрихкодеФайла.Свойство("СообщениеОбОшибке") Тогда
		ВызватьИсключение(ДанныеОШтрихкодеФайла.СообщениеОбОшибке);
	КонецЕсли;
	#Вставка
	Если ДанныеОШтрихкодеФайла = Неопределено Тогда
		ВызватьИсключение("В регистре сведений ""Штрихкоды"" нет записи по документу. Запись создаётся автоматически в момент создания документа.");
	КонецЕсли;
	#КонецВставки
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("НастройкиШтрихкода", ДанныеОШтрихкодеФайла.НастройкиШтрихкода);
	ПараметрыНастройки.Вставить("ЗаголовокФормы", НСтр("ru = 'Положение регистрационного штампа'"));
	ПараметрыНастройки.Вставить("РежимИспользованияНастроек", 0);
	ПараметрыНастройки.Вставить("ЗапросОриентацииСтраницы", Ложь);
	ПараметрыНастройки.Вставить("ДляВставки", Истина);
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ТекущиеДанные", ТекущиеДанные);
	ПараметрыОбработки.Вставить("ТекущийФайл", ТекущийФайл);
	ПараметрыОбработки.Вставить("ТекстНадписи", ТекстНадписи);
	ПараметрыОбработки.Вставить("ДанныеОШтрихкодеФайла", ДанныеОШтрихкодеФайла);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВставитьРегистрационныйШтампПродолжение", ЭтотОбъект, ПараметрыОбработки);
	ШтрихкодированиеКлиент.ПолучитьНастройкиШтрихкода(ПараметрыНастройки, ОписаниеОповещения);

КонецПроцедуры

&ИзменениеИКонтроль("ВставитьШтрихкодПродолжение")
Процедура ЦППК_ВставитьШтрихкодПродолжение(НастройкиПоложенияШК, Параметры)

	ТекущиеДанные = Параметры.ТекущиеДанные;
	ТекущийФайл = Параметры.ТекущийФайл;
	ДанныеОШтрихкодеФайла = Параметры.ДанныеОШтрихкодеФайла;

	Если НастройкиПоложенияШК = Неопределено Тогда	
		Возврат;
	КонецЕсли;
	
#Удаление
	Если ТекущиеДанные.Расширение = "doc" Тогда
#КонецУдаления
#Вставка
// Добавление ШК в колонтитул для docx через COM объект / 23.01.2024г. / Князев Д.С.
	Если ТекущиеДанные.Расширение = "doc" Или ТекущиеДанные.Расширение = "docx" Тогда
#КонецВставки

		#Если НЕ ВебКлиент Тогда
			Если ДанныеОШтрихкодеФайла <> Неопределено
				И ДанныеОШтрихкодеФайла.Свойство("ДвоичныеДанныеФайла")
				И (НастройкиПоложенияШК.ВысотаШК <> ДанныеОШтрихкодеФайла.НастройкиШтрихкода.ВысотаШК
				ИЛИ НастройкиПоложенияШК.ПоказыватьЦифры <> ДанныеОШтрихкодеФайла.НастройкиШтрихкода.ПоказыватьЦифры) Тогда
				ДанныеОШтрихкодеФайла.ДвоичныеДанныеИзображения = 
				ШтрихкодированиеСервер.ПолучитьКартинкуШтрихкода(ДанныеОШтрихкодеФайла.Штрихкод,, НастройкиПоложенияШК.ВысотаШК, НастройкиПоложенияШК.ПоказыватьЦифры).ПолучитьДвоичныеДанные(); 
			КонецЕсли;

			Состояние(НСтр("ru = 'Выполняется вставка штрихкода в файл.
			|Пожалуйста, подождите...'"));

			Если ДанныеОШтрихкодеФайла <> Неопределено И ДанныеОШтрихкодеФайла.Свойство("ДвоичныеДанныеФайла") Тогда
				Результат = ШтрихкодированиеКлиентСервер.ВставитьШтрихкодСИспользованиемНастроек(ТекущийФайл, 
				НастройкиПоложенияШК, 
				Истина, 
				ДанныеОШтрихкодеФайла.ДвоичныеДанныеИзображения, 
				ДанныеОШтрихкодеФайла.ДвоичныеДанныеФайла,
				ДанныеОШтрихкодеФайла.Расширение,
				ДанныеОШтрихкодеФайла.ФайлРедактируется, 
				ДанныеОШтрихкодеФайла.ИзменениеФайловMSWordТолькоНаСервере);
			Иначе
				Результат = Ложь;
			КонецЕсли;

			Если НЕ Результат Тогда
				Результат = ШтрихкодированиеСервер.ВставитьШтрихкод(ТекущийФайл, ДанныеОШтрихкодеФайла);
			КонецЕсли;
			Состояние();
		#Иначе
			Состояние(НСтр("ru = 'Выполняется вставка штрихкода в файл.
			|Пожалуйста, подождите...'"));
			Результат = ШтрихкодированиеСервер.ВставитьШтрихкод(ТекущийФайл, ДанныеОШтрихкодеФайла);
			Состояние();
		#КонецЕсли
	Иначе
		Результат = ШтрихкодированиеСервер.ВставитьШтрихкод(ТекущийФайл, ДанныеОШтрихкодеФайла);
	КонецЕсли;

	Если Результат Тогда
		Текст = НСтр("ru = 'Изображение штрихкода успешно вставлено в файл!'");

		ФайлСсылка = ТекущийФайл;
		Оповестить(
		"Запись_Файл", 
		Новый Структура("Событие, Файл, Владелец, ЕстьЗашифрованныеИлиЗанятыеФайлы, ИдентификаторРодительскойФормы", 
		"ДанныеФайлаИзменены", 
		ФайлСсылка, Неопределено, Неопределено,
		Неопределено),
		ФайлСсылка);

	Иначе
		Текст = НСтр("ru = 'Не удалось вставить изображение штрихкода в файл'");
	КонецЕсли;

	ПоказатьПредупреждение(, Текст);

КонецПроцедуры
