
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИдентификаторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Идентификатор = Строка(Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализировать(Команда)
	
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указанная строка не является идентификатором.'"));
		Возврат;
		
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Код, Идентификатор, Наименование", Код, Идентификатор, Наименование);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти