
&ИзменениеИКонтроль("ПолучитьСтруктуруВидаДокументовПредприятия")
Функция ЦППК_ПолучитьСтруктуруВидаДокументовПредприятия()

	Параметры = Новый Структура;
	Параметры.Вставить("Наименование");
	Параметры.Вставить("ВестиУчетПоКонтрагентам");
	Параметры.Вставить("ВестиУчетПоОрганизациям");
	Параметры.Вставить("ВестиУчетПоНоменклатуреДел");
	Параметры.Вставить("ИспользоватьСрокИсполнения");
	Параметры.Вставить("ОбязателенФайлОригинала");
	Параметры.Вставить("УчитыватьНедействующиеДокументы");
#Вставка
	Параметры.Вставить("ЦППК_УчитыватьВноситИзменения");
#КонецВставки
	Параметры.Вставить("УчитыватьСрокДействия");
	Параметры.Вставить("УчитыватьСуммуДокумента");
	Параметры.Вставить("ЯвляетсяДоговором");
	Параметры.Вставить("ЯвляетсяКомплектомДокументов");
	Параметры.Вставить("ВестиУчетПоАдресатам");
	Параметры.Вставить("Родитель");

	Возврат Параметры;

КонецФункции
