
&ИзменениеИКонтроль("ПриДобавленииОбработчиковОбновления")
Функция ЦППК_ПриДобавленииОбработчиковОбновления(Обработчики)

	// Обработчики, выполняемые при каждом обновлении ИБ
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДокументооборот.ЗаполнитьПраваПредопределенных";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДокументооборот.ОбновитьРежимыРаспознаванияФайлов";	
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "КОДСобытия.ПриОбновленииИнформационнойБазы";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбработкаЗапросовXDTO.ПриОбновленииИнформационнойБазы";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДокументооборот.СформироватьСообщениеОВерсииФорматаОбменаСАрхивом";

	// Обработчики, выполняемые при заполнении пустой ИБ
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Пользователи.СоздатьАдминистратора";

	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДокументооборот.ПервыйЗапуск";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Сотрудники.СоздатьСотрудникаДляАдминистратора";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ШаблоныБизнесПроцессов.ЗаполнитьШаблоныПоУмолчанию";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДокументооборот.ЗаполнитьНастройкиВариантовОтчетовДокументооборот";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "РаботаСФайламиВызовСервера.УстановитьСрокХраненияПротоколаРаботыССервисомРаспознаванияПоУмолчанию";
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ИнтеграцияShareДокументооборот.УстановитьНастройки";

	// Обработчики 3.0

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_1",
	"ПерейтиНаВерсию_3_0_5_1",
	"c12e9b9e-7eea-489d-b8e5-d3d88f2fbdf0",
	НСтр("ru = 'Заполняет Важность в Документах и Действиях стандартным значением.'"));	

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_3",
	"ПерейтиНаВерсию_3_0_5_3",
	"cfc7045f-b358-489d-b175-f81d5684b6d7",
	НСтр("ru = 'Заполняет добавленные реквизиты в РС Данные документов.'"));	

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_4");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_5");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_5",
	"Справочники.УдалитьСхемыКомплексныхПроцессов.ПеренестиНастройкиСхемНеактивныхКомплексныхПроцессовВНовуюСтруктуруДанных",
	"f2a80d37-168c-46a3-8aaa-42dd0c6d5cee",
	НСтр("ru = 'Переносит настройки схем неактивных комплексных процессов в новую структуру данных.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_5",
	"Справочники.УдалитьСхемыКомплексныхПроцессов.ЗаменитьТочкуМаршрутаВНеактивныхСлужебныхЗадачахКомплексныхПроцессов",
	"91225b3e-6c6a-4786-9b00-90d03b66c25b",
	НСтр("ru = 'Заполняет точку маршрута в неактивных служебных задачах комплексных процессов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_6",
	"ПерейтиНаВерсию_3_0_5_6",
	"6782c671-ebbb-49e3-a433-aa67dd6e927b",
	НСтр("ru = 'Корректирует код справочника Обработки объектов.'"));
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_7");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_9",
	"ПерейтиНаВерсию_3_0_5_9",
	"14663a48-198a-41d2-926a-a313e1e5e2bc",
	НСтр("ru = 'Заполняет связь настройки обработки с обработками объектов.'"));
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_10");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_23",
	"Сотрудники.ЗаменитьАвторовНаСотрудниковВИсторииСобытийЗадач",
	"68af959c-427d-4ceb-8553-e37179dcc5a7",
	НСтр("ru = 'Заменяет авторов в истории событий задач на сотрудников.'"));	

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_23",
	"Сотрудники.ЗаменитьУстановившихНаСотрудниковВИсторииСостоянийДокументов",
	"99046455-64b0-4ee7-9c5a-b437e7cc96a6",
	НСтр("ru = 'Заменяет установивших на сотрудников в истории состояний документов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьУстановившихНаСотрудниковВТекущихСостоянияхДокументов",
	"4cfaee3e-cb42-4236-81b1-b6e0f1fc3769",
	НСтр("ru = 'Заменяет установивших на сотрудников в текущих состояниях документов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьИзменившихНаСотрудниковВИсторииСроковДействийДокументов",
	"09b98a49-219a-4f3b-8c62-9cc77e612c4a",
	НСтр("ru = 'Заменяет изменивших на сотрудников в истории сроков действий документов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьАвторовНаСотрудниковВНастройкахПовторенияБизнесПроцессов",
	"31bb53bc-0f3c-4168-b0b4-f38f045de700",
	НСтр("ru = 'Заменяет авторов на сотрудников в настройках повторения процессов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьНаСотрудниковАвторовПереносовСроковВыполненияПроцессовИЗадач",
	"9d978981-7950-46e4-a8e2-61f80a706069",
	НСтр("ru = 'Заменяет на сотрудников авторов переносов сроков выполнения процессов и задач.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьНаСотрудниковАвторовСобытийВХодеОбработок",
	"48ffae7a-f069-4aed-9e88-3873db2a1dbe",
	НСтр("ru = 'Заменяет на сотрудников авторов в протоколе хода обработок.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьНаСотрудниковПолучившихОригиналВДанныхДокументов",
	"33115431-ed69-4f1e-b7c2-7e4f0c92ecf6",
	НСтр("ru = 'Заменяет на сотрудников пользователей получивших оригиналы документов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьНаСотрудниковАвторовКаналовОбсуждений",
	"0c9a4fe5-68c0-47e1-8d1f-1d6a2b9de234",
	НСтр("ru = 'Заменяет на сотрудников авторов каналов обсуждения.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьАвторовЗаписейВПротоколеДоставкеПочты",
	"50385036-0b29-4c83-bc6b-fb02306e3d76",
	НСтр("ru = 'Заменяет на сотрудников авторов записей протокола доставки почты.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_24",
	"Сотрудники.ЗаменитьУстановившихНаСотрудниковВЗаписяхСвязейОбъектов",
	"62f2c4a9-2c57-49e2-ba9e-9f839dd59bc3",
	НСтр("ru = 'Заменяет на сотрудников авторов связей между объектами.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_26",
	"Сотрудники.ЗаменитьОтветственныхЛицНаСотрудников",
	"2ab9de05-03be-4507-bcad-5293f19a243b",
	НСтр("ru = 'Заменяет на сотрудников ответственных лиц организаций.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_26",
	"Сотрудники.ЗаменитьНаСотрудниковПолучателейУведомленийОПроблемах",
	"0e6ea984-edd5-4907-be2e-b3ecf41541d7",
	НСтр("ru = 'Заменяет на сотрудников получателей уведомлений о проблемах.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_27");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_27",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВНастройкахДоступностиПоСостоянию",
	"87c24c3c-7c6f-4d2e-9b2b-198f0912cf8b",
	НСтр("ru = 'Заменяет пользователей на сотрудников в настройках доступности по состоянию.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_28",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВИндексахНумерации",
	"65672d39-afa9-4a61-b95d-6412bbd57daa",
	НСтр("ru = 'Заменяет пользователей на сотрудников в индексах нумерации.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьОтметившихИсполнениеВЗадачахНаСотрудников",
	"25e3e054-95a5-48b8-b2f4-0a405f75a3e8",
	НСтр("ru = 'Заменяет пользователей отметивших исполнение задач на сотрудников.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьСоздавшихЗадачиПользователейНаСотрудников",
	"5b311874-c0e4-4da4-b74f-3764d008b1fd",
	НСтр("ru = 'Заменяет пользователей создавших задачи на сотрудников.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьПодотчетныхЛицНаСотрудниковВДанныхДокументов",
	"6fc24792-d1fb-42ea-bff2-c2037cc25638",
	НСтр("ru = 'Заменяет подотчетных лиц на сотрудников в данных документах.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьАвторовНастроекОтложенногоСтартаНаСотрудников",
	"6c0f3ea1-80a6-4762-acb7-d25184a78758",
	НСтр("ru = 'Заменяет авторов настроек отложенного старта процессов на сотрудников.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВПравилахЭскалацииЗадач",
	"53fdbfad-3a08-461d-ae10-15bdde6ed9e4",
	НСтр("ru = 'Заменяет пользователей на сотрудников в правилах эскалации задач.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_29",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВИсторииЭскалацииЗадач",
	"ceeda2c6-7f72-4aca-a996-f733793e7280",
	НСтр("ru = 'Заменяет пользователей на сотрудников в истории эскалации задач.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_30",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВМоихДокументах",
	"6c7d6250-0dc9-4d14-a327-d580e5add40d",
	НСтр("ru = 'Заменяет пользователей на сотрудников в Моих документах.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_31");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_33",
	"ПерейтиНаВерсию_3_0_5_33",
	"397ca345-b8b7-62a6-8762-2cf98f44a957",
	НСтр("ru = 'Очищает УзелОбработки в РС ДанныеБизнесПроцессов.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_34");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_35");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_35",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВДокументахРегистрацииСамочувствий",
	"e3602688-2607-4f52-9798-2ef6d6a3385a",
	НСтр("ru = 'Заменяет пользователей на сотрудников в документах регистрации самочувствий.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_36");	

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_37",
	"Сотрудники.ЗаменитьОтветственныхПользователейНаСотрудниковВИнструкциях",
	"8867ca1c-3e48-45db-bc4d-b20631660a52",
	НСтр("ru = 'Заменяет ответственных пользователей на сотрудников в инструкциях.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_37",
	"Сотрудники.ЗаменитьОтветственныхПользователейНаСотрудниковВДокументахВыгрузкаВССТУ",
	"35940243-17f9-40d7-9233-b0a1991c0a8d",
	НСтр("ru = 'Заменяет ответственных пользователей на сотрудников в выгрузках в ССТУ.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_37",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВСредиОбъектовДляАвтоподбораАдресатов",
	"3ffbe576-29f6-49c3-bf32-bb0f35be3d3f",
	НСтр("ru = 'Заменяет пользователей на сотрудников в списках автоподбора адресатов для почтовых писем.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_38",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВАдреснойКниге",
	"2e0867a6-839d-4d80-83ec-5e5be4ea953e",
	НСтр("ru = 'Заменяет пользователей на сотрудников в данных доступа к записям адресной книги.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_38",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВДанныхПоискаПоАдреснойКниге",
	"8bcc8219-fa34-4d57-8207-92146b6b6b9d",
	НСтр("ru = 'Заменяет пользователей на сотрудников в данных поиска по адресной книги.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_39",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВПротоколеРаботы",
	"7ba4192c-da93-4401-b019-d462d628a64b",
	НСтр("ru = 'Заменяет пользователей на сотрудников в протоколе работы.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_41");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_43");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_46");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_47");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_48");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_49");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_50");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_53",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВЗаписяхХронометража",
	"317ca816-b8b6-42a6-9492-2cf98f41a957",
	НСтр("ru = 'Заменяет пользователей на сотрудников в записях флагов объектов.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_54");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_55");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_56");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_57");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_58");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_59");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_60");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_61");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_62");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_63",
	"ПерейтиНаВерсию_3_0_5_63",
	"397ca886-b8b7-62a6-9492-2cf98f44a957",
	НСтр("ru = 'Заполняет данные о фактических исполнителях виз согласования.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_64");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_66");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_67");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_68");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(
	Обработчики,
	"3_0_5_69",
	"ПерейтиНаВерсию_3_0_5_69",
	"f61a703f-ea88-4f4a-8c5d-ddb688aec967",
	НСтр("ru = 'Обновляет записи РС Способы уведомления пользователей.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_70");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_71");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_5_73",
	"Сотрудники.ЗаменитьОтветственныхЗаРабочиеГруппыНаСотрудников",
	"02be2d09-5249-4138-b549-dd5d19e05c3f",
	НСтр("ru = 'Выполняет замену ответственных пользователей на сотрудников, в рабочих группах.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_75");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_78");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_79");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_80");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_81");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_5_82");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_6_2");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_6_3");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_6_4");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(
	Обработчики,
	"3_0_7_2",
	"ПерейтиНаВерсию_3_0_7_2",
	"c417fc7b-cbf1-4405-aaaa-23c67c7a20d4",
	НСтр("ru = 'Обновляет настройки видимости действий.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_4");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_5");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_7");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_8");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_9");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_10");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_11");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_12");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_13");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_14");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_15");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_16",
	"РегистрыСведений.ДоступноеВремяСотрудников.ПеренестиЗаписиВДоступноеВремяФизическихЛиц",
	"03fbd423-4923-4cef-ac0b-5058dd2e8911",
	НСтр("ru = 'Перенос записей доступного времени сотрудников в новый регистр сведений.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_16",
	"РегистрыСведений.ЗанятостьСотрудников.ПеренестиЗаписиВЗанятостьФизическихЛиц",
	"92618ee9-e2cb-4054-a210-0e904dd7bc9d",
	НСтр("ru = 'Перенос записей занятости сотрудников в новый регистр сведений.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_16",
	"РегистрыСведений.НастройкиОтображенияЗаписейРабочегоКалендаряПользователя.ПеренестиЗаписиВНастройкиОтображенияЗаписейРабочегоКалендаря",
	"5144ddcf-7a05-4048-a2b8-96ded4e49b37",
	НСтр("ru = 'Перенос настроек отображения записей рабочего календаря в новый регистр сведений.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_16",
	"РегистрыСведений.НастройкиРабочегоКалендаряСотрудника.ПеренестиЗаписиВНастройкиРабочегоКалендаря",
	"6f69e3ab-e481-4098-a0ea-4cba034502f3",
	НСтр("ru = 'Перенос настроек рабочего календаря в новый регистр сведений.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_16",
	"ПланыОбмена.СинхронизацияКалендарей.ЗаполнитьРеквизитФизическоеЛицоВНастройкахСинхронизацииКалендарей",
	"d7d446cc-2e52-4ae4-b96a-4a18f5178bc7",
	НСтр("ru = 'Привязка настроек синхронизации календарей к физическим лицам.'"));

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.7.16";
	Обработчик.Процедура = "РаботаСРабочимКалендаремСервер.ОбновитьПользовательскиеНастройкиРабочегоКалендаря_3_0_7_16";

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_24",
	"ПерейтиНаВерсию_3_0_7_24",
	"477e105f-032b-4786-af5e-92b49fae198c",
	НСтр("ru = 'Обновляет реквизиты процессов, загруженных из 1С:Документооборот 2.1.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_26");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_7_27");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_28",
	"ПерейтиНаВерсию_3_0_7_28",
	"477e105f-032b-4786-af5e-92b49fae199c",
	НСтр("ru = 'Исправляет значение реквизита ""Подписан/утвержден"" в документах.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_7_31",
	"ПерейтиНаВерсию_3_0_7_31",
	"8934d90a-453f-40fe-b865-fbda3192251d",
	НСтр("ru = 'Обновляет дескрипторы доступа задач по процессам с проектом.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_2");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_4");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_5");
	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_8_6",
	"ПерейтиНаВерсию_3_0_8_6",
	"98dd8edd-0e2f-4908-ab35-069007cb2031",
	НСтр("ru = 'Обновляет Порядок выполнения участниками действий.'"));

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.8.7";
	Обработчик.Процедура = "Справочники.Сотрудники.ЗаполнитьНаименованиеУСотрудников_3_0_8_7";

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_8");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_9");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_11");
	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_8_12",
	"ПерейтиНаВерсию_3_0_8_12",
	"15c71233-2760-4b99-a3e1-f4e519908c0f",
	НСтр("ru = 'Заполняет ИД пункта в состояниях и в результатах действий.'"));	

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_8_14",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВКатегорияхОбъектов",
	"96b50fa4-cb91-4795-b0a1-9763b9d25d64",
	НСтр("ru = 'Выполняет замену пользователей на сотрудников, в категориях объектов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_8_14",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВПравилахКатегоризации",
	"d6a68a6d-5054-43b6-8ba0-f46ec1ab596d",
	НСтр("ru = 'Выполняет замену пользователей на сотрудников, в правилах категоризации объектов.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_8_14",
	"Сотрудники.ЗаменитьПользователейНаСотрудниковВКатегорияхДанных",
	"de417257-f371-4fa0-9cf8-e2237c7bdb04",
	НСтр("ru = 'Выполняет замену пользователей на сотрудников, в категориях данных.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_15");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_16");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_17");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_19");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_8_20");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_2");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_3");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_4");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_6");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_9_9",
	"ПерейтиНаВерсию_3_0_9_9",
	"d1e75bde-f099-4323-8753-093bb28ad4e5",
	НСтр("ru = 'Заполняет данные о состоянии документов, в уничтоженных и переданных в архив делах.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_10");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_11");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_12");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_13");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_9_14",
	"РаботаСПроцессамиПоДействиям.ИсправитьЗаполнениеАвтораВПроцессахПоПодчиненнымИсполнениям",
	"cb78a75f-1ae4-4161-bbe0-f7b6720e760b",
	НСтр("ru = 'Выполняет замену авторов в процессах подчиненных исполнений обработок документов'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_15");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_16");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_17");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_9_18");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_1");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_2");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_4");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_5");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_10_6",
	"ПерейтиНаВерсию_3_0_10_6",
	"69ae6e7e-4973-4dc4-83b8-16158f603d1f",
	НСтр("ru = 'Заполнение реквизита ""Состояние брони"" в бронях.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_7");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_8");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_9");

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_10_10",
	"ПерейтиНаВерсию_3_0_10_10",
	"69ae6e7e-4973-8dc4-71b8-16158f603d1f",
	НСтр("ru = 'Перенос данных ТекстХранилище из справочника Файлы в регистр.'"));

	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_10_11",
	"ПерейтиНаВерсию_3_0_10_11",
	"69ae6e7e-4973-8dc4-71b8-16158f604d1f",
	НСтр("ru = 'Перенос данных ТекстХранилище из справочника ВерсииФайлов в регистр.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_12");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_15");
	ДобавитьСтандартныйОтложенныйОбработчикАрхив(Обработчики,
	"3_0_10_16",
	"ПерейтиНаВерсию_3_0_10_16",
	"16c7e101-a8dd-4515-aa92-2f3cc6aaa678",
	НСтр("ru = 'Обновляет ошибочный Порядок выполнения участникам действий и настроек действий Подписания.'"));

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_17");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_18");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_19");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_20");

	// Обработчики Холдинг
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_21");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_22");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_23");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_24");
	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_27");

	ДобавитьСтандартныйОбработчикАрхив(Обработчики, "3_0_10_28");    






	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_1");
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_2",
	"ПерейтиНаВерсию_3_0_11_2",
	"9999e101-a8dd-4515-aa92-2f3cc6aa9999",
	НСтр("ru = 'Обновляет состояние МЭДО в регистре ДанныеДокументовПредприятия для быстрого показа в списке'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_3",
	"ПерейтиНаВерсию_3_0_11_3",
	"aaaae101-a8dd-4515-aa92-2f3cc6aaaaaa",
	НСтр("ru = 'Создает табличную часть Пакеты в документах ДанныеДокументаМЭДО'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_4");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_7",
	"ПерейтиНаВерсию_3_0_11_7",
	"9999e101-a8dd-4515-aa92-2f3cc6aa5439",
	НСтр("ru = 'Обновляет ВидКорреспонденции ЯвляетсяКомплектомДокументов Контрагент  в регистре ДанныеДокументовПредприятия для быстрого показа в списке'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_8",
	"ЗаменитьСотрудниковНаФизлицВоФлагахОбъектов",
	"8381d981-bb2a-4d29-b3dd-e90f735fe4c9",
	НСтр("ru = 'Заменяет сотрудников на физлиц в записях флагов объектов.'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_9",
	"ЗаполнитьКомментарийВРезультатыДействий",
	"8381d981-bb2a-4d13-b3dd-e90f735fe4c9",
	НСтр("ru = 'Заполняет комментарий в РС РезультатыДействий.'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_10");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_11");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_12",
	"ПерейтиНаВерсию_3_0_11_12",
	"8381d981-bb2a-4d56-b3dd-e90f735fe4c9",
	НСтр("ru = 'Обновляет Сторона1 Сторона2 в регистре ДанныеДокументовПредприятия для коректного отображения заявок на оплату.'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_13",
	"ПерейтиНаВерсию_3_0_11_13",
	"8381d981-bb2a-4d56-b3dd-e823735fe4c9",
	НСтр("ru = 'Обновляет ИсходящийНомерИДата в регистре ДанныеДокументовПредприятия для исходящих документов.'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_15");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_11_16",
	"ПерейтиНаВерсию_3_0_11_16",
	"8381d981-bb2a-4d53-b3dd-e823735fe4c1",
	НСтр("ru = 'Обновляет права на действия задач с приложениями, если на них нет прав у соисполнителей.'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_11_23");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_3");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_4");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_5");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_12_6",
	"ПерейтиНаВерсию_3_0_12_6",
	"e0cd6006-0ec2-4a60-a893-54108e16188b",
	НСтр("ru = 'Заполняет РС ТекстыПисем.'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_8");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_9");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_12_10",
	"ПерейтиНаВерсию_3_0_12_10",
	"e0cd6006-0ec2-4a60-a893-57654e16188b",
	НСтр("ru = 'Заполняет ОжидатьЗавершения в Истина в спр ДействияОзнакомления.'"));
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_12_11",
	"ПерейтиНаВерсию_3_0_12_11",
	"317cbbd6-0b9d-4f9d-bba6-ce42ea5ec6d6",
	НСтр("ru = 'Проставляет АктуализироватьВерсию = Истина в РС НастройкиКонтрагентовМЭДО'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_12");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_13");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_12_15",
	"ПерейтиНаВерсию_3_0_12_15",
	"68B5BAAC-CFAB-43db-A49A-AF25A95BFE63",
	НСтр("ru = 'Удаляет состояния ЭДО бумажных документов, которые еще не были сформированы'"));   

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_16");	

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_17");	

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_18");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_19");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_20");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_12_21");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_12_22",
	"ПерейтиНаВерсию_3_0_12_22",
	"9d99316e-7072-422a-901f-b9ec2dd9333a",
	НСтр("ru = 'Заполнит РС УчастникиОзнакомлений, по старым действиям ознаколмения'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_3");

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_4", "ПерейтиНаВерсию_3_0_13_4",
	"9d99316e-7072-422a-901f-b9ec2dd9333b",
	СтрШаблон(
	НСтр("ru = 'Заполняет новое поле ""%1"" в регистре сведений ""%2"" по документу ""%3""'"),
	"АдресатыДляСписков", "ДанныеДокументовПредприятия", "Корреспонденция"));
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_5");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_6");

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_7", "ПерейтиНаВерсию_3_0_13_7",
	"7672F6D1-8E09-4d77-9C48-5219C6646040",
	НСтр("ru = 'Заполняет РС ПерсональныеНастройкиПользователя'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_8");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_9");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_10");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_13");

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_14", "ПерейтиНаВерсию_3_0_13_14",
	"A1751DD3-5565-40FD-B58E-654D53B15748",
	НСтр("ru = 'Сбрасывает признак защищенности участников исполнения по пунктам'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_15");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_16");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_13_17");

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_18", "ПерейтиНаВерсию_3_0_13_18",
	"369BA1F6-A1FB-4964-AC94-31EBC243A028",
	НСтр("ru = 'Выполняет преобразование и перенос данных отметок времени'"));

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_19", "ПерейтиНаВерсию_3_0_13_19",
	"78C14620-057D-4BFC-AF62-E84F32EB4F34",
	НСтр("ru = 'Выполняет преобразование и перенос данных служебных объектов КОД'"));

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_13_20", "ПерейтиНаВерсию_3_0_13_20",
	"33FCBFD9-054E-4335-95F9-02A8278830BF",
	НСтр("ru = 'Удаляет устаревшие данные подсистемы отметок времени'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_1");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_2");

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_14_3", "ПерейтиНаВерсию_3_0_14_3",
	"33FCBFD9-054E-4335-95F9-1919178830BF",
	НСтр("ru = 'Заполняет поле ЕстьДокументы в РС КешИнформацииОбОбъектах'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_4");	

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_14_4", "ПерейтиНаВерсию_3_0_14_4_ОшибкиМиграции",
	"33FCBFD9-054E-4335-95F9-2323238830BF",
	НСтр("ru = 'Переносит ошибки миграции с 2.1'"));

	ДобавитьСтандартныйОтложенныйОбработчик(
	Обработчики, "3_0_14_4", "ПерейтиНаВерсию_3_0_14_4_УдалитьДескрипторы",
	"33FCBFD9-054E-4335-95F9-4545458830BF",
	НСтр("ru = 'РС ОтметкиВремениРегистровКонстант: удалим записи для ДескрипторыДляОбъектов'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_5");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_6");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_7");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_8");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_11");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_14_12",
	"ПерейтиНаВерсию_3_0_14_12",
	"bd87d3ba-85b0-4369-a76c-97a0df325788",
	НСтр("ru = 'Заполняет реквизит НомерПунктаПротокола в справочнике ПротоколыМероприятий'"));
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_14");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_15");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_16");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_17");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_21");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_24");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_26");
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_14_28",
	"ПерейтиНаВерсию_3_0_14_28",
	"bd87d3ba-85b0-4369-a76c-97a0df325781",
	НСтр("ru = 'Исправляет отсутствие прав на перенаправленные задачи ознакомления'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_14_29",
	"ПерейтиНаВерсию_3_0_14_29",
	"bd87d3ba-85b0-5423-a76c-97a0df325781",
	НСтр("ru = 'Удаляет фиктивные задачи ознакомления в Задачи от меня'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_14_30");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_14_31",
	"ПерейтиНаВерсию_3_0_14_31",
	"bd87d3ba-85b0-5423-a76c-97a146325781",
	НСтр("ru = 'Отмечает выполнение старых задач ознакомления'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_1");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_2");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_3",
	"ПерейтиНаВерсию_3_0_15_3",
	"647b6df4-dcb8-402e-9f67-afc8a832d555",
	НСтр("ru = 'Заполняет пометку удаления у сотрудников и субъектов в РС ""Состав субъектов прав доступа"".'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_4",
	"ПерейтиНаВерсию_3_0_15_4",
	"bd87d3ba-85b0-5423-a76c-998766325781",
	НСтр("ru = 'Заполняет ИдентификаторПункта в РС СостоянияДействий'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_5",
	"ПерейтиНаВерсию_3_0_15_5",
	"bd1234ba-85b0-5423-a76c-998766325781",
	НСтр("ru = 'Заполняет ИдентификаторПункта в РС РезультатыДействий'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_8",
	"ПерейтиНаВерсию_3_0_15_8",
	"63dad3d4-b309-4a57-ac21-7cfce81690ad",
	НСтр("ru = 'Заполняет регистр сведений РеестрЗадачПоИсполнителям и регистр накопления КоличествоЗадачПоИсполнителям.'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_9",
	"ПерейтиНаВерсию_3_0_15_9_РеестрЗадачПоАвторам",
	"afd23e77-40d0-46cf-96f9-ce47bca1e984",
	НСтр("ru = 'Заполняет регистр сведений РеестрЗадачПоАвторам и регистр накопления КоличествоЗадачПоАвторам.'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_9");	

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_11");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_14");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_15");

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_16");
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_17",
	"ПерейтиНаВерсию_3_0_15_17",
	"89c6f654-0d45-4059-ac48-1cb14f00b2a2",
	НСтр("ru = 'Перенос данных поиска адресной книги в новый РС'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_20");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_21",
	"ПерейтиНаВерсию_3_0_15_21",
	"78f2e571-84cb-45e0-b58a-3138eca82b68",
	НСтр("ru = 'Обновление состояний ЭДО в данных документов ДО'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_22");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_23");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_24");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_25");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_30",
	"ПерейтиНаВерсию_3_0_15_30",
	"6a7a386a-1702-4f1a-98cc-fec8ba46211c",
	НСтр("ru = 'Обновление АК: установление РодительОбъекта для групп контактов пользователей'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_31");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_32");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_33",
	"ПерейтиНаВерсию_3_0_15_33",
	"3ce0fef7-e758-4779-b39d-139c57d682e1",
	НСтр("ru = 'Корректировка дублей пунктов протоколов'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_35");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_36");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_37");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_38",
	"ПерейтиНаВерсию_3_0_15_38",
	"a6f19fb6-5dd8-4a39-bee0-ae7f85310d44",
	НСтр("ru = 'Устанавливает реквизит НеПредлагатьСохранятьНастройки РС НастройкиПолученияЭлектронныхДокументов'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_15_39");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_40",
	"ПерейтиНаВерсию_3_0_15_40",
	"def2a889-9b39-40ad-a157-cb33ee3c1ae9",
	НСтр("ru = 'Корректировка задач обработки результатов'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_15_41",
	"ПерейтиНаВерсию_3_0_15_41",
	"b2f37789-2bf9-437d-90bf-cb0197eefcef",
	НСтр("ru = 'Корректировка задач ознакомления с результатом'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_2");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_3");

#Удаление
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_4",
	"ПерейтиНаВерсию_3_0_16_4",
	"66341ebd-4f1a-4248-b315-d3204f38e2c2",
	НСтр("ru = 'Корректировка задач замещающих и помощников'"));
#КонецУдаления

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_5");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_6");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_7",
	"ПерейтиНаВерсию_3_0_16_7",
	"4bfa8daa-6a1d-40dc-9403-56a42db997f1",
	НСтр("ru = 'Заполнение регистра сведений ""Уведомления окном""'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_8");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_9");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_10");    

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_11");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_12");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_13",
	"ПерейтиНаВерсию_3_0_16_13",
	"0ed83f3c-be59-4043-98c9-e0b1b62eeebb",
	НСтр("ru = 'Заполнение представление в регистре сведений ""Объекты поиска в адресной книге""'")); 

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_15",
	"ПерейтиНаВерсию_3_0_16_15",
	"65a07905-6068-417d-a340-580d10e9e1b3",
	НСтр("ru = 'Заполнение представления должности и подразделения сотрудника'"));
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_16");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_17");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_18",
	"ПерейтиНаВерсию_3_0_16_18",
	"09805fae-1371-4a50-9271-31ef2dccd5c0",
	НСтр("ru = 'Заполнение данных контроля для виджетов'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_19");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_21",
	"ПерейтиНаВерсию_3_0_16_21",
	"65a12395-6068-417d-a340-580d10e9e1b3",
	НСтр("ru = 'Заполнение регистра сведений ЗанятыеФайлы'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_23",
	"ПерейтиНаВерсию_3_0_16_23",
	"c40f8b56-deb0-421c-87e2-32d564aa7e88",
	НСтр("ru = 'Заполнение регистра сведений ФИОФизическихЛиц'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_24",
	"ПерейтиНаВерсию_3_0_16_24_НетЗаписиТекстыВерсийФайлов",
	"c40f8b56-deb0-421c-87e2-11d564aa7e88",
	НСтр("ru = 'Заполнение регистра сведений ТекстыВерсийФайлов, где нет записи'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_24",
	"ПерейтиНаВерсию_3_0_16_24_Зашифрован",
	"c40f8b56-deb0-421c-87e2-122564aa7e88",
	НСтр("ru = 'Заполнение регистра сведений ТекстыВерсийФайлов, для версий файлов с Зашифрован'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_24",
	"ПерейтиНаВерсию_3_0_16_24_Расширение",
	"c40f8b56-deb0-421c-87e2-133564aa7e88",
	НСтр("ru = 'Заполнение регистра сведений ТекстыВерсийФайлов, поле Расширение'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_24",
	"ПерейтиНаВерсию_3_0_16_24_ИсточникДанных",
	"c40f8b56-deb0-421c-87e2-144564aa7e88",
	НСтр("ru = 'Заполнение регистра сведений ТекстыВерсийФайлов, для версий файлов с ИсточникДанных'"));                 

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_25",
	"ПерейтиНаВерсию_3_0_16_25_УчастникиОзнакомлений",
	"14069b34-8e27-4c93-aeb7-c021eafd7b67",
	НСтр("ru = 'Заполненяет представления фактического исполнителя и ПЭП РС УчастникиОзнакомлений'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_25",
	"ПерейтиНаВерсию_3_0_16_25_СведенияОбУчастникахДействий",
	"8319f1a0-3190-490b-830f-c35cf800e5fb",
	НСтр("ru = 'Заполненяет представления фактического исполнителя и ПЭП РС ПерейтиНаВерсию_3_0_16_25_СведенияОбУчастникахДействий'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_26",
	"ПерейтиНаВерсию_3_0_16_26_ЗаполнитьДатуСозданияСдаточныхОписей",
	"c47f9b56-deb0-421c-87e2-32d564aa7e88",
	НСтр("ru = 'Заполнение даты создания Передачи дел в архив'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_27");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_28",
	"ПерейтиНаВерсию_3_0_16_28",
	"b84a40b9-84e0-439d-88db-3e6486a9701b",
	НСтр("ru = 'Обновление состояний исполнения пунктов протоколов'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_29",
	"ПерейтиНаВерсию_3_0_16_29",
	"b5d84cc2-6267-45a2-9670-76779035980a",
	НСтр("ru = 'Обновление зависших действий подписания с обеспечивающими подписание, заданными в виде автоподстановок'"));

	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_30");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_31");
	ДобавитьСтандартныйОбработчик(Обработчики, "3_0_16_32");

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_33",
	"ПерейтиНаВерсию_3_0_16_33_Документы",
	"3924c478-beca-4fbf-a252-b3ddb3f5fa60",
	НСтр("ru = 'Перенос данных из перечисления в справочник для колонки СтавкаНДС в таблице Товары и услуги'"));

	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_33",
	"ПерейтиНаВерсию_3_0_16_33_Номенклатура",
	"a0cfc313-8653-4751-a435-d6a9d653a7ac",
	НСтр("ru = 'Перенос данных из перечисления в справочник для реквизита СтавкаНДС в справочнике Номенклатура'"));

#Вставка
	ДобавитьСтандартныйОтложенныйОбработчик(Обработчики,
	"3_0_16_4",
	"ПерейтиНаВерсию_3_0_16_4",
	"66341ebd-4f1a-4248-b315-d3204f38e2c2",
	НСтр("ru = 'Корректировка задач замещающих и помощников'"));
#КонецВставки

	Возврат Обработчики;

КонецФункции
