///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при определении списка обязательных для заполнения реквизитов объекта ДО.
//
// Параметры:
//   ОбязательныеРеквизиты - см. Справочники.ПравилаЗагрузкиДанныхВДО.КоллекцияРеквизитовОбъектаДО
//   ТипОбъектаДО - Строка - имя типа объекта Документооборота.
//   ВидДокументаОбъект - СправочникОбъект.ВидыДокументов - вид документа.
//
Процедура ПриОпределенииОбязательныхРеквизитовОбъектаДО(ОбязательныеРеквизиты, ТипОбъектаДО, ВидДокументаОбъект) Экспорт
	
	Если ТипОбъектаДО = "Справочник.ДокументыПредприятия" Тогда
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Получатель";
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Организация";
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "ФормаДокумента";
		
		Если ВидДокументаОбъект <> Неопределено Тогда
			Если ВидДокументаОбъект.ВестиУчетПоАдресатам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Адресат";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ЯвляетсяОбращениемОтГраждан Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ВидОбращения";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетПоСтатьямДДС Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "СтатьиДДС";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "СтатьяДвиженияДенежныхСредств";
				НоваяСтрока.Таблица = "СтатьиДДС";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ОбязательноеУказаниеОтветственного Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Ответственный";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ОбязательноУказаниеПроекта Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Проект";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетПоТематикам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Тематика";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ЯвляетсяВходящейКорреспонденцией
					Или ВидДокументаОбъект.ЯвляетсяИсходящейКорреспонденцией Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагент";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетПоКонтрагентам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагенты";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагент";
				НоваяСтрока.Таблица = "Контрагенты";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетСторон И Не ВидДокументаОбъект.ЯвляетсяЗаявкойНаОплату Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Стороны";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ЯвляетсяЗаявкойНаОплату Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Сумма";
			КонецЕсли;
			
			Если ВидДокументаОбъект.УчитыватьСрокДействия Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ДатаНачалаДействия";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ДатаОкончанияДействия";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ПорядокПродления";
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСуммуВоВнутренних",
					Новый Структура("ВидДокумента", ВидДокументаОбъект.Ссылка)) Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Валюта";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектаДО = "Справочник.Мероприятия" Тогда
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Организатор";
		
		НайденныеСтроки = ОбязательныеРеквизиты.НайтиСтроки(
			Новый Структура("Таблица", "Программа"));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ОбязательныеРеквизиты.Удалить(Строка);
		КонецЦикла;
		
		НайденныеСтроки = ОбязательныеРеквизиты.НайтиСтроки(
			Новый Структура("Таблица", "Протокол"));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ОбязательныеРеквизиты.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Позволяет переопределить предельное количество объектов, которые будут выгружены в сообщение
// обмена с интегрированной системой.
//
// Параметры:
//   ПредельноеКоличествоОбъектовВСообщении - Число - предельное количество объектов.
//
// Пример:
//	ПредельноеКоличествоОбъектовВСообщении = 100;
//
Процедура ПриОпределенииПредельногоКоличестваОбъектовВСообщенииОбмена(ПредельноеКоличествоОбъектовВСообщении) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при определении таймаута веб-сервиса. При необходимости таймаут может быть вынесен в
// настройки администратора интеграции и переопределен в этой процедуре.
//
// Параметры:
//   Таймаут - Число - неявно возвращаемое значение, время в секундах, по истечении которого вызов
//     веб-сервиса Документооборота считается неудачным.
//
Процедура ПриОпределенииТаймаутаСервиса(Таймаут) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при получении WSПрокси. Переопределяется, если в конфигурации есть возможность настройки интернет-прокси.
//
// Параметры:
//   ИнтернетПрокси - Неопределено - неявно возвращаемое значение, может быть инициализировано значением
//     типа ИнтернетПрокси.
//
Процедура ПриПолученииWSПрокси(ИнтернетПрокси) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при создании защищенного соединения для подключения к веб-сервису БИД. Переопределяется, если
// веб-сервис БИД использует защищенное https соединение, и для подключения к нему требуется использовать сертификаты.
//
// Параметры:
//   ЗащищенноеСоединение - Неопределено - неявно возвращаемое значение, может быть инициализировано значением
//     типа ЗащищенноеСоединениеOpenSSL.
//   МестоположениеWSDL - Строка - адрес веб-сервиса БИД.
//
Процедура ПриСозданииЗащищенногоСоединения(ЗащищенноеСоединение, МестоположениеWSDL) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти