
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает закешированные сведения о PDF документе (по умолчанию)
// Возвращаемое значение:
//  Структура - Структура с ключами:
//   * ИмяРеквизита - Строка - Имя реквизита pdf
//   * ИмяЭлемента - Строка - Имя элемента
//   * ИмяРодителяЭлемента - Строка - Имя родителя элемента
//   * ИмяРодителяКоманды- Строка - Имя родителя команд
//
Функция НовыеСведенияОPDFДокументеНаФорме() Экспорт
	
	СведенияОPDFДокументе = Новый Структура;
	СведенияОPDFДокументе.Вставить("ИмяРеквизита", "ДокументPdfРеквизит");
	СведенияОPDFДокументе.Вставить("ИмяЭлемента", "ДокументPdfПоле");
	СведенияОPDFДокументе.Вставить("ИмяРодителяЭлемента", "ГруппаPdf");
	СведенияОPDFДокументе.Вставить("ИмяРодителяКоманды", "");
	
	Возврат СведенияОPDFДокументе;
	
КонецФункции

// Возвращает работает ли PDF документ в веб клиенте

// Возвращаемое значение:
//  Булево
//
Функция ПолеPDFРаботаетВВебКлиенте() Экспорт  
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
