
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Дата");
	Список.УстановитьОграниченияИспользованияВПорядке(МассивКолонок);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Группы", Параметры.Группы, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ДатаСеанса = ТекущаяДатаСеанса();
	ДатаСеансаУниверсальная = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса());
	ПоправкаКУниверсальномуВремени = ДатаСеансаУниверсальная - ДатаСеанса;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		СтрокаСписка.Значение.Данные.Дата = СтрокаСписка.Значение.Данные.Дата
			+ СтрокаСписка.Значение.Данные.УниверсальнаяДатаВМиллисекундах / 1000
			- ПоправкаКУниверсальномуВремени;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти