// @strict-types

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаписываемыйИдентификатор = Запись.Идентификатор;
	Если Не ЗначениеЗаполнено(ЗаписываемыйИдентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ЗаписываемыйИдентификатор) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Указан некорретный идентификатор.
				 |Идентификатор должен быть вида: ""XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX"".'"), ,
			"Запись.Идентификатор");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
