
////////////////////////////////////////////////////////////////////////////////
// Шаблоны бизнес процессов переопределяемый: модуль содержит переопределяемые процедуры и функции
//                                            для шаблонов процессов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из ШаблоныБизнесПроцессов.ОбновитьДоступностьЗависимыхШаблонов при
// обновлении доступности зависимых шаблонов.
//
// Параметры:
//  Шаблон - Структура - 
//  СтандартнаяОбработка - Булево - В случае значения Истина обновление доступности
//                         будет выполнено способом по умолчанию.
//
Процедура ПриОбновленииДоступностиЗависимыхШаблонов(Шаблон, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
