///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//
// Модуль корректно компилируется и работает только на платформе 8.3.23
// На платформе младшей версии возможны ошибки статанализа и исполнения
//

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоддерживаетсяПотоковоеРаспознавание() Экспорт
	
#Если Не МобильныйКлиент И Не ТолстыйКлиентУправляемоеПриложение Тогда
	Возврат РаботаСРечью.ПоддерживаетсяПотоковоеРаспознавание();
#Иначе
	Возврат Ложь;
#КонецЕсли
	
КонецФункции

Процедура НачатьПотоковоеРаспознавание(
		Ключ,
		ОбработчикРаспознавания,
		ПараметрыМодели,
		ИспользованиеВариантаРасположенияРаботыСРечью,
		ПараметрыПотоковогоРаспознавания
	) Экспорт

#Если Не МобильныйКлиент И Не ТолстыйКлиентУправляемоеПриложение Тогда
	РаботаСРечью.НачатьПотоковоеРаспознавание(
		Ключ,
		ОбработчикРаспознавания,
		ПараметрыМодели,
		ИспользованиеВариантаРасположенияРаботыСРечью,
		ПараметрыПотоковогоРаспознавания
	);
#КонецЕсли
	
КонецПроцедуры

Процедура ОстановитьПотоковоеРаспознавание(Ключ) Экспорт

#Если Не МобильныйКлиент И Не ТолстыйКлиентУправляемоеПриложение Тогда
	РаботаСРечью.ОстановитьПотоковоеРаспознавание(Ключ);
#КонецЕсли

КонецПроцедуры

#КонецОбласти