////////////////////////////////////////////////////////////////////////////////
// Сотрудники (события, клиент)
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполнить инициализацию глобальных переменных подсистемы Сотрудники.
// Предназначена для вызова из обработчика ПриНачалеРаботыСистемы модулей управляемого и обычного приложения.
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	//  сразу в одной функции все вернуть.
	ПараметрыПередНачаломРаботы = СотрудникиВызовСервера.ПараметрыПередНачаломРаботы();
	
	СотрудникиТекущегоПользователя = ПараметрыПередНачаломРаботы.СотрудникиТекущегоПользователя;
	РолиТекущегоПользователя = ПараметрыПередНачаломРаботы.РолиТекущегоПользователя;
	ОсновнойСотрудник = ПараметрыПередНачаломРаботы.ОсновнойСотрудник;
	
КонецПроцедуры

#КонецОбласти