
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ДатаСоздания.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ДатаСоздания.Видимость = ЗначениеЗаполнено(ТекущийОбъект.Ссылка);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Элементы.ШаблоныИменФайлов.Видимость 
		= РаботаСФайламиВызовСервера.ЕстьШаблоныИмениПоРоли(Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ШаблоныИменФайлов(Команда)
	
	ПараметрыОткрытия = Новый Структура("РольФайла", Объект.Ссылка);
	ОткрытьФорму("Справочник.ШаблоныИменФайлов.Форма.ФормаСпискаДляРоли", ПараметрыОткрытия);
	
КонецПроцедуры
