#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	МаксимальноеЧислоПопыток = 3;
	Элементы.ПоставитьВОчередьПовторно.Видимость = Запись.Попыток = МаксимальноеЧислоПопыток;
	
	Отбор = Новый Структура("ОтметкаВремени, ЗависимыйОбъектМетаданных, ВлияющийОбъектМетаданных, КлючВлияющихДанных",
		Запись.ОтметкаВремени,
		Запись.ЗависимыйОбъектМетаданных,
		Запись.ВлияющийОбъектМетаданных,
		Запись.КлючВлияющихДанных);
		
	ДанныеЗаписи = РегистрыСведений.ОчередьОбновленияКэширующихДанных.Получить(Отбор);
	СтруктураИзменений = ДанныеЗаписи.ИзмененияВлияющихДанных.Получить();
	Если ТипЗнч(СтруктураИзменений) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение1 Из СтруктураИзменений Цикл
			ПредставлениеИзменений = ПредставлениеИзменений + ?(ПредставлениеИзменений = "", "", Символы.ПС);
			Если ТипЗнч(КлючИЗначение1.Значение) = Тип("Структура") Тогда
				ПредставлениеИзменений = ПредставлениеИзменений + 
					СтрШаблон("%1:",
						КлючИЗначение1.Ключ);
				Для Каждого КлючИЗначение2 Из КлючИЗначение1.Значение Цикл
					ПредставлениеИзменений = ПредставлениеИзменений + Символы.ПС;
					ПредставлениеИзменений = ПредставлениеИзменений + 
						СтрШаблон("    %1: %2",
							КлючИЗначение2.Ключ,
							КлючИЗначение2.Значение);
				КонецЦикла;
			Иначе
				ПредставлениеИзменений = ПредставлениеИзменений + 
					СтрШаблон("%1: %2",
						КлючИЗначение1.Ключ,
						КлючИЗначение1.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоставитьВОчередьПовторно(Команда)
	
	Запись.Попыток = 0;
	Записать();
	
КонецПроцедуры

#КонецОбласти
