#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ЭтоНовый() Тогда
	
		Скрипт = 
			"//Место для вашего кода
			|// Доступные переменные:
			|//  ТекстСообщения - Строка - Текст сообщения пользователя
			|//  Результат - Строка, Форматированная строка, Структура с полями
			|//    *Сообщение - Строка, Форматированная строка - Текст сообщения пользователю
			|//    *Действия - СписоЗначений - Действия сообщения чат-бота,
			|//     см. СообщениеСистемыВзаимодействия.Действия";
			
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли