
////////////////////////////////////////////////////////////////////////////////
// РаботаСКомплекснымиБизнесПроцессамиКлиентСервер: содержит, вызываемые с клиента,
//													процедуры работы с комплексными
//													процессами на сервере.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область СхемаПроцесса

#Область НастройкиЭлементов

#Область УсловияСхемы

// Возвращает пустое условие схемы комплексного процесса.
// 
// Возвращаемое значение:
// 	НастройкиКомпоновкиДанных
//
Функция ПустоеУсловиеСхемыКомплексногоПроцесса() Экспорт
	
	Возврат РаботаСКомплекснымиБизнесПроцессамиСервер.ПустоеУсловиеСхемыКомплексногоПроцесса();
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

// Возвращает признак необходимости проверки заполнения исполнителей в настройке действия
// комплексного процесса.
//
// Параметры:
//  Действие			 - СправочникСсылка.<ИмяШаблонаПроцесса> - служебный шаблон комплексного процесса.
//  ВладелецШаблона		 - СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов,
//                         БизнесПроцессСсылка.КомплексныйПроцесс - владелец служебного шаблона.
//  КомплексныйПроцесс	 - БизнесПроцессСсылка.КомплексныйПроцесс - комплексный процесс служебного шаблона.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ТребуетсяПроверкаЗаполненияИсполнителейДействия(
	Знач Действие, Знач ВладелецШаблона, Знач КомплексныйПроцесс) Экспорт
	
	СтруктураДействия = Новый Структура;
	СтруктураДействия.Вставить("Ссылка", Действие);
	СтруктураДействия.Вставить("ВладелецШаблона", ВладелецШаблона);
	СтруктураДействия.Вставить("КомплексныйПроцесс", КомплексныйПроцесс);
	
	ВладелецВерхнегоУровня = 
		РаботаСКомплекснымиБизнесПроцессамиСервер.ВладелецВерхнегоУровня(СтруктураДействия);
	
	Если Не ЗначениеЗаполнено(ВладелецВерхнегоУровня) Тогда
		
		Если Не ЗначениеЗаполнено(СтруктураДействия.Ссылка) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат БизнесСобытияВызовСервера.ЕстьЗаписиАвтоСтартаБизнесПроцессовДляШаблонаБизнесПроцессов(
			СтруктураДействия.Ссылка);
		
	ИначеЕсли ТипЗнч(ВладелецВерхнегоУровня) = Тип("БизнесПроцессСсылка.КомплексныйПроцесс") Тогда
		Возврат Истина;
	Иначе
		Возврат БизнесСобытияВызовСервера.ЕстьЗаписиАвтоСтартаБизнесПроцессовДляШаблонаБизнесПроцессов(
			ВладелецВерхнегоУровня);
	КонецЕсли;
	
КонецФункции

#КонецОбласти