#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.КоличествоКонтролей.Записывать = Истина;
	Для Каждого СтрокаПолучателя Из Получатели Цикл
		Движение = Движения.КоличествоКонтролей.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Пользователь = СтрокаПолучателя.Пользователь;
		Движение.НаКонтроле = 1;
		Движение.Просрочено = ?(КонтрольПросрочен, 1, 0);
	КонецЦикла;
	
	Движения.РеестрКонтролей.Записывать = Истина;
	Для Каждого СтрокаПолучателя Из Получатели Цикл
		Движение = Движения.РеестрКонтролей.Добавить();
		Движение.Пользователь = СтрокаПолучателя.Пользователь;
		Движение.ДатаСортировки = ДатаСортировки;
		Движение.Основание = Основание;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли