
////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с уведомлениями.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает список значений, содержащий подходящие тематики указанного вида документа.
// 
// Параметры:
// 	Текст - Строка - введеный текст поиска.
// 	ВидДокумента - СправочникСсылка.ВидыДокументов -ссылка на вид документа, для которого ищем тематики.
// 	 
// Возвращаемое значение:
// 	СписокЗначений - содержащий подходящие тематики указанного вида документа.
//
Функция ДанныеВыбораТематикиПоВиду(Текст, ВидДокумента) Экспорт
	
	Возврат РаботаСТематикамиДокументов.ДанныеВыбораТематикиПоВиду(Текст, ВидДокумента);
	
КонецФункции

// Возвращает список значений, содержащий виды документов и тематики
// 
// Параметры:
// 	Текст - Строка - введеный текст поиска
// 	ДополнительныеПараметры - Структура, Неопределено - параметры поиска
// 	
// Возвращаемое значение:
// 	СписокЗначений - содержащий виды документов и тематики удовлетворяющих поиску.
//
Функция ДанныеВыбораВидаИТематики(Текст, ДополнительныеПараметры = Неопределено) Экспорт

	Возврат РаботаСТематикамиДокументов.ДанныеВыбораВидаИТематики(Текст, ДополнительныеПараметры);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти