
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьГрамматикуРаспознаванияРечиДляПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Действует
		|	И НЕ Сотрудники.ПометкаУдаления";
	
	Список = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	Если Список.Количество() > 0 Тогда
		РаботаСРечьюБМОСервер.УстановитьДополнительнуюГрамматикуСеанса("ГрамматикаПользователи", Список);
	Иначе
		РаботаСРечьюБМОСервер.УдалитьДополнительнуюГрамматикуСеанса("ГрамматикаПользователи");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти