
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеМЭДОСсылка = СсылкаНаДанныеДокумента(ПараметрКоманды);
	Если ЗначениеЗаполнено(ДанныеМЭДОСсылка) Тогда
		ПоказатьЗначение( , ДанныеМЭДОСсылка);
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПрограммноеСоздание", Истина);
		ПараметрыФормы.Вставить("Документ", ПараметрКоманды);
		ОткрытьФорму(
			"Документ.ДанныеДокументаМЭДО.Форма.ФормаДокумента",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить ссылку на документ "Данные документа МЭДО".
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО
// 
// Возвращаемое значение:
//  ДокументСсылка.ДанныеДокументаМЭДО
&НаСервере
Функция СсылкаНаДанныеДокумента(Документ)
	
	Поля = Документы.ДанныеДокументаМЭДО.ДанныеДокументаМЭДО(
		Документ, "Ссылка", МЭДОСтруктурыДанных.НовыйЛегкийОтвет());
	Возврат Поля.Ссылка;
	
КонецФункции

#КонецОбласти
