
&После("ЗавершитьПодборИсполнителейИсполнения")
Процедура ЦППК_ЗавершитьПодборИсполнителейИсполнения(ВыбранныеИсполнители, ДопПараметры)
	
	Объект = ДопПараметры.Форма.Объект;
	СрокИсполнения = Объект.СрокОбработкиРезультатов;
	РеквизитИсполнители = ДопПараметры.РеквизитИсполнители;
	Для каждого стрИсполнитель Из РеквизитИсполнители Цикл
		
		стрИсполнитель.ВариантУстановкиСрокаИсполнения = ПредопределенноеЗначение(
		"Перечисление.ВариантыУстановкиСрокаИсполнения.ТочныйСрок");
		стрИсполнитель.СрокИсполнения = СрокИсполнения;
		
	КонецЦикла;
	
	
КонецПроцедуры

&После("ЗавершитьПодборИсполнителейДляПроцессов")
Процедура ЦППК_ЗавершитьПодборИсполнителейДляПроцессов(ВыбранныеИсполнители, ДопПараметры)

	Объект = ДопПараметры.Форма.Объект;
	СрокИсполнения = Объект.СрокИсполненияПроцесса;
	РеквизитИсполнители = ДопПараметры.РеквизитТаблица;
	Для каждого стрИсполнитель Из РеквизитИсполнители Цикл
		
		стрИсполнитель.ВариантУстановкиСрокаИсполнения = ПредопределенноеЗначение(
		"Перечисление.ВариантыУстановкиСрокаИсполнения.ТочныйСрок");
		стрИсполнитель.СрокИсполнения = СрокИсполнения;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ЗавершитьПодборИсполнителейСогласования")
Процедура ЦППК_ЗавершитьПодборИсполнителейСогласования(ВыбранныеИсполнители, ДопПараметры)
	
	Объект = ДопПараметры.Форма.Объект;
	СрокИсполнения = Объект.СрокОбработкиРезультатов;
	РеквизитИсполнители = ДопПараметры.РеквизитТаблица;
	Для каждого стрИсполнитель Из РеквизитИсполнители Цикл
		
		стрИсполнитель.ВариантУстановкиСрокаИсполнения = ПредопределенноеЗначение(
		"Перечисление.ВариантыУстановкиСрокаИсполнения.ТочныйСрок");
		стрИсполнитель.СрокИсполнения = СрокИсполнения;
		
	КонецЦикла;
	
КонецПроцедуры



