#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если Предопределенный И Ссылка <> Справочники.АдреснаяКнига.ВсеПользователи Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Раздел;
	ИначеЕсли Ссылка = Справочники.АдреснаяКнига.ВсеПользователи Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.РабочаяГруппа;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГруппыКонтактовПользователей") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаКонтактовПользователей;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.СтруктураПредприятия;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.РабочиеГруппы") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.РабочаяГруппа;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПапкиМероприятий") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ПапкаМероприятий;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Мероприятия") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Мероприятие;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПапкиПроектов") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ПапкаПроектов;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Проекты") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Проект;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Пользователи") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Пользователь;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.РольИсполнителей;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Сотрудники") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Сотрудник;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Организации") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Организация;	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЭтоГруппа") Тогда
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаКонтрагентов;
		Иначе
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.Контрагент;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.КонтактноеЛицо;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГруппыЛичныхАдресатов") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаЛичныхАдресатов;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ЛичныеАдресаты") Тогда
		ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ЛичныйАдресат;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.АвтоподстановкиДляОбъектов") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЭтоГруппа") Тогда
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаАвтоподстановокОбъектов;
		Иначе
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.АвтоподстановкаОбъектов;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.АвтоподстановкиДляПроцессов") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЭтоГруппа") Тогда
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.ГруппаАвтоподстановокПроцессов;
		Иначе
			ТипДанныхОбъекта = Перечисления.ТипыДанныхАдреснойКниги.АвтоподстановкаПроцессов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли