
#Область ПрограммныйИнтерфейс

//Возвращает массив поддерживаемых расширений
Функция РасширенияАвтозаполнения() Экспорт
	
	РасширенияАвтозаполненияСтрокой = "doc, docx, dot, dotx, odt, txt, html, htm";
	
	РасширенияАвтозаполнения = СтрРазделить(РасширенияАвтозаполненияСтрокой, ", ", Ложь);
	
	Возврат РасширенияАвтозаполнения;
	
КонецФункции

//Проверяет является ли данное расширение расширением автозаполнения
// Параметры:
//  Расшение - Строка - расширение файла
// Возвращаемое значение
// Истина/Ложь - булево
Функция ЭтоРасширениеАвтозаполнения(Расширение) Экспорт
	
	Расширение = СтрЗаменить(НРег(Расширение), ".", "");
	
	ЭтоРасширениеАвтозаполнения = (РасширенияАвтозаполнения().Найти(Расширение) <> Неопределено);
	
	Возврат ЭтоРасширениеАвтозаполнения
	
КонецФункции

// Устарел. См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаДляАвтозаполнения.
//
Функция ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, Знач НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаДляАвтозаполнения(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеДопРеквизитаДляЗамены.
//
Функция ПолучитьЗначениеДопРеквизитаДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт 
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеДопРеквизитаДляЗамены(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеКонтактнойИнформацииДляЗамены.
//
Функция ПолучитьЗначениеКонтактнойИнформацииДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеКонтактнойИнформацииДляЗамены(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения.
//
Функция ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаКорреспонденцииДляЗамены.
//
Функция ПолучитьЗначениеРеквизитаКорреспонденцииДляЗамены(НазваниеПоля, Корреспонденция) Экспорт

	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаКорреспонденцииДляЗамены(НазваниеПоля, Корреспонденция);

КонецФункции

#КонецОбласти
