// @strict-types


#Область ПрограммныйИнтерфейс

// Представление доверенности при подписании
// 
// Параметры:
//  Доверенность - ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеДоверенностиПриПодписании(Доверенность) Экспорт
	
	Если Не ЗначениеЗаполнено(Доверенность) Тогда
		Возврат НСтр("ru = 'Подписать без доверенности (от имени физ. лица)'");
	КонецЕсли;
	
	ПредставленияДоверенностей = РаботаСЭП.ПредставленияМЧДПриПодписании(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Доверенность));
	
	Возврат ПредставленияДоверенностей[Доверенность];
	
КонецФункции

// Сохраняет персональные настройки ЭП
// 
// Параметры:
//  СохраняемыеНастройки - Структура
// 
Процедура СохранитьПерсональныеНастройкиЭП(СохраняемыеНастройки) Экспорт
	
	ПерсональныеНастройки = ЭлектроннаяПодпись.ПерсональныеНастройки();
	ЗаполнитьЗначенияСвойств(ПерсональныеНастройки, СохраняемыеНастройки);
	ЭлектроннаяПодписьСлужебный.СохранитьПерсональныеНастройки(ПерсональныеНастройки);
	
	// Требуется для обновления персональных настроек на клиенте.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
