
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выбор схемы КОД'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Схема XML'") + "(*.xsd)|*.xsd";
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ОбработкаКомандыПослеВыбора", ЭтотОбъект));
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКомандыПослеВыбора(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено
			Или ВыбранныеФайлы.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ТекстовыйДокументПослеЗавершенияЧтения",
		ЭтотОбъект,
		Новый Структура("ТекстовыйДокумент", ТекстовыйДокумент));
	
	ТекстовыйДокумент.НачатьЧтение(ОписаниеОповещения, ВыбранныеФайлы[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйДокументПослеЗавершенияЧтения(Параметры) Экспорт
	
	УстановитьСхемуДанныхКОД(Параметры.ТекстовыйДокумент.ПолучитьТекст());
	Оповестить("КОД_ИзмененаСхемаДанных");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСхемуДанныхКОД(Схема)
	
	НачатьТранзакцию();
	Константы.ДатаЗагрузкиСхемыДанныхКОД.Установить(ТекущаяДатаСеанса());
	Константы.ХранилищеСхемыДанныхКОД.Установить(Новый ХранилищеЗначения(Схема));
	ЗафиксироватьТранзакцию();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти
