///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "1.0.1.3";
	
КонецФункции

Функция ПоддерживаетсяРаспознавание() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
		СистемнаяИнформация.ВерсияПриложения, "8.3.23.1200") >= 0;
	
КонецФункции

Функция РаспознаваниеДоступно() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ОписаниеМоделейРаспознавания = ПолучитьОписаниеМоделейРаспознавания();
	Исключение
		ОписаниеМоделейРаспознавания = Новый Массив;
	КонецПопытки;
	
	ЕстьДоступнаяЛокальная = Ложь;
	Для Каждого ОписаниеМодели Из ОписаниеМоделейРаспознавания Цикл
		Если ОписаниеМодели.ДоступнаВЛокальномВарианте Тогда
			ЕстьДоступнаяЛокальная = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеНастройки = Константы.НастройкиРаботыСРечью.ПолучитьБезопасно();
	
	Возврат ЕстьДоступнаяЛокальная
		Или (Не ТекущиеНастройки.ЗапретитьОблачноеРаспознавание И ПоддерживаетсяИспользованиеВнешнегоРасположения());
	
КонецФункции

Функция ПоддерживаетсяИспользованиеВнешнегоРасположения() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ПоддерживаетсяИспользованиеВнешнегоРасположения();
	
КонецФункции

Функция НовыйПараметрыВнешнегоПодключенияРаботыСРечью(Токен = Неопределено, Адрес = Неопределено) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Новый Структура("Адрес, Токен", Адрес, Токен);
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.НовыйПараметрыВнешнегоПодключенияРаботыСРечью(Токен, Адрес);
	
КонецФункции

Функция ВариантИспользованияРасположенияРаботыСРечью() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Новый Структура("Авто", Неопределено);
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ВариантИспользованияРасположенияРаботыСРечью();
	
КонецФункции

Процедура ВыполнитьРегистрациюСеанса(Логин = Неопределено, Пароль = Неопределено, Адрес = Неопределено) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.ВыполнитьРегистрациюСеанса(Логин, Пароль, Адрес);
	
КонецПроцедуры

Функция ПолучитьПараметрыВнешнегоПодключенияИнформационнойБазы() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ПолучитьПараметрыВнешнегоПодключенияИнформационнойБазы();
	
КонецФункции

Процедура УстановитьПараметрыВнешнегоПодключенияИнформационнойБазы(Параметры) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УстановитьПараметрыВнешнегоПодключенияИнформационнойБазы(Параметры);
	
КонецПроцедуры

Функция ПолучитьПараметрыВнешнегоПодключенияСеанса() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ПолучитьПараметрыВнешнегоПодключенияСеанса();
	
КонецФункции

Процедура УстановитьПараметрыВнешнегоПодключенияСеанса(Параметры) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УстановитьПараметрыВнешнегоПодключенияСеанса(Параметры);
	
КонецПроцедуры

Функция НовыйИдентификаторМоделиРаспознаванияРечи(ИдентификаторМодели) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.НовыйИдентификаторМоделиРаспознаванияРечи(ИдентификаторМодели);
	
КонецФункции

Функция ПолучитьОписаниеМоделейРаспознавания() Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ПолучитьОписаниеМоделейРаспознавания();
	
КонецФункции

Функция ПолучитьМодельРаспознаванияВоВременноеХранилище(ИдентификаторМодели) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РаботаСРечьюБМОСерверТолько8323.ПолучитьМодельРаспознаванияВоВременноеХранилище(ИдентификаторМодели);
	
КонецФункции

Процедура УстановитьМодельРаспознаванияДляИнформационнойБазы(Источник) Экспорт 
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УстановитьМодельРаспознаванияДляИнформационнойБазы(Источник);
	
КонецПроцедуры

Процедура УдалитьМодельРаспознаванияДляИнформационнойБазы(ИдентификаторМодели) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УдалитьМодельРаспознаванияДляИнформационнойБазы(ИдентификаторМодели);
	
КонецПроцедуры

Процедура УстановитьДополнительнуюГрамматикуСеанса(Ключ, ДополнительнаяГрамматика) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УстановитьДополнительнуюГрамматикуСеанса(Ключ, ДополнительнаяГрамматика);
	
КонецПроцедуры

Процедура УдалитьДополнительнуюГрамматикуСеанса(Ключ) Экспорт
	
	Если Не ПоддерживаетсяРаспознавание() Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРечьюБМОСерверТолько8323.УдалитьДополнительнуюГрамматикуСеанса(Ключ);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// Регистрирует список сервисов, которые доступны для
// использования в конфигурации.
//
// Параметры:
//   СервисыСопровождения - Массив    - массив структур, описывающий сервисы доступные для использовании в конфигурации;
//     Значение - Структура - см. ПодключениеСервисовСопровождения.НовыйОписательСервиса().
//
Процедура ПриДобавленииОписанийСервисовСопровождения(СервисыСопровождения) Экспорт
	
	ОписательСервиса = ПодключениеСервисовСопровождения.НовыйОписательСервиса();
	ОписательСервиса.Идентификатор   = РаботаСРечьюБМОКлиентСервер.ИдентификаторСервиса();
	ОписательСервиса.Картинка        = Метаданные.ОбщиеКартинки.РаспознаваниеРечи72;
	ОписательСервиса.Наименование    = НСтр("ru = '1С:Распознавание речи'");
	ОписательСервиса.Описание        = НСтр("ru = 'Бесплатно подключите тестовый пакет для сервиса 1С:Распознавание речи. Его хватит на распознавание до 1 часа потокового аудио'");
	
	СервисыСопровождения.Добавить(ОписательСервиса);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
