
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВариантыРазмещения = Справочники.ТипыДанныхКОД.ВариантыРазмещения(ТекущийОбъект);
	Если ВариантыРазмещения.Найти(ТекущийОбъект.Размещение) = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Допустимые варианты размещения:
			|%1'"),
			СтрСоединить(ВариантыРазмещения, Символы.ПС));
			
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, ТекущийОбъект.Ссылка, "Размещение", "Объект.Размещение", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
