
#Область ПрограммныйИнтерфейс

Процедура УстановитьОтборСписка(Список, ПараметрыОтбора) Экспорт
	
	// вид документа 
	ВидДокумента = ПараметрыОтбора.Получить("ВидДокумента");
	Если ВидДокумента <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"ВидДокумента");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"ВидДокумента",
				ВидДокумента,
				ВидСравненияКомпоновкиДанных.ВИерархии);
		КонецЕсли;
	КонецЕсли;
	
	// Тематика 
	Тематика = ПараметрыОтбора.Получить("Тематика");
	Если Тематика <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Тематика) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Тематика");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Тематика",
				Тематика,
				ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	КонецЕсли;
	
	// папка 
	Папка = ПараметрыОтбора.Получить("Папка");
	Если Папка <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Папка) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Папка");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Папка",
				Папка,
				ВидСравненияКомпоновкиДанных.ВИерархии);
		КонецЕсли;
	КонецЕсли;
	
	// организация 
	Организация = ПараметрыОтбора.Получить("Организация");
	Если Организация <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Организация) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Организация");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Организация",
				Организация);
		КонецЕсли;
	КонецЕсли;
	
	// сторона 1 
	Сторона1 = ПараметрыОтбора.Получить("Сторона1");
	Если Сторона1 <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Сторона1) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Сторона1");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Сторона1",
				Сторона1);
		КонецЕсли;
	КонецЕсли;
	
	// контрагент  
	Контрагент = ПараметрыОтбора.Получить("Контрагент");
	Если Контрагент <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Контрагент) Тогда	
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту", Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", Неопределено);
		Иначе			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту", Истина);
			Список.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", Контрагент);
		КонецЕсли;
	КонецЕсли;
	
	// сторона 1 
	Сторона2 = ПараметрыОтбора.Получить("Сторона2");
	Если Сторона2 <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Сторона2) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Сторона2");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Сторона2",
				Сторона2);
		КонецЕсли;
	КонецЕсли;
	
	// проект 
	Проект = ПараметрыОтбора.Получить("Проект");
	Если Проект <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Проект) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Проект");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Проект",
				Проект,
				ВидСравненияКомпоновкиДанных.ВИерархии);
		КонецЕсли;
	КонецЕсли;
	
	// Период 
	ПериодВыборки = ПараметрыОтбора.Получить("ПериодВыборки");
	Если ПериодВыборки <> Неопределено Тогда 
		
		Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборПериодНачало"));
		Параметр.Использование = Ложь;
		Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборПериодОкончание"));
		Параметр.Использование = Ложь;
		
		Если ЗначениеЗаполнено(ПериодВыборки.ДатаНачала) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПериодНачало", ПериодВыборки.ДатаНачала);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПериодВыборки.ДатаОкончания) Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПериодОкончание", ПериодВыборки.ДатаОкончания);
		КонецЕсли;
		
	КонецЕсли;
	
	// состояние
	Состояние = ПараметрыОтбора.Получить("Состояние");
	Если Состояние <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Состояние) Тогда 
			Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Состояние"));
			Параметр.Использование = Ложь;
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("Состояние", Состояние);
		КонецЕсли;	
	КонецЕсли;
	
	// категория
	Категория = ПараметрыОтбора.Получить("Категория");
	Если Категория <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Категория) Тогда 
			Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Категория"));
			Параметр.Использование = Ложь;
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("Категория", Категория);
		КонецЕсли;	
	КонецЕсли;
	
	// Прочитанность
	ПрочитанностьОтбор = ПараметрыОтбора.Получить("Прочитанность");
	Если ПрочитанностьОтбор <> Неопределено Тогда 
		
		Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборПоНепрочтенные"));
		Параметр.Использование = Ложь;
		
		Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборПоПрочтенные"));
		Параметр.Использование = Ложь;
		
		Если ЗначениеЗаполнено(ПрочитанностьОтбор) Тогда 
			
			Если ПрочитанностьОтбор = "Непрочтенные" Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНепрочтенные", Истина);
			ИначеЕсли ПрочитанностьОтбор = "Прочтенные" Тогда	
				Список.Параметры.УстановитьЗначениеПараметра("ОтборПоПрочтенные", Истина);
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;
	
	// Важность
	ВажностьОтбор = ПараметрыОтбора.Получить("Важность");
	Если ВажностьОтбор <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ВажностьОтбор) Тогда 
			Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Важность"));
			Параметр.Использование = Ложь;
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("Важность", ВажностьОтбор);
		КонецЕсли;
	КонецЕсли;
	
	// СостояниеМЭДО
	СостояниеМЭДООтбор = ПараметрыОтбора.Получить("СостояниеМЭДО");
	Если СостояниеМЭДООтбор <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СостояниеМЭДООтбор) Тогда 
			Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СостояниеМЭДО"));
			Параметр.Использование = Ложь;
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("СостояниеМЭДО", СостояниеМЭДООтбор);
		КонецЕсли;
	КонецЕсли; 
	
	// СостоянияЭДО
	СостояниеЭДООтбор = ПараметрыОтбора.Получить("СостоянияЭДО");
	Если СостояниеЭДООтбор <> Неопределено Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СостоянияЭДО", СостояниеЭДООтбор);
	КонецЕсли;
	
	// Форма и шаблон документа
	// Параметр объединен, потому что в РС ДанныеДокументовПредприятия нет информации по форме и шаблону
	// Для отбора по этим параметрам приходится делать запрос в условии
	// Поэтому сделал объединенный параметр, иначе бы выполнялось 2 разных запроса
	//
	ФормаОтбор = ПараметрыОтбора.Получить("ФормаДокумента"); 
	ШаблонОтбор = ПараметрыОтбора.Получить("ШаблонДокумента");
	Если ФормаОтбор <> Неопределено И ШаблонОтбор <> Неопределено Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ОтборДляСвязиСДокументомЭДО", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ФормаОтбор", ФормаОтбор); 
		Список.Параметры.УстановитьЗначениеПараметра("ШаблонОтбор", ШаблонОтбор);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьОтборВидДокумента(Список, ВидДокумента, Тематика, ДоступныеВидыДокументов) Экспорт
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		ПараметрОтбора = ВидДокумента;
	ИначеЕсли ДоступныеВидыДокументов.Количество() <> 0 Тогда
		ПараметрОтбора = ДоступныеВидыДокументов.ВыгрузитьЗначения();
	Иначе
		ПараметрОтбора = ПредопределенноеЗначение("Справочник.ВидыДокументов.ПустаяСсылка");
	КонецЕсли;
	
	ПараметрыОтбора = Новый Соответствие;
	ПараметрыОтбора.Вставить("ВидДокумента", ПараметрОтбора);
	Параметрыотбора.Вставить("Тематика", Тематика);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецФункции

#КонецОбласти

