
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Длина) Тогда 
		ДлинаРегНомера = Параметры.Длина;
	Иначе 
		// Регистрация документа
		ДлинаРегНомера = Метаданные.ОпределяемыеТипы.РегистрационныйНомер.Тип.КвалификаторыСтроки.Длина;
	КонецЕсли;
	
	ОграничениеТипа = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(ДлинаРегНомера));
	Элементы.Значение.ОграничениеТипа = ОграничениеТипа;
	
	Если ЗначениеЗаполнено(Параметры.Надпись) Тогда 
		Элементы.Надпись.Заголовок = Параметры.Надпись;
	Иначе
		Элементы.Надпись.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Значение) Тогда 
		Значение = Параметры.Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указано значение'"),,"Значение");
		Возврат;
	КонецЕсли;
	
	Закрыть(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
