
// <Описание функции>
//
// Параметры:
//  Субъект  - СпровочникСсылка.Пользователи - Проверяемый пользователь
//
//  СписокПолномочий  - СписокЗначений - Список проверяемых полномочий
//
// Возвращаемое значение:
//   Булево   - Истина если иммеет
//
Функция ИмеетПолномочия(Субъект, СписокПолномочий) Экспорт
	// Котляров 14.07.2025
	Запрос = Новый Запрос;

	//Установка значений параметров
	Запрос.УстановитьПараметр("Субъект", Субъект);
	Запрос.УстановитьПараметр("СписокПолномочий", СписокПолномочий);

	Запрос.Текст = "ВЫБРАТЬ
	|	ПолномочияСотрудников.Полномочия КАК Полномочия,
	|	МАКСИМУМ(СотрудникиВКонтейнерах.Сотрудник <> СотрудникиВКонтейнерах.Контейнер) КАК Унаследована
	|ИЗ
	|	РегистрСведений.ПолномочияСотрудников КАК ПолномочияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВКонтейнерах КАК СотрудникиВКонтейнерах
	|		ПО (ПолномочияСотрудников.Владелец = СотрудникиВКонтейнерах.Контейнер)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
	|		ПО (СотрудникиВКонтейнерах.Сотрудник = СотрудникиПользователей.Сотрудник)
	|ГДЕ
	|	СотрудникиПользователей.Пользователь = &Субъект
	|	И ПолномочияСотрудников.Полномочия В (&СписокПолномочий)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПолномочияСотрудников.Полномочия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПолномочияСотрудников.Полномочия,
	|	МАКСИМУМ(СотрудникиВКонтейнерах.Сотрудник <> СотрудникиВКонтейнерах.Контейнер)
	|ИЗ
	|	РегистрСведений.ПолномочияСотрудников КАК ПолномочияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВКонтейнерах КАК СотрудникиВКонтейнерах
	|		ПО ПолномочияСотрудников.Владелец = СотрудникиВКонтейнерах.Контейнер
	|ГДЕ
	|	СотрудникиВКонтейнерах.Сотрудник = &Субъект
	|    И ПолномочияСотрудников.Полномочия В (&СписокПолномочий)
	|СГРУППИРОВАТЬ ПО
	|	ПолномочияСотрудников.Полномочия";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	

КонецФункции // ИмеетПолномочия()
