
#Область ПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

// Обработчик подписки МП_ПередЗаписьюПапкиПисем.
Процедура ПередЗаписьюПапкиПисем(Источник, Отказ) Экспорт

	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеПриложения") Тогда
		Возврат;
	КонецЕсли;

	Источник.ДополнительныеСвойства.Вставить("Родитель", Источник.Ссылка.Родитель);

КонецПроцедуры

// Обработчик подписики МП_ПриЗаписиПапкиПисем.
// Если синхронизируемая с мобильным клиентом папка писем переносится в несинхронизируюмую папку, 
//	то эта несинхронизируемая папка и все ее родители становятся синхронизируемыми.
Процедура ПриЗаписиПапкиПисем(Источник, Отказ) Экспорт

	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеПриложения") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.Родитель = Источник.Родитель Тогда
		Возврат;
	КонецЕсли;

	ПапкиДляСинхронизации = 
		РегистрыСведений.СинхронизацияПапокПисемСМобильнымКлиентом.ПолучитьПапкиДляСинхронизации(
			Пользователи.ТекущийПользователь());

	Если ПапкиДляСинхронизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивДобавленныхПапок = Новый Массив;
	БылиДобавленыПапки     = Ложь;

	Если ПапкиДляСинхронизации.Найти(Источник.Ссылка) <> Неопределено Тогда

		МассивРодителейПапки = ПолучитьВсехРодителейПапки(Источник.Ссылка);

		Для Каждого Папка Из МассивРодителейПапки Цикл
			Если ПапкиДляСинхронизации.Найти(Папка) = Неопределено Тогда
				ПапкиДляСинхронизации.Добавить(Папка);
				МассивДобавленныхПапок.Добавить(Папка);
				БылиДобавленыПапки = Истина;
			КонецЕсли;
		КонецЦикла;

		Если БылиДобавленыПапки Тогда
			РегистрыСведений.СинхронизацияПапокПисемСМобильнымКлиентом.ЗаписатьПапки(ПапкиДляСинхронизации);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Отправляет письма полученные с мобильного клиента.
//
// Параметры:
//  МобильныйКлиент - ПланОбменаСсылка.Мобильный - Узел обмена с клиентом обмена;
//  ПисьмаКОтправке - Массив - Список писем полученных с мобильного в сеансе обмена.
//
Процедура ОтправитьПисьмаПолученныеСМобильногоКлиента(МобильныйКлиент, ПисьмаКОтправке) Экспорт

	// Обходим массив подготовленных к отправке писем и записываем у них дату подготовки к отправке, 
	//	чтобы регламентное задание начало их отправлять.
	Для Каждого ПодготовленноеПисьмо Из ПисьмаКОтправке Цикл

		ПисьмоОбъект = ПодготовленноеПисьмо.Ссылка.ПолучитьОбъект();
		ПисьмоОбъект.ПодготовленоКОтправке = ПодготовленноеПисьмо.ПодготовленоКОтправке;

		РегистрыСведений.МП_ПротоколРаботыПользователей.ДобавитьИнформациюПоОбъекту(
			НСтр("ru = 'Отправка письма полученного из мобильного клиента'"),
			Строка(ТипЗнч(ПисьмоОбъект)),
			ПисьмоОбъект.Ссылка.УникальныйИдентификатор(),
			Ложь,
			МобильныйКлиент);

		ПисьмоОбъект.Записать();

	КонецЦикла;

КонецПроцедуры

// Получает краткий текст указанной длины из указанного оригинального текста.
// Удаляются лишние пустые строки.
// Параметры:
//	Текст - исходный текст
//	Длина - длина короткого текста, который необходимо получить
Функция ПолучитьКраткийТекст(Текст, Длина) Экспорт 

	Если ТипЗнч(Текст) = Тип("ХранилищеЗначения") Тогда
		Строка = Текст.Получить();
	ИначеЕсли ТипЗнч(Текст) = Тип("Строка") Тогда
		Строка = Текст;
	Иначе
		Возврат "";
	КонецЕсли;

	КраткийТекст = Строка;

	Пока СтрНайти(КраткийТекст, Символы.ВК) > 0 Цикл
		КраткийТекст = СтрЗаменить(КраткийТекст, Символы.ВК, "");
	КонецЦикла;

	Пока СтрНайти(КраткийТекст, "  ") > 0 Цикл
		КраткийТекст = СтрЗаменить(КраткийТекст, "  ", " ");
	КонецЦикла;

	Пока СтрНайти(КраткийТекст, " " + Символы.ПС) > 0 Цикл
		КраткийТекст = СтрЗаменить(КраткийТекст, " " + Символы.ПС, Символы.ПС);
	КонецЦикла;

	Пока СтрНайти(КраткийТекст, Символы.ПС + Символы.ПС) > 0 Цикл
		КраткийТекст = СтрЗаменить(КраткийТекст, Символы.ПС+Символы.ПС, Символы.ПС);
	КонецЦикла;

	Пока Сред(КраткийТекст, 1, 1) = " " Цикл
		КраткийТекст = Сред(КраткийТекст, 2, СтрДлина(КраткийТекст));
	КонецЦикла;

	Пока Сред(КраткийТекст, 1, 1) = Символы.ПС Цикл
		КраткийТекст = Сред(КраткийТекст, 2, СтрДлина(КраткийТекст));
	КонецЦикла;

	КраткийТекст = Сред(КраткийТекст, 1, Длина);
	КраткийТекст = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(КраткийТекст);

	Возврат КраткийТекст;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВсехРодителейПапки(Знач Папка)

	МассивРодителей = Новый Массив;

	Пока ЗначениеЗаполнено(Папка.Родитель) Цикл
		МассивРодителей.Добавить(Папка.Родитель);
		Папка = Папка.Родитель;
	КонецЦикла;

	Возврат МассивРодителей;

КонецФункции

#КонецОбласти


