#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает представление состояния отложенного выполнения действия.
// 
// Возвращаемое значение:
//  Строка - Представление отложенного запуска.
//
Функция ПредставлениеОтложенногоВыполнения(Знач Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаЗапуска = ТекущаяДатаСеанса();                  
	
	Если Не ДействияКлиентСервер.ЭтоДействиеОзнакомления(Действие) Тогда
	
		АктивныеПроцессы = РегистрыСведений.ПроцессыДействий.ПроцессыДействия(Действие, Истина);
		Для Каждого ПроцессДействия Из АктивныеПроцессы Цикл
			НастройкаОтложеногоСтарта = РегистрыСведений.НастройкиОтложеногоСтартаПроцессов.ПолучитьСведенияОЗапускеПроцесса(
				ПроцессДействия);
				
			Если НастройкаОтложеногоСтарта <> Неопределено Тогда
				ДатаЗапуска = НастройкаОтложеногоСтарта.ДатаОтложенногоСтарта;
				Прервать;
			КонецЕсли;
		КонецЦикла;
			
	Иначе  // ознакомление		

		НастройкаОтложеногоСтарта = РегистрыСведений.НастройкиОтложенногоНачалаВыполненияДействий.ПолучитьСведенияОЗапускеДействия(
			Действие);
			
		Если НастройкаОтложеногоСтарта <> Неопределено Тогда
			ДатаЗапуска = НастройкаОтложеногоСтарта.ДатаОтложенногоСтарта;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru = 'Начнется в %1'"), 
		Формат(ДатаЗапуска, "ДФ='HH:mm dd.MM.yyyy'"));
		
КонецФункции

#КонецОбласти

#КонецЕсли