#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ВсеЗадачи");
	
	ОткрытьФорму("Документ.Задача.Форма.Задачи",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыФормы.КлючНазначенияИспользования + Строка(ПараметрыВыполненияКоманды.Уникальность),
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти