// @strict-types


#Область ПрограммныйИнтерфейс

Функция ИмяЭлементаНадписьОбменВДругойВерсии() Экспорт
	
	Возврат "НадписьОбменВПредыдущейВерсии";
	
КонецФункции

// Возвращает текст сообщения при блокировке обмена при миграции данных из 2.1
// 
// Возвращаемое значение:
// 	Строка - текст сообщения.
Функция ТекстСообщенияОБлокировкеПриМиграции() Экспорт
	
	Возврат НСтр("ru = 'Обмен по ЭДО производится в 1С:Документооборот 2.1.'");
	
КонецФункции

// Текст декорации о блокировке при миграции.
// 
// Возвращаемое значение:
//  Строка
Функция ТекстДекорацииОБлокировкеПриМиграции() Экспорт
	
	Возврат НСтр("ru = 'Выполняется загрузка данных с 1С:Документооборот 2.1. Настройка и выполнение обмена станет возможна после включения в 1С:Документооборот 2.1 опции ""Обмен с внешними ресурсами в новой версии"".'");
	
КонецФункции

#КонецОбласти