Процедура УстановитьВидимостьЭлементовВОтветНаИПредметПереписки(Форма) Экспорт
	
	ЭтоКорреспонденция = Форма.ВидДокументаКэш.ЯвляетсяВходящейКорреспонденцией Или 
		Форма.ВидДокументаКэш.ЯвляетсяИсходящейКорреспонденцией;
	
	Форма.Элементы.ГруппаСписокВОтветНаИКоманды.Видимость = ЭтоКорреспонденция И Форма.НесколькоВОтветНа;
	Форма.Элементы.ГруппаСписокПредметовПерепискиИКоманды.Видимость = ЭтоКорреспонденция И Форма.НесколькоПредметовПереписки;
	
	Форма.Элементы.ГруппаВОтветНаНесколько.Видимость = ЭтоКорреспонденция И Не Форма.НесколькоВОтветНа;
	Форма.Элементы.ГруппаПредметПерепискиНесколько.Видимость = ЭтоКорреспонденция И Не Форма.НесколькоПредметовПереписки;
	
КонецПроцедуры