#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НеДействует");
	Поля.Добавить("НеДействуетДата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.НеДействует Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Данные.НеДействуетДата) Тогда
			Представление = СтрШаблон(НСтр("ru = '%1 (не действует с %2)'"),
				Данные.Наименование,
				Формат(Данные.НеДействуетДата, "ДФ=dd.MM.yyyy;"));
		Иначе
			Представление = СтрШаблон(НСтр("ru = '%1 (не действует)'"),
			Данные.Наименование);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	Параметры.Отбор.Вставить("НеДействует", Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
