
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоляКомпоновки")
Процедура ЦППК_ЗаполнитьПоляКомпоновки()

	Настройки = Неопределено;
	Если ЗначениеЗаполнено(НавигационнаяСсылкаНаУсловие) Тогда
		Хранилище = ПолучитьИзВременногоХранилища(НавигационнаяСсылкаНаУсловие);
		Настройки = Хранилище.Получить();
	КонецЕсли; 
	
	#Удаление
	СхемаКомпоновкиДанных = Справочники.ПравилаРазмещенияФайловВТомах.ПолучитьМакет("Версии");
	#КонецУдаления   
	
	#Вставка
	СхемаКомпоновкиДанных = Справочники.ПравилаРазмещенияФайловВТомах.ПолучитьМакет("ЦППК_Версии");
	#КонецВставки

	Если Настройки = Неопределено Тогда
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;

	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(Настройки);

КонецПроцедуры
