// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ключи = РаботаСВнешнимПодписанием.КлючиСервисаИзБезопасногоХранилища(Параметры.Сервис);
	Если Ключи <> Неопределено Тогда
		ИдентификаторКлиента = Ключи.ИдентификаторКлиента;
		СекретКлиента = Ключи.СекретКлиента;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВводимыеЗначенияПриИзменении(Элемент)
	
	Элементы.ИдентификаторКлиента.Видимость = Не ПоказыватьВводимыеЗначения;
	Элементы.ИдентификаторКлиентаБезРежимаПароля.Видимость = ПоказыватьВводимыеЗначения;
	
	Элементы.СекретКлиента.Видимость = Не ПоказыватьВводимыеЗначения;
	Элементы.СекретКлиентаБезРежимаПароля.Видимость = ПоказыватьВводимыеЗначения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
	ВозвращаемоеЗначение.Вставить("СекретКлиента", СекретКлиента);
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры


#КонецОбласти
