// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

	// Запись в журнал регистрации о результате нагрузочного тестирования. И это же сообщение выдать на экран.
	// 
	// Параметры:
	//  ЭтоОшибка - Булево - Признак ошибки, тогда в ТекстСообщения передано сообщение об ошибке
	//  ТекстСообщения - Строка - Текст сообщения
	Процедура ЗаписьВЖурналОРезультате(Знач ЭтоОшибка, Знач ТекстСообщения = "") Экспорт
		
		Если ЭтоОшибка Тогда
			ЗавершилосьОшибкой = НСтр("ru = 'Нагрузочное тестирование завершилось с ошибкой'");
			ЗаписьЖурналаРегистрации(ЗавершилосьОшибкой, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1 - %2", ЗавершилосьОшибкой, ТекстСообщения));
		Иначе
			Успешно = НСтр("ru = 'Нагрузочное тестирование успешно завершено'");
			ЗаписьЖурналаРегистрации(Успешно, УровеньЖурналаРегистрации.Информация);
			ОбщегоНазначения.СообщитьПользователю(Успешно);
		КонецЕсли;
		
	КонецПроцедуры
	
	// Установить признак, что это сеанс нагрузочного тестирования - в параметр сеанса. Для проверок с сервера
	// 
	// Параметры:
	//  Признак - Булево - установить Истина установить, снять Ложь
	Процедура УстановитьПризнакНагрузочногоТестирования(Знач Признак) Экспорт
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыСеанса.ЭтоНагрузочноеТестирование = Признак;
		
	КонецПроцедуры
	
#КонецОбласти
