// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Заполняет ресурс "КраткийТекст" строкой из переданной таблицы
// Параметры:
//  ТаблицаКраткихТекстов - ТаблицаЗначений - Таблица с колонками, соответствующие измерению
//   и ресурсу текущему РС:
//   *Письмо - ДокументСсылка.ВходящееПисьмо, ДокументСсылка.ИсходящееПисьмо - Письмо
//   *КраткийТекст - Строка - Строка краткого текст
//
Процедура ЗаполнитьИзТаблицыКраткихТекстов(ТаблицаКраткихТекстов) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаКраткихТекстов);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
