
&ИзменениеИКонтроль("ПроверкаПеретаскиванияФайлов")
Функция ЦППК_ПроверкаПеретаскиванияФайлов(Форма, ВладелецФайла, РольФайла, ПараметрыПеретаскивания)

	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("Отказ", Ложь);
	РезультатПроверки.Вставить("ТекстПредупреждения", "");
	РезультатПроверки.Вставить("СохранитьСведенияОбОригиналеФайла", Ложь);

	ДоступноИнтерактивноеИзменениеФайлов = ОбщегоНазначенияДокументооборотКлиентСервер.ДоступноИнтерактивноеИзменениеФайлов(
	ВладелецФайла);
	Если Не ДоступноИнтерактивноеИзменениеФайлов Тогда
		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Недоступно интерактивное изменение файлов, приложенных к ""%1 (%2)"".'"),
		ВладелецФайла,
		ТипЗнч(ВладелецФайла));
		Возврат РезультатПроверки;
	КонецЕсли;

	Если ТипЗнч(ВладелецФайла) <> Тип("СправочникСсылка.ДокументыПредприятия")
		И ТипЗнч(ВладелецФайла) <> Тип("ДокументСсылка.ИсходящееПисьмо") Тогда
		Возврат РезультатПроверки;
	КонецЕсли;

	ИмяБезРасширения = "";
	Расширение = "";
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда

		ИмяБезРасширения = ПараметрыПеретаскивания.Значение.ИмяБезРасширения;
		Расширение = ПараметрыПеретаскивания.Значение.Расширение;

	КонецЕсли;

	ДанныеПроверки = ОбщегоНазначенияДокументооборотВызовСервера.ПроверкаПеретаскиванияФайлов(
	ВладелецФайла,
	РольФайла,
	ИмяБезРасширения,
	Расширение);

	РезультатПроверки.СохранитьСведенияОбОригиналеФайла =
	ДанныеПроверки.СохранитьСведенияОбОригиналеФайла;

	ДрагДропНесколькоФайлов = Ложь;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 1 Тогда
		ДрагДропНесколькоФайлов = Истина;
	КонецЕсли;

	Если Не ДанныеПроверки.ДоступноИзменение Тогда
		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = НСтр("ru = 'Недоступно изменение владельца файлов.'");
		Возврат РезультатПроверки;
	КонецЕсли;

	Если (ЗначениеЗаполнено(ДанныеПроверки.РегистрационныйНомер) 
		Или ДанныеПроверки.СостояниеОбработки = ПредопределенноеЗначение("Перечисление.СостоянияОбработкиОбъектов.Выполняется"))
		И ДанныеПроверки.РолиФайлов.Количество() <> 0
		И ДанныеПроверки.ИспользоватьРолиФайлов Тогда

		Если ДанныеПроверки.ВВидеЭтаРольТолькоОдинФайл
			И Не ДанныеПроверки.НетФайловВРоли Тогда

			РезультатПроверки.Отказ = Истина;
			РезультатПроверки.ТекстПредупреждения =
			СтрШаблон(
			НСтр("ru = 'В роли ""%1"" с признаком ""Только один файл"" уже есть файл, поэтому добавить еще один файл в эту роль нельзя.' "),
			РольФайла);

			Возврат РезультатПроверки;

		ИначеЕсли ДанныеПроверки.ВВидеЭтаРольТолькоОдинФайл
			И ДрагДропНесколькоФайлов Тогда

			РезультатПроверки.Отказ = Истина;
			РезультатПроверки.ТекстПредупреждения =
			СтрШаблон(
			НСтр("ru = 'В роль ""%1"" с признаком ""Только один файл"" можно добавить только один файл.' "),
			РольФайла);

			Возврат РезультатПроверки;

		КонецЕсли;

	КонецЕсли;

	Если Не ДанныеПроверки.ДоступноМенятьРолиФайловДрагДропом
		И ДанныеПроверки.РолиФайлов.Количество() <> 0 
		И ДанныеПроверки.ИспользоватьРолиФайлов
		И Не ДанныеПроверки.ЭтоНовыйФайл Тогда

		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = 
		СтрШаблон(
		НСтр("ru = 'В текущем состоянии ""%1"" менять роль файлов нельзя.'"),
		ДанныеПроверки.СостояниеТекст);

		Возврат РезультатПроверки;

	КонецЕсли;

#Удаление
	Если Не ДанныеПроверки.ДоступноСоздатьФайлОбычный
		И Не ДанныеПроверки.ДоступноСоздатьФайлОригинал Тогда
#КонецУдаления
#Вставка
		Если Не ДанныеПроверки.ДоступноСоздатьФайлОбычный
			И Не ДанныеПроверки.ДоступноСоздатьФайлОригинал 
			И Не ОбщегоНазначенияДокументооборотВызовСервера.ЭтоПолноправныйПользователь() Тогда
#КонецВставки

		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'В текущем состоянии ""%1"" файлы добавлять нельзя.'"),
		ДанныеПроверки.СостояниеТекст);

		Возврат РезультатПроверки;

	ИначеЕсли ДанныеПроверки.ВестиУчетСканКопийОригиналовДокументов 
		И ДанныеПроверки.ДоступноСоздатьФайлОригинал
		И Не ДанныеПроверки.ДоступноСоздатьФайлОбычный Тогда

		Текст = СтрШаблон(
		НСтр("ru = 'В текущем состоянии ""%1"" можно добавить только скан-копию оригинала документа. Продолжить?'"),
		ДанныеПроверки.СостояниеТекст);

		СписокВариантовОтветов = Новый СписокЗначений;
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Да));
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Нет));

		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Форма", Форма);
		ПараметрыОбработчика.Вставить("ВладелецФайла", ВладелецФайла);
		ПараметрыОбработчика.Вставить("РольФайла", РольФайла);
		ПараметрыОбработчика.Вставить("ДанныеПроверки", ДанныеПроверки);
		ПараметрыОбработчика.Вставить("ПараметрыПеретаскивания", ПараметрыПеретаскивания);

		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПроверкаПеретаскиванияФайловПеретаскиваниеОригинала",
		ЭтотОбъект,
		ПараметрыОбработчика);

		ДелопроизводствоКлиент.ПоказатьРасширеннуюФормуВопроса(
		Форма,
		НСтр("ru = 'Перетаскивание файла'"),
		Текст,
		"ДобавлениеОригинала",
		"ЗадаватьВопросПриДобавленииСканКопииОригинала",
		СписокВариантовОтветов,,
		ОписаниеОповещения);

		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = "";

		Возврат РезультатПроверки;

	КонецЕсли;

	Возврат РезультатПроверки;

КонецФункции

&ИзменениеИКонтроль("ПроверкаДобавленияФайлов")
Функция ЦППК_ПроверкаДобавленияФайлов(Форма, ВладелецФайла, РольФайла, ВставитьКартинкуИзБуфера)

	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("Отказ", Ложь);
	РезультатПроверки.Вставить("МожноДобавитьТолькоОдинФайл", Ложь);
	РезультатПроверки.Вставить("ШаблонаДокумента", ПредопределенноеЗначение("Справочник.ШаблоныДокументов.ПустаяСсылка"));
	РезультатПроверки.Вставить("ТекстПредупреждения", "");
	РезультатПроверки.Вставить("ДанныеПроверки", Неопределено);

	ДоступноИнтерактивноеИзменениеФайлов = ОбщегоНазначенияДокументооборотКлиентСервер.ДоступноИнтерактивноеИзменениеФайлов(
	ВладелецФайла);
	Если Не ДоступноИнтерактивноеИзменениеФайлов Тогда
		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Недоступно интерактивное изменение файлов, приложенных к ""%1 (%2)"".'"),
		ВладелецФайла,
		ТипЗнч(ВладелецФайла));
		Возврат РезультатПроверки;
	КонецЕсли;

	Если ТипЗнч(ВладелецФайла) <> Тип("СправочникСсылка.ДокументыПредприятия")
		И ТипЗнч(ВладелецФайла) <> Тип("ДокументСсылка.ИсходящееПисьмо") Тогда
		Возврат РезультатПроверки;
	КонецЕсли;

	ДанныеПроверки = ОбщегоНазначенияДокументооборотВызовСервера.ПроверкаДобавленияФайлов(
	ВладелецФайла,
	РольФайла);

	РезультатПроверки.ДанныеПроверки = ДанныеПроверки;

	Если Не ДанныеПроверки.ДоступноИзменение Тогда
		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = НСтр("ru = 'Недоступно изменение владельца файлов.'");
		Возврат РезультатПроверки;
	КонецЕсли;

	МожноДобавитьТолькоОдинФайл = Ложь;

	Если (ЗначениеЗаполнено(ДанныеПроверки.РегистрационныйНомер) 
		Или ДанныеПроверки.СостояниеОбработки = ПредопределенноеЗначение("Перечисление.СостоянияОбработкиОбъектов.Выполняется"))
		И ДанныеПроверки.РолиФайлов.Количество() <> 0
		И ДанныеПроверки.ИспользоватьРолиФайлов Тогда

		Если ДанныеПроверки.ВВидеЭтаРольТолькоОдинФайл
			И Не ДанныеПроверки.НетФайловВРоли Тогда

			РезультатПроверки.Отказ = Истина;
			РезультатПроверки.ТекстПредупреждения =
			СтрШаблон(
			НСтр("ru = 'В роли ""%1"" с признаком ""Только один файл"" уже есть файл, поэтому добавить еще один файл в эту роль нельзя.' "),
			РольФайла);

			Возврат РезультатПроверки;

		ИначеЕсли ДанныеПроверки.ВВидеЭтаРольТолькоОдинФайл
			И ДанныеПроверки.НетФайловВРоли Тогда

			МожноДобавитьТолькоОдинФайл = Истина;	

		КонецЕсли;

	КонецЕсли;

	Если Не ДанныеПроверки.ДоступноСоздатьФайлОбычный
		И Не ДанныеПроверки.ДоступноСоздатьФайлОригинал Тогда

		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'В текущем состоянии ""%1"" файлы добавлять нельзя.'"),
		ДанныеПроверки.СостояниеТекст);

		Возврат РезультатПроверки;

#Удаление
	ИначеЕсли ДанныеПроверки.ВестиУчетСканКопийОригиналовДокументов 
#КонецУдаления
#Вставка
	ИначеЕсли Не ДанныеПроверки.ДоступноСоздатьФайлОбычный
			И Не ДанныеПроверки.ДоступноСоздатьФайлОригинал 
			И Не ОбщегоНазначенияДокументооборотВызовСервера.ЭтоПолноправныйПользователь() Тогда
			
			РезультатПроверки.Отказ = Истина;
			РезультатПроверки.ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'В текущем состоянии ""%1"" файлы добавлять нельзя.'"),
			ДанныеПроверки.СостояниеТекст);
			
			Возврат РезультатПроверки;
			
	ИначеЕсли ДанныеПроверки.ВестиУчетСканКопийОригиналовДокументов
#КонецВставки
		И ДанныеПроверки.ДоступноСоздатьФайлОригинал
		И Не ДанныеПроверки.ДоступноСоздатьФайлОбычный Тогда

		Текст = СтрШаблон(
		НСтр("ru = 'В текущем состоянии ""%1"" можно добавить только скан-копию оригинала документа. Продолжить?'"),
		ДанныеПроверки.СостояниеТекст);

		СписокВариантовОтветов = Новый СписокЗначений;
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Да));
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Нет));

		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Форма", Форма);
		ПараметрыОбработчика.Вставить("ВладелецФайла", ВладелецФайла);
		ПараметрыОбработчика.Вставить("РольФайла", РольФайла);
		ПараметрыОбработчика.Вставить("ДанныеПроверки", ДанныеПроверки);
		ПараметрыОбработчика.Вставить("МожноДобавитьТолькоОдинФайл", МожноДобавитьТолькоОдинФайл);
		ПараметрыОбработчика.Вставить("ВставитьКартинкуИзБуфера", ВставитьКартинкуИзБуфера);

		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПроверкаДобавленияФайловДобавлениеОригинала",
		ЭтотОбъект,
		ПараметрыОбработчика);

		ДелопроизводствоКлиент.ПоказатьРасширеннуюФормуВопроса(
		Форма,
		НСтр("ru = 'Добавление файла'"),
		Текст,
		"ДобавлениеОригинала",
		"ЗадаватьВопросПриДобавленииСканКопииОригинала",
		СписокВариантовОтветов,,
		ОписаниеОповещения);

		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.ТекстПредупреждения = "";

		Возврат РезультатПроверки;

	КонецЕсли;

	РезультатПроверки.Вставить("МожноДобавитьТолькоОдинФайл", МожноДобавитьТолькоОдинФайл);
	РезультатПроверки.Вставить("ШаблонаДокумента", ДанныеПроверки.ШаблонаДокумента);

	Возврат РезультатПроверки;

КонецФункции
