#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьВопросы(ПараметрКоманды) Тогда
		РаботаСВопросамиКлиент.ПоказатьВопросы(ПараметрКоманды);
	Иначе
		РаботаСВопросамиКлиент.СоздатьВопрос(ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьВопросы(Знач Задача)
	
	ПредметРассмотрения = РаботаСВопросами.ПредметРассмотрения(Задача);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РешениеВопросовВыполненияЗадач.Ссылка) КАК Количество
		|ИЗ
		|	БизнесПроцесс.РешениеВопросовВыполненияЗадач КАК РешениеВопросовВыполненияЗадач
		|ГДЕ
		|	РешениеВопросовВыполненияЗадач.ПредметРассмотрения = &ПредметРассмотрения
		|	И РешениеВопросовВыполненияЗадач.ПометкаУдаления = ЛОЖЬ
		|	И РешениеВопросовВыполненияЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.Активен)");
	
	Запрос.УстановитьПараметр("ПредметРассмотрения", ПредметРассмотрения);
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьВопросы = ?(Выборка.Следующий(), Выборка.Количество, 0);
	
	Возврат ЕстьВопросы;
	
КонецФункции

#КонецОбласти