#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьКлючНазначенияИспользования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьКлючНазначенияИспользования()
	
	Если КлючНазначенияИспользования = "УдаленныеЗадачи" Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Удаленные задачи'");
		Элементы.ДатаУдаления.Видимость = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ПометкаУдаления",
			Истина);
		
		Если Не ПользователиСерверПовтИсп.ЭтоПолноправныйПользовательИБ() Тогда
			ДоступныеАвторы =
				РаботаСЗадачами.ИсполнителиЗадач(
					ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Пользователи.ТекущийПользователь()),
					Истина,
					Ложь); 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список,
				"Автор",
				ДоступныеАвторы);
		КонецЕсли;
		
		// Порядок.
		Порядок = Список.КомпоновщикНастроек.Настройки.Порядок;
		Порядок.ИдентификаторПользовательскойНастройки = "ОсновнойПорядок";
		
		Порядок.Элементы.Очистить();
		
		ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаУдаления");
		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
		ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементПорядка.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти