// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция ВсеОбращения() Экспорт
	
	Возврат "ВсеОбращения";
	
КонецФункции

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция НеВыгружались() Экспорт
	
	Возврат "НеВыгружались";
	
КонецФункции

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция ГотовыеКВыгрузке() Экспорт
	
	Возврат "ОтмеченныеГотовымиКВыгрузке";
	
КонецФункции

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция НеГотовыеКВыгрузке() Экспорт
	
	Возврат "НеОтмеченныеГотовымиКВыгрузке";
	
КонецФункции

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция СозданаВыгрузка() Экспорт
	
	Возврат "СозданаВыгрузка";
	
КонецФункции

// Константа, отвечающая за состояние выгрузки в ССТУ документов
// 
// Возвращаемое значение:
//  Строка -
Функция Выгруженные() Экспорт
	
	Возврат "Выгруженные";
	
КонецФункции

// Константа для "ключа назначения использования" для формы списка.
// 
// Возвращаемое значение:
//  Строка -
Функция КлючСписокОбращенийГраждан() Экспорт
	
	Возврат "СписокОбращенийГраждан";
	
КонецФункции

// Результат рассмотрения, который требует ответного документа на входящее обращение.
// 
// Параметры:
//  РезультатРассмотрения - ПеречислениеСсылка.РезультатыРассмотренияОбращений -
// 
// Возвращаемое значение:
//  Булево - Результат рассмотрения требует ответа
Функция РезультатРассмотренияТребуетОтвета(РезультатРассмотрения) Экспорт
	
	Возврат РезультатРассмотрения = ПредопределенноеЗначение(
			"Перечисление.РезультатыРассмотренияОбращений.ВТомЧислеМерыПриняты")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.НеПоддержано")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Поддержано")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Разъяснено");
	
КонецФункции

#КонецОбласти
