
&НаКлиенте
Процедура ЦППК_ЭтапУчастник_ПредставлениеОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) //+ЦППК САНФ-023288 31.01.2024
	
	//++AxelSoft Шарапова 10.05.2025 САНФ-033681	
	Если Объект.УчастникиПроцесса.Количество() = 1 Тогда
		
		ТекущиеДанные = Элементы.УчастникиПроцесса.ТекущиеДанные;
		
		ТипыПредметов = Новый Массив;
		ТипыПредметов.Добавить(Тип("СправочникСсылка.ДокументыПредприятия"));
		
		ОбрабатываемыеПредметы = МультипредметностьКлиентСервер.ПолучитьМассивПредметовОбъекта(Объект, ТипыПредметов, Истина);
		
		СрокИсполнения = ЦППК_ОбщийМодульВызовСервера.ЗаполнитьСрокИсполнения(ОбрабатываемыеПредметы, Объект.ГлавнаяЗадача);
		
		ЦППК_ОбщийМодульКлиентСервер.ЗаполнитьСтрокуСрокИсполнения(ТекущиеДанные, СрокИсполнения, Объект.Дата);
				
	КонецЕсли;
 	//--AxelSoft Шарапова 10.05.2025 САНФ-033681	

КонецПроцедуры //-ЦППК 31.01.2024

