////////////////////////////////////////////////////////////////////////////////
// Физические лица (вызов сервера)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет поиск подобных физических лиц по полному имени.
// В результат включаются подобные физ. лица по фамилии, по фалимии и имени, по ФИО.
//
// Параметры:
//  ПолноеИмя - Строка
//
// Возвращаемое значение:
//  Массив
//   * СправочникСсылка.ФизическиеЛица
//
Функция ФизическиеЛицаПоПолномуИмени(ПолноеИмя) Экспорт
	
	Возврат Справочники.ФизическиеЛица.ФизическиеЛицаПоПолномуИмени(ПолноеИмя);
	
КонецФункции

#КонецОбласти