#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет виды действий по виду задачи.
//
// Параметры:
//  ВидЗадачи - СправочникСсылка.ВидыЗадач.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВидыДействий - Виды действий по виду задачи.
//
Функция ВидыДействий(ВидЗадачи) Экспорт
	
	ВидыДействий = Новый Массив;
	Если Не ЗначениеЗаполнено(ВидЗадачи) Тогда
		Возврат ВидыДействий;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыЗадачВидыДействий.ВидДействия КАК ВидДействия
		|ИЗ
		|	Справочник.ВидыЗадач.ВидыДействий КАК ВидыЗадачВидыДействий
		|ГДЕ
		|	ВидыЗадачВидыДействий.Ссылка = &ВидЗадачи");
	
	Запрос.УстановитьПараметр("ВидЗадачи", ВидЗадачи);
	
	ВидыДействий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидДействия");
	
	Возврат ВидыДействий;
	
КонецФункции

// Формирует данные вида задачи.
// 
// Параметры:
//  ВидЗадачи - СправочникСсылка.ВидыЗадач.
// 
// Возвращаемое значение:
//  Структура - Данные вида задачи:
//   * ВидДействияИсполнителя - СправочникСсылка.ВидыДействийЗадач.
//   * ВидДействияПроверяющего - СправочникСсылка.ВидыДействийЗадач.
//   * ВидУчастникаОтветственный - СправочникСсылка.ВидыУчастниковЗадач.
//   * ВидУчастникаИсполнитель - СправочникСсылка.ВидыУчастниковЗадач.
//   * ВидУчастникаПроверяющий - СправочникСсылка.ВидыУчастниковЗадач.
//   * ЗаголовокКомандыПодобратьИсполнителей - Строка.
//   * ЗаголовокСпискаВыбранныхУчастников - Строка.
//   * ЗаголовокФормыВыбораИсполнителей - Строка.
//   * ЗакрыватьПодзадачи - Булево.
//   * РезультатЗадачиИсполнено - СправочникСсылка.РезультатыЗадач.
//   * РезультатЗадачиИсполненоОтрицательно - СправочникСсылка.РезультатыЗадач.
//   * РезультатЗадачиИсполненоСЗамечаниями - СправочникСсылка.РезультатыЗадач.
//   * РезультатИсполнителяВыполнена - СправочникСсылка.РезультатыДействийЗадач.
//   * РезультатИсполнителяВыполненаОтрицательно - СправочникСсылка.РезультатыДействийЗадач.
//   * РезультатИсполнителяВыполненаСЗамечаниями - СправочникСсылка.РезультатыДействийЗадач.
//   * РезультатПроверяющегоВозвращеноНаДоработку - СправочникСсылка.РезультатыДействийЗадач.
//   * РезультатПроверяющегоПроверено - СправочникСсылка.РезультатыДействийЗадач.
//   * СостояниеЗадачиВРаботе - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиЗакрыта - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиЗакрытаОтрицательно - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиЗакрытаСЗамечаниями - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиНаПроверке - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиНовая - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиОтложена - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиОтменена - СправочникСсылка.СостоянияЗадач.
//   * СостояниеЗадачиЧерновик - СправочникСсылка.СостоянияЗадач.
//   * СостояниеУчастниковВозвращеноНаДоработку - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковВРаботе - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковВыполнена - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковВыполненаСЗамечаниями - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковВыполненаОтрицательно - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковНаПроверке - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковНовая - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковОжидаетПроверки - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковОжидаетПроверкиОтрицательно - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковОжидаетПроверкиСЗамечаниями - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковОтменена - СправочникСсылка.СостоянияУчастниковЗадач.
//   * СостояниеУчастниковПроверено - СправочникСсылка.СостоянияУчастниковЗадач.
//   * ТерминНаправилНаИсполнениеЖенский - Строка.
//   * ТерминНаправилНаИсполнениеМужской - Строка.
//   * ТерминНаправитьНаИсполнение - Строка.
//   * ТерминНаправленаНаИсполнение - Строка.
//   * ТерминНеНаправленаНаИсполнение - Строка.
//   * ШаблонЗаголовка - Строка.
//  
Функция ДанныеВидаЗадачи(ВидЗадачи) Экспорт
	
	ДанныеВидаЗадачи = Новый Структура;
	ДанныеВидаЗадачи.Вставить(
		"ВидДействияИсполнителя",
		Справочники.ВидыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ВидДействияПроверяющего",
		Справочники.ВидыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ВидУчастникаОтветственный",
		Справочники.ВидыУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ВидУчастникаИсполнитель",
		Справочники.ВидыУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ВидУчастникаПроверяющий",
		Справочники.ВидыУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ЗаголовокКомандыПодобратьИсполнителей",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ЗаголовокСпискаВыбранныхУчастников",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ЗаголовокФормыВыбораИсполнителей",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ЗакрыватьПодзадачи",
		Ложь);
	ДанныеВидаЗадачи.Вставить(
		"РезультатЗадачиИсполнено",
		Справочники.РезультатыЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатЗадачиИсполненоОтрицательно",
		Справочники.РезультатыЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатЗадачиИсполненоСЗамечаниями",
		Справочники.РезультатыЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатИсполнителяВыполнена",
		Справочники.РезультатыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатИсполнителяВыполненаСЗамечаниями",
		Справочники.РезультатыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатИсполнителяВыполненаОтрицательно",
		Справочники.РезультатыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатПроверяющегоВозвращеноНаДоработку",
		Справочники.РезультатыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"РезультатПроверяющегоПроверено",
		Справочники.РезультатыДействийЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиВРаботе",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиЗакрыта",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиЗакрытаОтрицательно",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиЗакрытаСЗамечаниями",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиНаПроверке",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиНовая",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиОтложена",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиОтменена",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеЗадачиЧерновик",
		Справочники.СостоянияЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковВозвращеноНаДоработку",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковВРаботе",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковВыполнена",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковВыполненаСЗамечаниями",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковВыполненаОтрицательно",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковНаПроверке",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковНовая",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковОжидаетПроверки",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковОжидаетПроверкиОтрицательно",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковОжидаетПроверкиСЗамечаниями",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковОтменена",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"СостояниеУчастниковПроверено",
		Справочники.СостоянияУчастниковЗадач.ПустаяСсылка());
	ДанныеВидаЗадачи.Вставить(
		"ТерминНаправилНаИсполнениеЖенский",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ТерминНаправилНаИсполнениеМужской",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ТерминНаправитьНаИсполнение",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ТерминНаправленаНаИсполнение",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ТерминНеНаправленаНаИсполнение",
		"");
	ДанныеВидаЗадачи.Вставить(
		"ШаблонЗаголовка",
		"");
	
	Если Не ЗначениеЗаполнено(ВидЗадачи) Тогда
		Возврат ДанныеВидаЗадачи;
	КонецЕсли;
	
	КодЯзыка = Неопределено;
	КонфигурацияИспользуетТолькоОдинЯзык = МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(Ложь);
	Если Не КонфигурацияИспользуетТолькоОдинЯзык И Не МультиязычностьСервер.ЭтоОсновнойЯзык() Тогда
		КодЯзыка = ТекущийЯзык().КодЯзыка;
	КонецЕсли;	
		
	ДанныеВидаЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ВидЗадачи,
		"ВидДействияИсполнителя, ВидДействияПроверяющего,
		|ВидУчастникаОтветственный, ВидУчастникаИсполнитель, ВидУчастникаПроверяющий,
		|ЗаголовокКомандыПодобратьИсполнителей, ЗаголовокСпискаВыбранныхУчастников, ЗаголовокФормыВыбораИсполнителей,
		|ЗакрыватьПодзадачи,
		|РезультатЗадачиИсполнено, РезультатЗадачиИсполненоОтрицательно, РезультатЗадачиИсполненоСЗамечаниями,
		|РезультатИсполнителяВыполнена, РезультатПроверяющегоВозвращеноНаДоработку, РезультатПроверяющегоПроверено,
		|РезультатИсполнителяВыполненаСЗамечаниями, РезультатИсполнителяВыполненаОтрицательно,
		|СостояниеЗадачиВРаботе, СостояниеЗадачиЗакрыта, СостояниеЗадачиНаПроверке,
		|СостояниеЗадачиЗакрытаОтрицательно, СостояниеЗадачиЗакрытаСЗамечаниями,
		|СостояниеЗадачиНовая, СостояниеЗадачиОтложена,
		|СостояниеЗадачиОтменена, СостояниеЗадачиЧерновик,
		|СостояниеУчастниковВозвращеноНаДоработку, СостояниеУчастниковВРаботе,
		|СостояниеУчастниковВыполнена, СостояниеУчастниковНаПроверке,
		|СостояниеУчастниковВыполненаСЗамечаниями, СостояниеУчастниковВыполненаОтрицательно,
		|СостояниеУчастниковНовая, СостояниеУчастниковОжидаетПроверки,
		|СостояниеУчастниковОжидаетПроверкиОтрицательно, СостояниеУчастниковОжидаетПроверкиСЗамечаниями,
		|СостояниеУчастниковОтменена, СостояниеУчастниковПроверено,
		|ТерминНаправилНаИсполнениеЖенский, ТерминНаправилНаИсполнениеМужской,
		|ТерминНаправитьНаИсполнение, ТерминНаправленаНаИсполнение, ТерминНеНаправленаНаИсполнение,
		|ШаблонЗаголовка", , КодЯзыка); 
		
	Возврат ДанныеВидаЗадачи;
	
КонецФункции

// Определяет по виду участника вид участника обрабатывающего результат.
//
// Параметры:
//  ВидЗадачи - СправочникСсылка.ВидыЗадач - Вид задачи.
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыУчастниковЗадач - Вид участника, обрабатывающего результат.
//
Функция ОбрабатывающийРезультат(ВидЗадачи) Экспорт
	
	ДанныеВидаЗадачи = ДанныеВидаЗадачи(ВидЗадачи);
	
	Возврат ДанныеВидаЗадачи.ВидУчастникаПроверяющий;
	
КонецФункции

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	// Вопрос.
	ВидЗадачиОбъект = Вопрос.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Вопрос'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать рассматривающих вопрос'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор рассматривающих вопрос'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные рассматривающие вопрос'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Рассмотрено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Рассмотрено;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.ЗакрытВопрос;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Закрыта;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Рассмотрено;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиРассмотрено;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Отправила вопрос'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Отправил вопрос'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Отправить вопрос'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Вопрос отправлен'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Вопрос не отправлен. Сохранить вопрос?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = "";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.РассматривающийВопрос;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОтКого;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.РассмотретьВопрос;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.РешениеВопросов;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.РассмотретьВопрос;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Поручение.
	ВидЗадачиОбъект = Поручение.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Поручение'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать исполнителей'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор исполнителей'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные исполнители'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Истина;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Исполнено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Выполнена;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ВозвращеноНаДоработку;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Проверено;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.ВРаботе;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Закрыта;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаПроверке;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ВозвращеноНаДоработку;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.ВРаботе;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Выполнена;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаПроверке;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетПроверки;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Проверено;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на исполнение'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на исполнение'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на исполнение'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на исполнение'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на исполнение. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = "";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.Ответственный;
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Исполнитель;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.Проверяющий;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Исполнить;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.Проверить;
	ВидЗадачиОбъект.ДоступенДляВыбора = Истина;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Исполнение;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Исполнить;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Проверить;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Запрос на перенос срока.
	ВидЗадачиОбъект = ЗапросНаПереносСрока.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Запрос на перенос срока'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать рассматривающих запрос'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор рассматривающих запрос'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные рассматривающие запрос'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Рассмотрено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.ПеренесенСрок;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ОтказаноВПереносеСрока;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.ЗакрытЗапрос;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Закрыта;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.Закрыта;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.ПеренесенСрок;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ОтказаноВПереносеСрока;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиПеренесенСрок;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиОтказаноВПереносеСрока;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Отправила запрос'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Отправил запрос'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить запрос'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Запрос отправлен'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Запрос не отправлен. Сохранить запрос?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = "";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.РассматривающийЗапрос;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОтКого;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.РассмотретьЗапрос;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.РешениеВопросов;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.РассмотретьЗапрос;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Исполнение.
	ВидЗадачиОбъект = Исполнение.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Исполнение'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать исполнителей'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор исполнителей'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные исполнители'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Исполнено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Выполнена;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ВозвращеноНаДоработку;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Проверено;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаИсполнении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Исполнено;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаПроверке;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ВозвращеноНаДоработку;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.ВРаботе;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Выполнена;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаПроверке;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетПроверки;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Проверено;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на исполнение'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на исполнение'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на исполнение'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на исполнение'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на исполнение. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = "";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.Ответственный;
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Исполнитель;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.Проверяющий;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Исполнить;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.Проверить;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Исполнение;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Исполнить;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Проверить;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Подписание.
	ВидЗадачиОбъект = Подписание.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Подписание'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать подписывающих'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор подписывающих'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные подписывающие'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Подписано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.НеПодписано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Подписано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.НеПодписано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Завершил;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаПодписании;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Подписано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.НеПодписано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаПодписании;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Подписано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.НеПодписано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиПодписано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиНеПодписано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Завершил;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на подписание'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на подписание'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на подписание'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на подписание'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на подписание. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Подписать'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Подписывающий;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Подписать;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Подписание;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Подписать;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбеспечитьПодписание;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Ознакомление.
	ВидЗадачиОбъект = Ознакомление.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Ознакомление'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать ознакомляемых'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор ознакомляемых'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные ознакомляемые'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Ознакомлены;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Ознакомился;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаОзнакомлении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Ознакомлены;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Завершил;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на ознакомление'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на ознакомление'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на ознакомление'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на ознакомление'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на ознакомление. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Ознакомиться'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Ознакомляемый;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Ознакомиться;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ДоступенДляВыбора = Истина;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Ознакомление;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Ознакомиться;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Приглашение.
	ВидЗадачиОбъект = Приглашение.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Приглашение'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать приглашенных'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор приглашенных'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные приглашенные'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.ПодтвержденоПриглашение;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ОтмененоПриглашение;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.ПринятоПриглашение;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ОтклоненоПриглашение;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.ПодтвержденоПриглашение;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Принято;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.Отклонено;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Принято;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.Отклонено;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиПринято;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиОтклонено;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.ПодтвержденоПриглашение;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Отправила приглашение'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Отправил приглашение'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Отправить приглашение'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Приглашение отправлено'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Приглашение не отправлено. Сохранить приглашение?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = "";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Приглашенный;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.ПринятьПриглашение;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Приглашение;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ПринятьПриглашение;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Рассмотрение.
	ВидЗадачиОбъект = Рассмотрение.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Рассмотрение'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать рассматривающих'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор рассматривающих'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные рассматривающие'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Рассмотрено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Рассмотрено;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.ОбработанаРезолюция;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Рассмотрено;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезолюции;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Рассмотрено;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезолюции;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.ОбработанаРезолюция;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на рассмотрение'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на рассмотрение'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на рассмотрение'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на рассмотрение'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на рассмотрение. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Рассмотреть'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезолюцию;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Рассмотреть;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезолюцию;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Рассмотрение;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Рассмотреть;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезолюцию;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Регистрация.
	ВидЗадачиОбъект = Регистрация.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Регистрация'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать регистраторов'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор регистраторов'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные регистраторы'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Зарегистрировано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.НеЗарегистрировано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Зарегистрировано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.НеЗарегистрировано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Завершил;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаРегистрации;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Зарегистрировано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.НеЗарегистрировано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаРегистрации;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Зарегистрировано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.НеЗарегистрировано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиЗарегистрировано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиНеЗарегистрировано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Завершил;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на регистрацию'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на регистрацию'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на регистрацию'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на регистрацию'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на регистрацию. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Зарегистрировать'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Регистратор;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Зарегистрировать;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Регистрация;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Зарегистрировать;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Согласование.
	ВидЗадачиОбъект = Согласование.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Согласование'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать согласующих'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор согласующих'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные согласующие'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Истина;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Согласовано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.НеСогласовано;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.СогласованоСЗамечаниями;
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Согласовано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.НеСогласовано;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями;
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Завершил;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаСогласовании;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Согласовано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.НеСогласовано;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.СогласованоСЗамечаниями;
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаСогласовании;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Согласовано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.НеСогласовано;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.СогласованоСЗамечаниями;
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиСогласовано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиНеСогласовано;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиСогласованоСЗамечаниями;
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Завершил;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на согласование'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на согласование'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на согласование'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на согласование'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на согласование. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Согласовать'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Согласующий;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Согласовать;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Согласование;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Согласовать;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
	// Утверждение.
	ВидЗадачиОбъект = Утверждение.ПолучитьОбъект();
	ВидЗадачиОбъект.Наименование = НСтр("ru = 'Утверждение'");
	ВидЗадачиОбъект.ЗаголовокКомандыПодобратьИсполнителей = НСтр("ru = 'Подобрать утверждающих'");
	ВидЗадачиОбъект.ЗаголовокФормыВыбораИсполнителей = НСтр("ru = 'Подбор утверждающих'");
	ВидЗадачиОбъект.ЗаголовокСпискаВыбранныхУчастников = НСтр("ru = 'Выбранные утверждающие'");
	ВидЗадачиОбъект.ЗакрыватьПодзадачи = Ложь;
	ВидЗадачиОбъект.РезультатЗадачиИсполнено = Справочники.РезультатыЗадач.Утверждено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоОтрицательно = Справочники.РезультатыЗадач.НеУтверждено;
	ВидЗадачиОбъект.РезультатЗадачиИсполненоСЗамечаниями = Справочники.РезультатыЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатИсполнителяВыполнена = Справочники.РезультатыДействийЗадач.Утверждено;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаОтрицательно = Справочники.РезультатыДействийЗадач.НеУтверждено;
	ВидЗадачиОбъект.РезультатИсполнителяВыполненаСЗамечаниями = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.РезультатПроверяющегоВозвращеноНаДоработку = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.РезультатПроверяющегоПроверено = Справочники.РезультатыДействийЗадач.Завершил;
	ВидЗадачиОбъект.СостояниеЗадачиВРаботе = Справочники.СостоянияЗадач.НаУтверждении;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрыта = Справочники.СостоянияЗадач.Утверждено;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаОтрицательно = Справочники.СостоянияЗадач.НеУтверждено;
	ВидЗадачиОбъект.СостояниеЗадачиЗакрытаСЗамечаниями = Справочники.СостоянияЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеЗадачиНаПроверке = Справочники.СостоянияЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеЗадачиНовая = Справочники.СостоянияЗадач.Новая;
	ВидЗадачиОбъект.СостояниеЗадачиОтложена = Справочники.СостоянияЗадач.Отложена;
	ВидЗадачиОбъект.СостояниеЗадачиОтменена = Справочники.СостоянияЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеЗадачиЧерновик = Справочники.СостоянияЗадач.Черновик;
	ВидЗадачиОбъект.СостояниеУчастниковВозвращеноНаДоработку = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	ВидЗадачиОбъект.СостояниеУчастниковВРаботе = Справочники.СостоянияУчастниковЗадач.НаУтверждении;
	ВидЗадачиОбъект.СостояниеУчастниковВыполнена = Справочники.СостоянияУчастниковЗадач.Утверждено;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаОтрицательно = Справочники.СостоянияУчастниковЗадач.НеУтверждено;
	ВидЗадачиОбъект.СостояниеУчастниковВыполненаСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковНаПроверке = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	ВидЗадачиОбъект.СостояниеУчастниковНовая = Справочники.СостоянияУчастниковЗадач.Новая;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверки = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиУтверждено;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиОтрицательно = Справочники.СостоянияУчастниковЗадач.ОжидаетОбработкиНеУтверждено;
	ВидЗадачиОбъект.СостояниеУчастниковОжидаетПроверкиСЗамечаниями = Справочники.СостоянияУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.СостояниеУчастниковОтменена = Справочники.СостоянияУчастниковЗадач.Отменена;
	ВидЗадачиОбъект.СостояниеУчастниковПроверено = Справочники.СостоянияУчастниковЗадач.Завершил;
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеЖенский = НСтр("ru = 'Направила на утверждение'");
	ВидЗадачиОбъект.ТерминНаправилНаИсполнениеМужской = НСтр("ru = 'Направил на утверждение'");
	ВидЗадачиОбъект.ТерминНаправитьНаИсполнение = НСтр("ru = 'Направить на утверждение'");
	ВидЗадачиОбъект.ТерминНаправленаНаИсполнение = НСтр("ru = 'Направлена на утверждение'");
	ВидЗадачиОбъект.ТерминНеНаправленаНаИсполнение = НСтр("ru = 'Задача не направлена на утверждение. Сохранить задачу?'");
	ВидЗадачиОбъект.ШаблонЗаголовка = НСтр("ru = 'Утвердить'") + " ";
	ВидЗадачиОбъект.ВидУчастникаОтветственный = Справочники.ВидыУчастниковЗадач.ПустаяСсылка();
	ВидЗадачиОбъект.ВидУчастникаИсполнитель = Справочники.ВидыУчастниковЗадач.Утверждающий;
	ВидЗадачиОбъект.ВидУчастникаПроверяющий = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	ВидЗадачиОбъект.ВидДействияИсполнителя = Справочники.ВидыДействийЗадач.Утвердить;
	ВидЗадачиОбъект.ВидДействияПроверяющего = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачиОбъект.ДоступенДляВыбора = Ложь;
	ВидЗадачиОбъект.НаборСостояний = Справочники.НаборыСостоянийЗадач.Утверждение;
	
	ВидЗадачиОбъект.ВидыДействий.Очистить();
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.Утвердить;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	
	СтрокаДействия = ВидЗадачиОбъект.ВидыДействий.Добавить();
	СтрокаДействия.ВидДействия = Справочники.ВидыДействийЗадач.ОзнакомитьсяСРезультатом;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(ВидЗадачиОбъект);
	
КонецПроцедуры

// Возвращает отслеживаемые реквизиты для дополнительного свойства ПредыдущиеЗначенияРеквизитов.
//
// Возвращаемое значение:
//  Строка - Отслеживаемые реквизиты.
//
Функция ОтслеживаемыеРеквизиты() Экспорт
	
	ОтслеживаемыеРеквизиты = "Наименование";
	
	Возврат ОтслеживаемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЗадач КАК ВидыЗадач
	|ГДЕ
	|	НЕ ВидыЗадач.ПометкаУдаления
	|	И ВидыЗадач.Наименование ПОДОБНО &СтрокаПоиска
	|   И //Отбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЗадач.Наименование";
	
	ОбъектМетаданных = Метаданные.Справочники.ВидыЗадач;
	Если Не МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(ОбъектМетаданных.ТабличныеЧасти.Найти("Представления") = Неопределено) Тогда
		
		Если МультиязычностьСервер.ИспользуетсяПервыйДополнительныйЯзык() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"ВидыЗадач.Наименование ПОДОБНО &СтрокаПоиска",
				"(ВидыЗадач.Наименование ПОДОБНО &СтрокаПоиска ИЛИ ВидыЗадач.НаименованиеЯзык1 ПОДОБНО &СтрокаПоиска)");
		КонецЕсли;
		
	КонецЕсли;
	
	Отборы = Новый Массив;
	
	Если Параметры.Свойство("Отбор") Тогда
	
		Для Каждого Поле Из Параметры.Отбор Цикл
			
			Если ТипЗнч(Поле.Значение) = Тип("Массив")
				Или ТипЗнч(Поле.Значение) = Тип("ФиксированныйМассив") Тогда
				Отборы.Добавить(Поле.Ключ + " В (&" + Поле.Ключ + ")");
			Иначе
				Отборы.Добавить(Поле.Ключ + " = &" + Поле.Ключ);
			КонецЕсли;
			
			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Если Отборы.Количество() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Отбор", СтрСоединить(Отборы, "
			|	И "));
	Иначе	
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И //Отбор", "");
		
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли