
&ИзменениеИКонтроль("ПолучитьПараметрыНумерации")
Функция ЦППК_ПолучитьПараметрыНумерации(Объект, ОбработатьНаСервере = Ложь) Экспорт 
	
	Если ОбработатьНаСервере Тогда
		Возврат Нумерация.ПараметрыНумерации(Объект);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЧисловойНомер", Объект.ЧисловойНомер);
	СтруктураПараметров.Вставить("ДатаСоздания", Объект.ДатаСоздания);
	СтруктураПараметров.Вставить("ДатаРегистрации", Объект.ДатаРегистрации);
	СтруктураПараметров.Вставить("ВидДокумента", Объект.ВидДокумента);
	СтруктураПараметров.Вставить("Организация", Объект.Организация);
	СтруктураПараметров.Вставить("НоменклатураДел", Объект.НоменклатураДел);
	СтруктураПараметров.Вставить("ВопросДеятельности", Объект.ВопросДеятельности);
	СтруктураПараметров.Вставить("Подразделение", Объект.Подразделение);
	СтруктураПараметров.Вставить("Ответственный", Объект.Ответственный);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("Проект", Объект.Проект);
	СтруктураПараметров.Вставить("Тематика", Объект.Тематика);
	СтруктураПараметров.Вставить("ГрифДоступа", Объект.ГрифДоступа);
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
		ПараметрыСторон = РаботаСПодписямиДокументовКлиентСервер.ПараметрыРегистрации(Объект);
		СтруктураПараметров.Вставить("Контрагент", ПараметрыСторон.Контрагент);
		СтруктураПараметров.Вставить("Организация", ПараметрыСторон.Организация);
#Вставка
		// { *Грошев (ТТС) [29.06.2020]
		Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
			Если ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ВидДокумента, "ТТС_ЯвляетсяЖурналомТУ") Тогда
				СтруктураПараметров.Вставить("ТТС_Направление", Объект.ТТС_Направление);
			КонецЕсли;			
		КонецЕсли;

		// }
#КонецВставки

	КонецЕсли;
	
	СтруктураПараметров.Вставить("ТипДокумента",
		ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ДокументыПредприятия"));
	
	Возврат СтруктураПараметров;
	
КонецФункции
