// @strict-types


#Область ПрограммныйИнтерфейс

// Данные документов ЭДО по КОД.
// 
// Параметры:
//  ДокументыЭДО - Массив Из ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
//    * Значение - Структура:
//      ** ИдентификаторУзлаОбмена - УникальныйИдентификатор
//      ** ПредставлениеУзлаОбмена - Строка
//      ** ОбменВТекущемУзле - Булево
//
Функция ДанныеДокументовЭДОПоКОД(ДокументыЭДО) Экспорт
	
	Возврат ОбменСКонтрагентамиДОХолдинг.ДанныеДокументовЭДОПоКОД(ДокументыЭДО);
	
КонецФункции

#КонецОбласти
