
&НаСервере
Процедура ЦППК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Порядок = Разделы.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Разделы.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле                = Новый ПолеКомпоновкиДанных("Ссылка.ЦППК_РазрядПорядка");
	НовыйПорядок.ТипУпорядочивания   = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование       = Истина;
	
	
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле                = Новый ПолеКомпоновкиДанных("Ссылка.ЦППК_РазрядПорядка");
	НовыйПорядок.ТипУпорядочивания   = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование       = Истина;
	
КонецПроцедуры

&НаСервере
&После("УстановитьОтборСписка")
Процедура ЦППК_УстановитьОтборСписка(ПараметрыОтбора)
	
	Если ЗначениеЗаполнено(ПараметрыОтбора["Подразделение"]) Тогда 
		
		Элементы.Разделы.Отображение = ОтображениеТаблицы.Список;

	Иначе 
		
		Элементы.Разделы.Отображение = ОтображениеТаблицы.Дерево;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦППК_ПечатьСводнаяНоменклатураДелПосле(Команда)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Подразделение", ЭтаФорма.Подразделение);
	ПараметрыПечати.Вставить("Организация", ЭтаФорма.Организация);
	Если ЗначениеЗаполнено(ЭтаФорма.ПоказыватьДелаЗа) Тогда
		ПараметрыПечати.Вставить("Год", ЭтаФорма.ПоказыватьДелаЗа);
	Иначе
		ПараметрыПечати.Вставить("Год", Год(ТекущаяДата()));
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Справочник.НоменклатураДел",
		"СводнаяНоменклатураДел",
		ПредопределенноеЗначение("Справочник.НоменклатураДел.ПустаяСсылка"),
		ЭтаФорма,
		ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
&После("Подключаемый_ОбновитьКоманды")
Процедура ЦППК_Подключаемый_ОбновитьКоманды()
	Элементы.ПечатьСводнаяНоменклатураДел.Видимость = Истина;
КонецПроцедуры


	
