
&НаСервере
Процедура ЦППК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Порядок = Разделы.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Разделы.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле                = Новый ПолеКомпоновкиДанных("Ссылка.ЦППК_РазрядПорядка");
	НовыйПорядок.ТипУпорядочивания   = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование       = Истина;
	
	
	Порядок = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле                = Новый ПолеКомпоновкиДанных("Ссылка.ЦППК_РазрядПорядка");
	НовыйПорядок.ТипУпорядочивания   = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование       = Истина;
	
КонецПроцедуры

&НаСервере
&После("УстановитьОтборСписка")
Процедура ЦППК_УстановитьОтборСписка(ПараметрыОтбора)
	
	Если ЗначениеЗаполнено(ПараметрыОтбора["Подразделение"]) Тогда 
		
		Элементы.Разделы.Отображение = ОтображениеТаблицы.Список;

	Иначе 
		
		Элементы.Разделы.Отображение = ОтображениеТаблицы.Дерево;

	КонецЕсли;
	
КонецПроцедуры
