
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проверить(Команда)
	
	Если Не ЗначениеЗаполнено(ПроцессСсылка) Тогда
		Сообщить(НСтр("ru = 'Не заполнен процесс'"));
		Возврат;
	КонецЕсли;
	
	ПроверитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатТаблица

&НаКлиенте
Процедура РезультатТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьНаСервере()
	
	РезультатТаблица.Очистить();
	ПроцессОбъект = ПроцессСсылка.ПолучитьОбъект();
	
	РезультатВыполнения = ШаблоныБизнесПроцессов.ПолучитьЗначениеАвтоподстановки(
		Параметры.Автоподстановка, ПроцессОбъект, Истина);
	
	РезультатВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатВыполнения);
	Если ТипЗнч(РезультатВыполнения) = Тип("Массив") И РезультатВыполнения.Количество() > 0 Тогда
		РезультатВМассиве = РезультатВыполнения;
	КонецЕсли;
	
	Для Каждого Эл Из РезультатВМассиве Цикл
		Стр = РезультатТаблица.Добавить();
		Стр.Элемент = Эл;
		Стр.ТипЭлемента = ТипЗнч(Эл);
		Если ТипЗнч(Эл) = Тип("Массив") И Эл.Количество() = 0 Тогда
			Стр.Элемент = НСтр("ru = '<Пустой массив>'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
