////////////////////////////////////////////////////////////////////////////////
// Работа с уведомлениями (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подключает уведомления через внешнюю систему.
// 
// Параметры:
//  ИдентификаторОбсужденияСВ - ИдентификаторОбсужденияСистемыВзаимодействия.
//  ТипВнешнейСистемы - Строка.
//
Процедура ПодключитьУведомленияЧерезВнешнююСистему(Знач ИдентификаторОбсужденияСВ, Знач ТипВнешнейСистемы) Экспорт
	
	РаботаСУведомлениями.ПодключитьУведомленияЧерезВнешнююСистему(
		Пользователи.ТекущийПользователь(),
		ИдентификаторОбсужденияСВ,
		ТипВнешнейСистемы);
	
КонецПроцедуры

#КонецОбласти