#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Если ПометкаУдаления Тогда 
			
			// сотрем запись РС
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	НастройкиШаблоновИмени.ТипОбъекта КАК ТипОбъекта,
				|	НастройкиШаблоновИмени.Вид КАК Вид,
				|	НастройкиШаблоновИмени.РольФайла КАК РольФайла
				|ИЗ
				|	РегистрСведений.НастройкиШаблоновИмени КАК НастройкиШаблоновИмени
				|ГДЕ
				|	НастройкиШаблоновИмени.ШаблонИмени = &ШаблонИмени";
			
			Запрос.УстановитьПараметр("ШаблонИмени", Ссылка);
			Результат = Запрос.Выполнить();
			
			// все сотрем
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.НастройкиШаблоновИмени.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ТипОбъекта.Установить(Выборка.ТипОбъекта);
				НаборЗаписей.Отбор.Вид.Установить(Выборка.Вид);
				НаборЗаписей.Отбор.РольФайла.Установить(Выборка.РольФайла);
				НаборЗаписей.Записать();
				
			КонецЦикла;	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли