#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные о состоянии дела.
//
// Параметры:
//  Структура - Список типов - Текстовое описание параметра функции.
//   * ИмяСвойстваПараметра - Список типов - Текстовое описание свойства (колонки) параметра.
//
// Возвращаемое значение:
//  Структура - данные о состоянии дела.
//   * Состояние - ПеречислениеСсылка.СостоянияДелХраненияДокументов - состояние.
//   * ПредставлениеСостояния - Строка - строковое представление.
//   * ДатаСостояния - Дата - дата установки состояния.
//   * Регистратор - ДокументСсылка - регистратор текущего состояния.
//
Функция СостояниеДела(Дело) Экспорт
	
	ДанныеОСостоянии = Новый Структура;
	ДанныеОСостоянии.Вставить("Состояние", Неопределено);
	ДанныеОСостоянии.Вставить("ПредставлениеСостояния", "");
	ДанныеОСостоянии.Вставить("ДатаСостояния", Неопределено);
	ДанныеОСостоянии.Вставить("Регистратор", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияДелХраненияДокументов.Состояние КАК Состояние,
		|	СостоянияДелХраненияДокументов.Период КАК Период,
		|	СостоянияДелХраненияДокументов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СостоянияДелХраненияДокументов.СрезПоследних(, ДелоХраненияДокументов = &Дело) КАК СостоянияДелХраненияДокументов";
	Запрос.УстановитьПараметр("Дело", Дело);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеОСостоянии.Состояние = Выборка.Состояние;
		ДанныеОСостоянии.ДатаСостояния = Формат(Выборка.Период, "ДЛФ=D");
		ДанныеОСостоянии.Регистратор = Выборка.Регистратор;
		Если Выборка.Состояние = Перечисления.СостоянияДелХраненияДокументов.ПереданоВАрхив Тогда 
			ДанныеОСостоянии.ПредставлениеСостояния = НСтр("ru = 'Дело передано в архив'");
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияДелХраненияДокументов.Уничтожено Тогда 
			ДанныеОСостоянии.ПредставлениеСостояния = НСтр("ru = 'Дело уничтожено'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеОСостоянии;
	
КонецФункции

#КонецОбласти

#КонецЕсли
