
&ИзменениеИКонтроль("ЗаполнитьПоставляемыеДанные")
Процедура ЦППК_ЗаполнитьПоставляемыеДанные() Экспорт
	
	РезультатДействийЗадачОбъект = ВозвращеноНаДоработку.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Возвращено на доработку'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Вернуть на доработку'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Выполнена.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Выполнена'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Выполнена'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Завершил.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Завершил'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Завершить'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ЗакрытВопрос.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Закрыт вопрос'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Закрыть вопрос'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ЗакрытЗапрос.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Закрыт запрос'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Закрыть запрос'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Зарегистрировано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Зарегистрировано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Зарегистрировать'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НаправленоНаИсполнение.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Направлено на исполнение'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Направить на исполнение'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НаправленоНаОзнакомление.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Направлено на ознакомление'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Направить на ознакомление'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НаправленоПомощнику.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Направлено помощнику'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Направить помощнику'");
#Вставка
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Направлено автору'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Направить автору'");
#КонецВставки
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НаправленоАвтору.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Направлено автору'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Направить автору'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
		
	РезультатДействийЗадачОбъект = НеЗарегистрировано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Не зарегистрировано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Не регистрировать'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НеПодписано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Не подписано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Не подписано'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ОтклоненоПриглашение.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Отклонено приглашение'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Отклонить'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НеСогласовано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Не согласовано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Не согласовано'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = НеУтверждено.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Не утверждено'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Не утверждено'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ОбработанаРезолюция.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Обработана резолюция'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Обработано'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Ознакомился.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Ознакомился'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Ознакомился'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ОтказаноВПереносеСрока.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Отказано в переносе'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Отказать в переносе'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ОтмененоПриглашение.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Отменено приглашение'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Отменить'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Отрицательный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ОтправленоПовторно.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Отправлено повторно'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Повторить'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ПеренесенСрок.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Перенесен срок'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Перенести срок'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ПодтвержденоПриглашение.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Подтверждено приглашение'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Подтвердить'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = ПринятоПриглашение.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Принято приглашение'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Принять'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Подписано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Подписано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Подписано'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Проверено.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Проверено'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Проверено'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Рассмотрено.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Рассмотрено'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Рассмотрено'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Нейтральный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Согласовано.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Согласовано'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Согласовано'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = СогласованоСЗамечаниями.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Согласовано с замечаниями'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Согласовано с замечаниями'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.ПоложительныйСЗамечаниями;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
	РезультатДействийЗадачОбъект = Утверждено.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Утверждено'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Истина;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Утверждено'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.Положительный;
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(РезультатДействийЗадачОбъект);
	
КонецПроцедуры
