
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	//Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПодчиненныеПодразделения"));
	//Если Параметр <> Неопределено
	//	И Параметр.Использование = Истина Тогда
	//	
	//	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//	
	//	Руководители = Справочники.ДелегированиеПрав.СписокДелегирующих(ТекущийПользователь);
	//	Руководители.Добавить(ТекущийПользователь);
	//	
	//	Параметр.Значение = 
	//		Справочники.СтруктураПредприятия.ПодчиненныеПодразделения(Руководители);
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти