#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПараметрыСеанса.ЭтоУдалениеПомеченных Тогда
		Возврат;
	КонецЕсли; 
	
	Если Количество() = 0
		И ЗначениеЗаполнено(Отбор.ТипСвязи.Значение) Тогда
		
		ПротоколированиеРаботыСотрудников.ЗаписатьИзменение(Отбор.ТипСвязи.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли