#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Делает запись об изменившейся насторойке для текущего пользователя
//
Процедура ДобавитьЗапись(Пользователь, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиИзмененныхНастроек = 
		РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИзмененныхНастроек.Пользователь = Пользователь;
	МенеджерЗаписиИзмененныхНастроек.Настройка = Настройка;
	МенеджерЗаписиИзмененныхНастроек.ОтметкаВремени = ОтметкиВремени.Текущая();
	МенеджерЗаписиИзмененныхНастроек.Записать();
	
КонецПроцедуры

#КонецЕсли
