
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцессыКПрерыванию.ЗагрузитьЗначения(Параметры.ПроцессыКПрерыванию);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПроцессыКПрерыванию

&НаКлиенте
Процедура ПроцессыКПрерываниюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = ПроцессыКПрерыванию.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТаблицы.Значение);

КонецПроцедуры

#КонецОбласти
