#Область ПрограммныйИнтерфейс

// Записывает шаблоны для ручного создания в РС
//
// Параметры:
//  Получатель				 - СправочникСсылка.Организации
//  Отправитель				 - СправочникСсылка.Контрагенты
//  ИдентификаторПолучателя	 - Строка
//  ИдентификаторОтправителя - Строка
//  ВидДокумента			 - СправочникСсылка.ВидыДокументовЭДО
//  Шаблоны					 - ТаблицаЗначений - поля:
//   * ШаблонДокумента - СправочникСсылка.ШаблоныДокументов
//   * ТематикаДокумента - СправочникСсылка.ТематикиДокументов
//
Процедура ЗаписатьШаблоныДляСозданияДокументовПоВходящимЭДО(Получатель, Отправитель, ИдентификаторПолучателя, 
	ИдентификаторОтправителя, ВидДокумента, Шаблоны) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Получатель.Установить(Получатель);
	НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
	НаборЗаписей.Отбор.ИдентификаторПолучателя.Установить(ИдентификаторПолучателя);
	НаборЗаписей.Отбор.ИдентификаторОтправителя.Установить(ИдентификаторОтправителя);
	НаборЗаписей.Отбор.ВидЭДО.Установить(ВидДокумента);
	
	Для Каждого СтрокаШаблон Из Шаблоны Цикл
		
		ЗаписьШаблон = НаборЗаписей.Добавить();
		ЗаписьШаблон.ВидЭДО = ВидДокумента;
		ЗаписьШаблон.Получатель = Получатель;
		ЗаписьШаблон.Отправитель = Отправитель;
		ЗаписьШаблон.ИдентификаторПолучателя = ИдентификаторПолучателя;
		ЗаписьШаблон.ИдентификаторОтправителя = ИдентификаторОтправителя;
		ЗаписьШаблон.Шаблон = СтрокаШаблон.ШаблонДокумента;
		ЗаписьШаблон.Тематика = СтрокаШаблон.ТематикаДокумента;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти