
#Область ПрограммныйИнтерфейс

// Имя конфигурации
// 
// Возвращаемое значение:
//  Строка - 
Функция ИмяКонфигурации() Экспорт
	
	Возврат "ДокументооборотКОРП";
	
КонецФункции	

// Идентификатор конфигурации
// 
// Возвращаемое значение:
//  Строка -
Функция ИдентификаторКонфигурации() Экспорт
	
	Возврат "DocMngCorp";
	
КонецФункции	

// Имя организации
// 
// Возвращаемое значение:
//  Строка -
Функция ИмяОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Наша организация'");
	
КонецФункции	

// "Организация" или "Учреждение"
// 
// Возвращаемое значение:
//  Строка -
Функция Организация() Экспорт
	
	Возврат НСтр("ru = 'Организация'");
	
КонецФункции	

// "организация" или "учреждение"
// 
// Возвращаемое значение:
//  Строка -
Функция ОрганизацияНРег() Экспорт
	
	Возврат НСтр("ru = 'организация'");
	
КонецФункции

// "Организации" или "Учреждения" - множественное число
// 
// Возвращаемое значение:
//  Строка -
Функция Организации() Экспорт
	
	Возврат НСтр("ru = 'Организации'");
	
КонецФункции

// "организации" или "учреждения" - множественное число
// 
// Возвращаемое значение:
//  Строка -
Функция ОрганизацииНРег() Экспорт
	
	Возврат НСтр("ru = 'организации'");
	
КонецФункции	

// "предприятия" или "учреждения" в родительном падеже.
// 
// Возвращаемое значение:
//  Строка -
Функция ПредприятияРодительный() Экспорт 
	
	Возврат НСтр("ru = 'предприятия'");
	
КонецФункции

// "организации" или "учреждения" в родительном падеже.
// 
// Возвращаемое значение:
//  Строка -
Функция ОрганизацииРодительный() Экспорт 
	
	Возврат НСтр("ru = 'организации'");
	
КонецФункции

// "организации" или "учреждению" в дательном падеже.
// 
// Возвращаемое значение:
//  Строка -
Функция ОрганизацииДательный() Экспорт
	
	Возврат НСтр("ru = 'организации'")
	
КонецФункции

// "организаций" или "учреждений"
// 
// Возвращаемое значение:
//  Строка -
Функция ОрганизацийРодительный() Экспорт
	
	Возврат НСтр("ru = 'организаций'");
	
КонецФункции

// Имя организации без учета сторон
// 
// Возвращаемое значение:
//  Строка -
Функция ИмяОрганизацииБезУчетаСторон() Экспорт
	
	Возврат НСтр("ru = 'Наша организация'");
	
КонецФункции	

// Подсказка организации без учета сторон
// 
// Возвращаемое значение:
//  Строка -
Функция ПодсказкаОрганизацииБезУчетаСторон() Экспорт
	
	Возврат НСтр("ru = 'Организация'");
	
КонецФункции	

// Имя организации с учетом сторон
// 
// Возвращаемое значение:
//  Строка -
Функция ИмяОрганизацииУчетСторон() Экспорт
	
	Возврат НСтр("ru = 'Наше предприятие'");
	
КонецФункции	

// Подсказка организации с учетом сторон
// 
// Возвращаемое значение:
//  Строка -
Функция ПодсказкаОрганизацииУчетСторон() Экспорт
	
	Возврат НСтр("ru = 'Предприятие'");
	
КонецФункции	

// Ошибка изменения организации
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаИзмененияОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при изменении организации'");
	
КонецФункции	

// Ошибка записи организации
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаЗаписиОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Ошибка при записи организации'");
	
КонецФункции	

// Текст вопроса при очистке организации
// 
// Возвращаемое значение:
//  Строка -
Функция ВопросПоказатьДиалогОчисткаОрганизации() Экспорт
	
	Возврат НСтр(
		"ru = 'Отключен учет по организациям. У %1 этого вида указана
		|организация, и они попадут в отчеты и отборы по ней.
		|
		|Очистить организацию? Это действие необратимо!'");
	
КонецФункции	

// Имя процесса уведомления об ошибке изменения организации
// 
// Возвращаемое значение:
//  Строка -
Функция ВыполнитьИзменениеОрганизацииОшибкаИмяПроцесса() Экспорт
	
	Возврат НСтр("ru ='Не удалось изменить организацию в документах вида ""%1""'");
	
КонецФункции		

// Текст ошибки при изменении организации
// 
// Возвращаемое значение:
//  Строка -
Функция ВыполнитьИзменениеОрганизацииОшибка() Экспорт
	
	Возврат НСтр("ru = 'Не удалось изменить организацию в документах вида ""%1"".
			|
			|Произошла ошибка при попытке автоматически изменить организацию в документах
			|после изменения флага ""Вести учет по организациям"". Следует повторить попытку,
			|устранив причины, или воспользоваться обработкой ""Групповое изменение реквизитов"".
			|Ошибка:
			|%2'");
	
КонецФункции	

// Ошибка "Не выбрана организация"
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаНеВыбранаОрганизация() Экспорт
	
	Возврат НСтр("ru = 'Не выбрана организация'");
	
КонецФункции	

// Ошибка "Не выбрана организация нумерации"
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаНеВыбранаОрганизацияНумерации() Экспорт
	
	Возврат НСтр("ru = 'Укажите организацию, к которой отнести существующие номера'");
	
КонецФункции	

// Индекс организации
// 
// Возвращаемое значение:
//  Строка -
Функция ИндексОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Индекс организации'");
	
КонецФункции	

// Юридический адрес организации
// 
// Возвращаемое значение:
//  Строка -
Функция ЮрАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Юридический адрес организации'");
	
КонецФункции	

// Фактический адрес организации
// 
// Возвращаемое значение:
//  Строка -
Функция ФактАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Фактический адрес организации'");
	
КонецФункции	

// Телефон организации
// 
// Возвращаемое значение:
//  Строка -
Функция ТелефонОрганизации() Экспорт
	
	Возврат НСтр("ru='Телефон организации'");
	
КонецФункции	

// Факс организации
// 
// Возвращаемое значение:
//  Строка -
Функция ФаксОрганизации() Экспорт
	
	Возврат НСтр("ru='Факс организации'");
	
КонецФункции	

// Адрес электронной почты организации
// 
// Возвращаемое значение:
//  Строка -
Функция EmailОрганизации() Экспорт
	
	Возврат НСтр("ru='Адрес электронной почты организации'");
	
КонецФункции	

// Почтовый адрес организации
// 
// Возвращаемое значение:
//  Строка -
Функция ПочтовыйАдресОрганизации() Экспорт
	
	Возврат НСтр("ru='Почтовый адрес организации'");
	
КонецФункции	

// Ошибка при выборе основного банковского счета
// 
// Возвращаемое значение:
//  Строка -
Функция ОсновнойБанковскийСчетОшибка() Экспорт
	
	Возврат НСтр("ru = 'Для выбора основного счета необходимо записать организацию'");
	
КонецФункции	

// Ошибка в префиксе организации
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаПрефиксОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Нельзя в префиксе организации использовать символ ""-"".'");
	
КонецФункции	

// Ошибка в номенклатуре организации
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаНоменклатураОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Организация элемента номенклатуры дел не совпадает с организацией раздела'");
	
КонецФункции	

// Ошибка проверки заполнения номенклатуры организации
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаПроверкиЗаполненияНоменклатураОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Организация номенклатуры дел ""%1"" не совпадает с организацией раздела'");
	
КонецФункции	

// Ошибка раздела номенклатуры дел
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаРазделыНоменклатурыДел() Экспорт
	
	Возврат НСтр("ru = 'Организация раздела не совпадает с организацией вышестоящего раздела'");
	
КонецФункции	

// Ошибка передача дел в архив.
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаПередачаДелВАрхив() Экспорт
	
	Возврат НСтр("ru = 'Дело ""%1"" не относится к организации ""%2"".'");
	
КонецФункции	

// Не заполнено поле Организация
// 
// Возвращаемое значение:
//  Строка -
Функция ОшибкаНеЗаполненоПолеОрганизация() Экспорт
	
	Возврат НСтр("ru = 'Не заполнено поле ""Организация""'");
	
КонецФункции	

// Для всех организаций
// 
// Возвращаемое значение:
//  Строка -
Функция ДляВсехОрганизаций() Экспорт
	
	Возврат НСтр("ru = 'Для всех организаций'");
	
КонецФункции	

// Поле НазначениеОрганизации - подсказка ввода
// 
// Возвращаемое значение:
//  Строка -
Функция НазначениеОрганизацииПодсказкаВвода() Экспорт 
	
	Возврат НСтр("ru = 'Включен учет по организациям. У некоторых документов
	|этого вида организация не указана (%1 шт).
    |
	|Назначить им выбранную организацию?'");

	
КонецФункции	

// из организации
// 
// Возвращаемое значение:
//  Строка -
Функция ИзОрганизации() Экспорт
	
	Возврат НСтр("ru = 'из организации'");
	
КонецФункции	

// в организацию
// 
// Возвращаемое значение:
//  Строка -
Функция ВОрганизацию() Экспорт
	
	Возврат НСтр("ru = 'в организацию'");
	
КонецФункции	

// для организации
// 
// Возвращаемое значение:
//  Строка -
Функция ДляОрганизации() Экспорт
	
	Возврат НСтр("ru = 'для организации'");
	
КонецФункции	

// Заполнение разделов
// 
// Возвращаемое значение:
//  Строка -
Функция ЗаполнениеРазделов() Экспорт
	
	Возврат НСтр("ru = 'Заполнение разделов по структуре предприятия'");
	
КонецФункции	

// Вид организации
// 
// Возвращаемое значение:
//  Строка -
Функция ВидОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Вид организации:'");
	
КонецФункции	

// Декорация НадписьОрганизации
// 
// Возвращаемое значение:
//  Строка -
Функция ДекорацияНадписьОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Если не указана ни одна организация, то используется для всех.'");
	
КонецФункции	

// Данные предприятия
// 
// Возвращаемое значение:
//  Строка -
Функция ДанныеПредприятия() Экспорт
	
	Возврат НСтр("ru = 'Данные предприятия'");
	
КонецФункции	

// Учет по организациям
// 
// Возвращаемое значение:
//  Строка -
Функция УчетПоОрганизациям() Экспорт
	
	Возврат НСтр("ru = 'Учет по организациям'");
	
КонецФункции	

// Установка сведений о предприятии
// 
// Возвращаемое значение:
//  Строка -
Функция УстановкаСведенийОПредприятии() Экспорт
	
	Возврат НСтр("ru = 'Установка сведений о предприятии.'");
	
КонецФункции	

// Действует для организации
// 
// Возвращаемое значение:
//  Строка -
Функция ДействуетДляОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Действует для организации'");
	
КонецФункции	

// Все организации
// 
// Возвращаемое значение:
//  Строка -
Функция ВсеОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Все организации'");
	
КонецФункции	

// В организацию
// 
// Возвращаемое значение:
//  Строка -
Функция ВОрганизациюВРег() Экспорт
	
	Возврат НСтр("ru = 'В организацию'");
	
КонецФункции

// указанной организации
// 
// Возвращаемое значение:
//  Строка -
Функция УказаннойОрганизации() Экспорт
	
	Возврат НСтр("ru = 'указанной организации'");
	
КонецФункции

// другую организацию
// 
// Возвращаемое значение:
//  Строка -
Функция ДругуюОрганизацию() Экспорт
	
	Возврат НСтр("ru = 'другую организацию'");
	
КонецФункции	

// Возвращает текст ошибки не совпадения организации в номенклатуре дел.
// 
// Параметры:
// 	ЭтоШаблон - Булево - если Истина, то текст ошибки для шаблона документа.
// Возвращаемое значение:
// 	Строка - текст ошибки
Функция ОшибкаНеСовпаденияОрганизацииНоменклатурыДел(ЭтоШаблон = Ложь) Экспорт
	
	Если ЭтоШаблон Тогда
		Возврат НСтр("ru = 'Номенклатура дел не относится к организации, указанной в шаблоне.'");
	Иначе
		Возврат НСтр("ru = 'Номенклатура дел не относится к организации, указанной в документе.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти