#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ЗадачиДляОзнакомления, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыНаСервере(ЗадачиДляОзнакомления);
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ЗадачиДляОзнакомления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработкаКомандыНаСервере(Знач ЗадачиДляОзнакомления)
	
	РаботаСЗадачами.ОзнакомитьсяСОбновлениямиЗадач(ЗадачиДляОзнакомления);
	
КонецПроцедуры

#КонецОбласти