#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Узел")
		И ЗначениеЗаполнено(Параметры.Отбор.Узел) Тогда
		Элементы.Узел.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Ключ")
		И ЗначениеЗаполнено(Параметры.Отбор.Ключ) Тогда
		Элементы.Ключ.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("ИдентификаторОбъектаМетаданных")
		И ЗначениеЗаполнено(Параметры.Отбор.ИдентификаторОбъектаМетаданных) Тогда
		Элементы.Объект.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти