////////////////////////////////////////////////////////////////////////////////
// Интеграция с подсистемой "Задачи" (клиент, сервер).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Типы приложений без поддержки расширения прав.
// 
// Возвращаемое значение:
//  Массив из Тип - Определяет типы приложений, которые допустимы без прав.
//  
Функция ТипыПриложенийБезПрав() Экспорт
	
	ТипыПриложенийБезПрав = Новый Массив;
	ТипыПриложенийБезПрав.Добавить(Тип("ДокументСсылка.ВходящееПисьмо"));
	ТипыПриложенийБезПрав.Добавить(Тип("ДокументСсылка.ИсходящееПисьмо"));
	
	Возврат ТипыПриложенийБезПрав;
	
КонецФункции

#КонецОбласти