
#Область ПрограммныйИнтерфейс

Функция Put(XRequest)

	ВызватьИсключение 
		НСтр("ru='Мобильное приложение версии 2.1 и ниже не поддерживается.
			|Обратите внимание на:
			|1. Мобильный клиент 1С:Документооборот
			|2. Мобильное приложение 1С:Документооборот 2.2'");
 
КонецФункции

Функция Get(XRequest)

	ВызватьИсключение 
		НСтр("ru='Мобильное приложение версии 2.1 и ниже не поддерживается.
			|Обратите внимание на:
			|1. Мобильный клиент 1С:Документооборот
			|2. Мобильное приложение 1С:Документооборот 2.2'");

КонецФункции

#КонецОбласти