
&ИзменениеИКонтроль("ЗаполнитьРеквизитыДокументаПоШаблону")
Процедура ЦППК_ЗаполнитьРеквизитыДокументаПоШаблону(Шаблон, Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Шаблон) <> Тип("СправочникСсылка.ШаблоныДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыШаблона = Шаблон.Метаданные().Реквизиты;
	РеквизитыДокумента = Документ.Метаданные().Реквизиты;
	СтандартныеРеквизитыДокумента = Документ.Метаданные().СтандартныеРеквизиты;
	
	ИнформацияОКорреспонденции = РаботаСКорреспонденцией.ВидДокументаОтноситсяККорреспонденции(
		Шаблон.ВидДокумента);
	ЭтоКорреспонденция = ИнформацияОКорреспонденции.ЭтоКорреспонденция;
	ЭтоВходящаяКорреспонденция = ИнформацияОКорреспонденции.ЭтоВходящаяКорреспонденция;
	
	Для Каждого Реквизит Из РеквизитыШаблона Цикл
		
		Если Реквизит.Имя = "КомментарийКДокументу" 
			И Не ПустаяСтрока(Шаблон.КомментарийКДокументу) Тогда
			 
			Документ.Комментарий = Шаблон.КомментарийКДокументу;
			
#Вставка
		ИначеЕсли Реквизит.Имя = "Ответственный" 
			И Не ПустаяСтрока(Шаблон.Ответственный) 
			И ТипЗнч(Шаблон.Ответственный) = Тип("СправочникСсылка.АвтоподстановкиДляОбъектов") Тогда

			Документ.Ответственный = ШаблоныДокументов.ПолучитьЗначениеАвтоподстановки(Шаблон.Ответственный, Документ);

#КонецВставки
		ИначеЕсли Реквизит.Имя = "ДлительностьИсполнения" 
			И Не Шаблон.ДлительностьИсполнения = 0 Тогда
			
			ИспользоватьГрафикиРаботы = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиРаботы");
			Если Шаблон.СрокИсполненияУказанВРабочихДнях И ИспользоватьГрафикиРаботы Тогда
				ОсновнойКалендарь = ГрафикиРаботы.ПолучитьОсновнойГрафикРаботы().Календарь;
				Документ.СрокИсполнения = КалендарныеГрафикиДокументооборот.ПолучитьДатуПоОсновномуКалендарю(
					ТекущаяДатаСеанса(), Шаблон.ДлительностьИсполнения);
			Иначе
				Документ.СрокИсполнения = ТекущаяДатаСеанса() + Шаблон.ДлительностьИсполнения*60*60*24;
			КонецЕсли;
			
		ИначеЕсли Реквизит.Имя <> "КомментарийКШаблону"
			И Реквизит.Имя <> "ВладелецШаблона"
			И Реквизит.Имя <> "КомментарийКДокументу"
			И Реквизит.Имя <> "ДлительностьИсполнения" 
			И ЗначениеЗаполнено(Шаблон[Реквизит.Имя]) Тогда
			
			НайденоВСтандартныхРеквизитах = Ложь;
			Для Каждого СтандРеквизит Из СтандартныеРеквизитыДокумента Цикл
				Если СтандРеквизит.Имя = Реквизит.Имя Тогда
					НайденоВСтандартныхРеквизитах = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если (РеквизитыДокумента.Найти(Реквизит.Имя) <> Неопределено 
				Или НайденоВСтандартныхРеквизитах)
				И ЗначениеЗаполнено(Шаблон[Реквизит.Имя]) Тогда
				Документ[Реквизит.Имя] = Шаблон[Реквизит.Имя];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Контрагенты документа предприятия.
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныДокументов")
		И Шаблон.Контрагенты.Количество() > 0 Тогда
			
		КонтрагентыШаблона = Шаблон.Контрагенты;
		КонтрагентыДокумента = Документ.Контрагенты;
		
		КонтрагентыДокумента.Очистить();
		
		Для Каждого СтрокаШаблона из КонтрагентыШаблона Цикл
			НоваяСтрока = КонтрагентыДокумента.Добавить();
			НоваяСтрока.Контрагент = СтрокаШаблона.Контрагент;
			Если ЭтоКорреспонденция И ЭтоВходящаяКорреспонденция Тогда
				НоваяСтрока.ПодписалОтКонтрагента = СтрокаШаблона.КонтактноеЛицо;
			Иначе
				НоваяСтрока.КонтактноеЛицо = СтрокаШаблона.КонтактноеЛицо;
			КонецЕсли;
		КонецЦикла;
		
		Если КонтрагентыДокумента.Количество() > 0 Тогда 
			Документ.Контрагент = КонтрагентыДокумента[0].Контрагент;
			Если ЭтоКорреспонденция И ЭтоВходящаяКорреспонденция Тогда
				Документ.ПодписалОтКонтрагента = КонтрагентыДокумента[0].ПодписалОтКонтрагента;
			Иначе
				Документ.КонтактноеЛицо = КонтрагентыДокумента[0].КонтактноеЛицо;
			КонецЕсли;
		Иначе
			Документ.Контрагент = Неопределено;
			Документ.КонтактноеЛицо = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	// Стороны документа предприятия
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныДокументов")
		И Шаблон.Стороны.Количество() > 0 Тогда
		
		Документ.Стороны.Очистить();
		
		Для Каждого СтрокаШаблона из Шаблон.Стороны Цикл
			НоваяСтрока = Документ.Стороны.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШаблона, "Сторона, КонтактноеЛицо, Наименование");
			НоваяСтрока.Подписал = СтрокаШаблона.Подписант;
		КонецЦикла;
		
		// Копирование контрагента
		СторонаКонтрагент = Неопределено;
		ИндексСторон = Документ.Стороны.Количество()-1;
		
		Пока ИндексСторон > -1 Цикл
			
			Если ЗначениеЗаполнено(Документ.Стороны[ИндексСторон].Сторона)
				И РаботаСПодписямиДокументовКлиентСервер.ЭтоКонтрагент(Документ.Стороны[ИндексСторон].Сторона) Тогда
					СторонаКонтрагент = Документ.Стороны[ИндексСторон].Сторона;
			КонецЕсли;
			
			ИндексСторон = ИндексСторон - 1;
		КонецЦикла;
		
		Если СторонаКонтрагент <> Неопределено Тогда
			Документ.Контрагент = СторонаКонтрагент;
		КонецЕсли;
		
		// копирование организации
		Если Документ.Стороны.Количество() > 0
			И РаботаСПодписямиДокументовКлиентСервер.ЭтоОрганизация(Документ.Стороны[0].Сторона) Тогда
			Если Документ.Организация <> Документ.Стороны[0].Сторона Тогда
				Документ.Организация = Документ.Стороны[0].Сторона;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Товары и услуги.
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныДокументов")
		И Шаблон.Товары.Количество() > 0 Тогда
		Документ.Товары.Очистить();
		
		Для Каждого СтрокаНоменклатуры Из Шаблон.Товары Цикл 
			НоваяСтрока = Документ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатуры);
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаНоменклатуры.Номенклатура,
				"Цена, СтавкаНДС");
			
			НоваяСтрока.Цена = Реквизиты.Цена;
			НоваяСтрока.СтавкаНДС = Реквизиты.СтавкаНДС;
			ДелопроизводствоКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока, НоваяСтрока.СтавкаНДС);
		КонецЦикла;
		
		Документ.Сумма = Документ.Товары.Итог("Сумма");
		Документ.СуммаНДС = Документ.Товары.Итог("СуммаНДС");
	КонецЕсли;
	
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныДокументов") Тогда
		Документ.Подписал = Шаблон.Подписант;
	КонецЕсли;
	
	Документ.Шаблон = Шаблон;
	// Заполним Наименование по шаблону
	Если ЗначениеЗаполнено(Шаблон.Заголовок) И Шаблон.ЗаполнениеНаименованияПоШаблону Тогда 
		Документ.Заголовок = СформироватьНаименованиеПоШаблону(Документ, Шаблон.Заголовок);
	КонецЕсли;
	
	// Заполним "ОтветственныйЗаХранение" по значению автоподстановки.
	Если ЗначениеЗаполнено(Шаблон.ОтветственныйЗаХранение)
		И ТипЗнч(Шаблон.ОтветственныйЗаХранение) = Тип("СправочникСсылка.АвтоподстановкиДляОбъектов") Тогда
		
		ЗначениеАвтоподстановки = ШаблоныДокументов.ПолучитьЗначениеАвтоподстановки(
			Шаблон.ОтветственныйЗаХранение,
			Документ);
			
		Если ЗначениеАвтоподстановки <> Неопределено Тогда
			Если ТипЗнч(ЗначениеАвтоподстановки) = Тип("СправочникСсылка.Пользователи") Тогда
				
				Документ.ОтветственныйЗаХранение = 
					Сотрудники.ОсновнойСотрудникПользователя(
					ЗначениеАвтоподстановки);
				
			ИначеЕсли ТипЗнч(ЗначениеАвтоподстановки) = Тип("Массив") Тогда 
				
				Для Каждого ЗначениеАвтоподстановкиЭлемент Из ЗначениеАвтоподстановки Цикл
					Если ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("СправочникСсылка.Пользователи")Тогда 
						Документ.ОтветственныйЗаХранение = 
							Сотрудники.ОсновнойСотрудникПользователя(
							ЗначениеАвтоподстановкиЭлемент);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим массив дополнительных реквизитов.
	НаборСвойств = УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Документ);
	НаборСвойствОбъекта = Новый Массив;
	Для Каждого Элемент Из НаборСвойств Цикл
		Для Каждого ДопРеквизит Из Элемент.Набор.ДополнительныеРеквизиты Цикл
			Если НаборСвойствОбъекта.Найти(ДопРеквизит.Свойство) = Неопределено Тогда
				НаборСвойствОбъекта.Добавить(ДопРеквизит.Свойство);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Скопируем из шаблона подходящие дополнительные реквизиты.
	Для Каждого ДопРеквизитШаблона Из Шаблон.ДополнительныеРеквизиты Цикл
		Если НаборСвойствОбъекта.Найти(ДопРеквизитШаблона.Свойство) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДопРеквизита = Документ.ДополнительныеРеквизиты.Найти(
			ДопРеквизитШаблона.Свойство,
			"Свойство");
		Если СтрокаДопРеквизита = Неопределено Тогда
			СтрокаДопРеквизита = Документ.ДополнительныеРеквизиты.Добавить();
			СтрокаДопРеквизита.Свойство = ДопРеквизитШаблона.Свойство;
		КонецЕсли;
		СтрокаДопРеквизита.Значение = ДопРеквизитШаблона.Значение;
	КонецЦикла;
	
КонецПроцедуры
