#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("ТипОбъекта")
		И ЗначениеЗаполнено(Параметры.Отбор.ТипОбъекта) Тогда
		ТипОбъекта = Параметры.Отбор.ТипОбъекта;
		Список.Параметры.УстановитьЗначениеПараметра("ТипОбъекта",
			ТипОбъекта);
		Параметры.Отбор.Удалить("ТипОбъекта");
	КонецЕсли;
	
	Если Параметры.Свойство("ТипОбъекта") И ЗначениеЗаполнено(Параметры.ТипОбъекта) Тогда
		ТипОбъекта = Параметры.ТипОбъекта; 
		Список.Параметры.УстановитьЗначениеПараметра("ТипОбъекта",
			Параметры.ТипОбъекта);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипыОбъектов") И ЗначениеЗаполнено(Параметры.ТипыОбъектов) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипыОбъектов",
			Параметры.ТипыОбъектов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование 
		И ЗначениеЗаполнено(ТипОбъекта) Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ТипОбъекта", ТипОбъекта);
		ОткрытьФорму("Справочник.АлгоритмыПроверки.ФормаОбъекта", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти