#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Преобразует результат согласования в результат подписания.
//
// Параметры:
//  РезультатСогласования - ПеречислениеСсылка.РезультатыСогласования - Результат согласования.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.РезультатыПодписания - Результат подписания.
//
Функция НайтиПоРезультатуСогласования(РезультатСогласования) Экспорт
	
	Если РезультатСогласования = Перечисления.РезультатыСогласования.Согласовано Тогда
		РезультатПодписания = Подписано;
	ИначеЕсли РезультатСогласования = Перечисления.РезультатыСогласования.НеСогласовано Тогда
		РезультатПодписания = НеПодписано;
	Иначе
		РезультатПодписания = ПустаяСсылка();
	КонецЕсли;
	
	Возврат РезультатПодписания;
	
КонецФункции

#КонецОбласти

#КонецЕсли

