///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ВариантГрамматики = "ОбщаяГрамматика" Тогда
		ТекущаяГрамматика = Константы.ОбщаяГрамматикаРаботыСРечью.ПолучитьБезопасно();
	Иначе
		ВызватьИсключение НСтр("ru = 'Укажите ВариантГрамматики'");
	КонецЕсли;
	
	Для Каждого Фраза Из ТекущаяГрамматика Цикл
		НоваяСтрока = Грамматики.Добавить();
		НоваяСтрока.Фраза = Фраза;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	КомандаОКНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КомандаОКНаСервере()
	
	НоваяГрамматика = Грамматики.Выгрузить().ВыгрузитьКолонку("Фраза");
	
	Если Параметры.ВариантГрамматики = "ОбщаяГрамматика" Тогда
		Константы.ОбщаяГрамматикаРаботыСРечью.СохранитьГрамматику(НоваяГрамматика);
		Константы.ОбщаяГрамматикаРаботыСРечью.УстановитьГрамматикуСеанса();
	Иначе
		ВызватьИсключение НСтр("ru = 'Укажите ВариантГрамматики'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
