#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Истина);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	ИначеЕсли Значение = 
		Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты Тогда
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Истина);
	Иначе
		Константы.ИспользоватьЕжедневныеОтчеты.Установить(Ложь);
		Константы.ИспользоватьЕженедельныеОтчеты.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли