// @strict-types


#Область ПрограммныйИнтерфейс

// Задание отмены выполнения задачи добавлено.
// 
// Параметры:
//  ЗадачаИсполнителя - ЗадачаСсылка.ЗадачаИсполнителя -
// 
// Возвращаемое значение:
//  Булево - Истина, если используется КОД и отмена задачи происходит в не родном узле
//
Функция ЗаданиеОтменыВыполненияЗадачиДобавлено(ЗадачаИсполнителя) Экспорт
	
	Если Не ОбщегоНазначенияДокументооборотХолдинг.ОбъектМожноОбработатьВОчередиЗаданий(ЗадачаИсполнителя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбработкаОчередиЗаданийСервер.ОбъектЕстьВОчереди(ЗадачаИсполнителя, ,
		Перечисления.ТипыЗаданий.ОтменитьВыполнениеЗадачи) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОбработкаОчередиЗаданийСервер.ДобавитьЗаданиеОтменитьВыполнениеЗадачи(ЗадачаИсполнителя);
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

