#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКОД") Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ОтправлятьИсторическиеДанныеПриРасширенииДоступаКОД.Получить() И Значение = 0 Тогда
		Фраза = СтрШаблон(НСтр("ru = 'При включенной настройке ""%1"" должен быть задан размер порции'"), 
			Метаданные.Константы.ОтправлятьИсторическиеДанныеПриРасширенииДоступаКОД.Синоним);
		ОбщегоНазначения.СообщитьПользователю(
			Фраза, , , , Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
