// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает поддерживаемые форматы электронных документов.
//
// Возвращаемое значение:
//	см. ФорматыЭДО.ПоддерживаемыеФорматы
//
Функция ПоддерживаемыеФорматы() Экспорт
	
	Возврат ЭлектронныеДокументыЭДО.ПоддерживаемыеФорматы();
	
КонецФункции

// Возвращает типы электронных документов.
//
// Возвращаемое значение:
//	см. ОбменСКонтрагентами.ТипыДокументов
//
Функция ТипыДокументов() Экспорт
	
	Возврат ОбменСКонтрагентами.ТипыДокументов();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
