#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, поддерживает ли способ уведомления локальные уведомления.
//
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления - Способ уведомления.
// 
// Возвращаемое значение:
//  Булево - Способ уведомления поддерживает локальные уведомления.
//
Функция ПоддерживаетЛокальныеУведомления(СпособУведомления) Экспорт
	
	Возврат СпособУведомления <> Окном;
	
КонецФункции

// Определяет тип внешней системы по способу уведомления
// 
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.СпособыУведомления.
// 
// Возвращаемое значение:
//  Строка - Тип внешней системы.
//
Функция ТипВнешнейСистемы(СпособУведомления) Экспорт
	
	Если СпособУведомления = Telegram Тогда
		
		ТипВнешнейСистемы = "Telegram";
		
	ИначеЕсли СпособУведомления = ВКонтакте Тогда
		
		ТипВнешнейСистемы = "VK";
		
	Иначе
		
		ТипВнешнейСистемы = "";
		
	КонецЕсли;
	
	Возврат ТипВнешнейСистемы;
	
КонецФункции

// Определяет способ уведомления по типу внешней системы.
// 
// Параметры:
//  ТипВнешнейСистемы - Строка.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыУведомления - Способ уведомления по типу внешней системы.
//
Функция НайтиПоТипуВнешнейСистемы(ТипВнешнейСистемы) Экспорт
	
	Если ТипВнешнейСистемы = "Telegram" Тогда
		
		СпособУведомления = Telegram;
		
	ИначеЕсли ТипВнешнейСистемы = "VK" Тогда
		
		СпособУведомления = ВКонтакте;
		
	Иначе
		
		СпособУведомления = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат СпособУведомления;
	
КонецФункции

#КонецОбласти

#КонецЕсли