#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	Предмет = Параметры.Предмет;
	ПредметПриИзмененииСервере();
	
	Элементы.Предмет.ТолькоПросмотр = ЗначениеЗаполнено(Параметры.Предмет);
	Элементы.Предмет.КнопкаВыбора = Не Элементы.Предмет.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДействия();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПредметПриИзмененииСервере()
	
	Заголовок = НСтр("ru = 'История обработки: '");
	
	Если ЗначениеЗаполнено(Предмет) Тогда
		
		Заголовок = Заголовок + Строка(Предмет);
			
		ПрочитатьДействия();
		
	Иначе
		
		Действия.ПолучитьЭлементы().Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДействия()
	
	ПараметрыОбъектаОбработки = ДействияСервер.ПараметрыОбъектаОбработки(Предмет);
	ПараметрыВидаОбъекта = ДействияСервер.ПараметрыВидаОбъекта(ПараметрыОбъектаОбработки.ВидОбъекта);
	ДействияСервер.ПрочитатьДействияВФормуПредмета(
		ЭтотОбъект,
		ПараметрыОбъектаОбработки,
		ПараметрыВидаОбъекта,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДействия()
	
	ДействияКлиент.РазвернутьДействия(Элементы.Действия, Действия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДействияКлиент.ДействияВыбор(ЭтотОбъект,
		Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

#КонецОбласти