/////////////////////////////////////////////////////////////////////////////////////////
// ОТПРАВКА И ПОЛУЧЕНИЯ ПИСЕМ

/////////////////////////////////////////////////////////////////////////////////////////
// ПОЧТА

// Возвращает массив структур с содержанием писем с помощью встроенного объекта 1С "ПочтовоеСообщение"
//
// Параметры:
// - ПараметрыЗагрузки (Структура)
//   - Профиль (Строка)
//   - НепрочитанныеСообщения (Булево)
//   - Конверты (Булево)
//
Функция ПолучитьПочта(ПараметрыЗагрузки) Экспорт
	
	ПрофильMAPI = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.Данные.Профиль;
	НепрочитанныеСообщения = ПараметрыЗагрузки.НепрочитанныеСообщения;
	Конверты = Ложь;
	УникальныйИдентификатор = ПараметрыЗагрузки.УникальныйИдентификатор;

	ОбъектПочта = Новый Почта;
	ОбъектПочта.Подключиться(ПрофильMAPI);
	
	Результат = Новый Массив;
	
	Письма = ОбъектПочта.Выбрать(НепрочитанныеСообщения, Конверты);
	Для каждого Письмо Из Письма Цикл
		Если ТипЗнч(Письмо.Отправитель) = Тип("Строка") Тогда
			Отправитель = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель);
			Если Найти(Отправитель, "SMTP:") = 1 Тогда
				Отправитель = Сред(Отправитель, 6);
			КонецЕсли;
		Иначе // ПочтовыйАдрес
			Адрес = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель.Адрес);
			Пользователь = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель.Пользователь);
			Отправитель = РаботаСоСтроками.ПолучитьПредставлениеАдресаЭлектроннойПочты(
				Пользователь,
				Адрес);
		КонецЕсли;
		
		Сообщение = ЛегкаяПочтаКлиентСервер.СформироватьСтруктуруСообщения();
		
		Сообщение.УникальныйИдентификатор = УникальныйИдентификатор;
		Сообщение.Тема = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Тема);
		Сообщение.Текст = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Текст);
		Сообщение.ДатаПолучения = Письмо.ДатаПолучения;
		Сообщение.ДатаОтправки = Письмо.ДатаПолучения;
		Сообщение.Отправитель = Отправитель;
		Сообщение.НеПрочтено = Письмо.НеПрочтено;
		
		Для каждого Получатель Из Письмо.Получатели Цикл
			АдресПолучателя = УдалитьИзАдресаЭлектроннойПочтыПриставкуSMTP(Получатель);
			ЛегкаяПочтаКлиентСервер.ДобавитьПолучателя(Сообщение, "Кому", АдресПолучателя);
		КонецЦикла;
		
		Для каждого Копия Из Письмо.Копии Цикл
			АдресПолучателя = УдалитьИзАдресаЭлектроннойПочтыПриставкуSMTP(Копия);
			ЛегкаяПочтаКлиентСервер.ДобавитьПолучателя(Сообщение, "Копия", АдресПолучателя);
		КонецЦикла;
		
		Для каждого СлепаяКопия Из Письмо.СлепыеКопии Цикл
			АдресПолучателя = УдалитьИзАдресаЭлектроннойПочтыПриставкуSMTP(СлепаяКопия);
			ЛегкаяПочтаКлиентСервер.ДобавитьПолучателя(Сообщение, "СкрытаяКопия", АдресПолучателя);
		КонецЦикла;
		
		Если Не Конверты Тогда
			Для каждого Вложение Из Письмо.Вложения Цикл
				ИмяФайла = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Вложение.Наименование);
				ИмяФайлаИнфо = РаботаСоСтроками.РазложитьИмяФайла(ИмяФайла);
				ПолноеИмяФайла = ЛегкаяПочтаКлиент.ПолучитьПолноеИмяВременногоФайла(ИмяФайла);
				Вложение.Данные.Записать(ПолноеИмяФайла);
				ЛегкаяПочтаКлиентСервер.ДобавитьВложениеФайлНаДиске(
					Сообщение,
					ПолноеИмяФайла,
					ИмяФайла,
					ИмяФайла);
			КонецЦикла;
		КонецЕсли;
		
		Сообщение.Идентификатор = ПолучитьИдентификаторПочта(
			Сообщение.Отправитель,
			Сообщение.ДатаПолучения,
			Сообщение.Тема);
		
		Результат.Добавить(Сообщение);
		
	КонецЦикла;
	
	ОбъектПочта.Отключиться();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИдентификаторПочта(Отправитель, ДатаПолучения, Заголовок)
	
	Возврат "" + Отправитель + "|" + ДатаПолучения + "|" + Заголовок;
	
КонецФункции

// Помечает сообщения как прочтенные
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив)
//   - Элемент (Строка)
//
Функция ПометитьКакПрочтенныеПочта(
	ПараметрыЗагрузки,
	СерверныеИдентификаторыСообщений) Экспорт
	
	ПрофильMAPI = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.Данные.Профиль;
	ОбъектПочта = Новый Почта;
	ОбъектПочта.Подключиться(ПрофильMAPI);
	НепрочитанныеСообщения = Истина;
	Конверты = Истина;
	Письма = ОбъектПочта.Выбрать(НепрочитанныеСообщения, Конверты);
	Для каждого Письмо Из Письма Цикл
		Если ТипЗнч(Письмо.Отправитель) = Тип("Строка") Тогда
			Отправитель = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель);
			Если Найти(Отправитель, "SMTP:") = 1 Тогда
				Отправитель = Сред(Отправитель, 6);
			КонецЕсли;
		Иначе // ПочтовыйАдрес
			Отправитель = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель.Адрес + " <" + Письмо.Отправитель.Пользователь + ">");
		КонецЕсли;
		
		Идентификатор = ПолучитьИдентификаторПочта(
			Отправитель,
			Письмо.ДатаПолучения,
			РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Тема));
		Если СерверныеИдентификаторыСообщений.Найти(Идентификатор) <> Неопределено Тогда
			Письмо.Непрочтено = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Помечает сообщения как непрочтенные
//
// Параметры:
// - НастройкаЗагрузкиЭлектроннойПочты (Структура)
// - СерверныеИдентификаторыСообщений (Массив)
//   - Элемент (Строка)
//
Функция ПометитьКакНепрочтенныеПочта(
	ПараметрыЗагрузки,
	СерверныеИдентификаторыСообщений) Экспорт
	
	ПрофильMAPI = ПараметрыЗагрузки.НастройкиПрофилейДляЗагрузки.Профиль.Данные.Профиль;
	ОбъектПочта = Новый Почта;
	ОбъектПочта.Подключиться(ПрофильMAPI);
	НепрочитанныеСообщения = Ложь;
	Конверты = Истина;
	Письма = ОбъектПочта.Выбрать(НепрочитанныеСообщения, Конверты);
	Для каждого Письмо Из Письма Цикл
		Если ТипЗнч(Письмо.Отправитель) = Тип("Строка") Тогда
			Отправитель = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Отправитель);
			Если Найти(Отправитель, "SMTP:") = 1 Тогда
				Отправитель = Сред(Отправитель, 6);
			КонецЕсли;
		Иначе // ПочтовыйАдрес
			ОтправительАдрес = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Строка(Письмо.Отправитель.Адрес));
			ОтправительОтображаемоеИмя = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Строка(Письмо.Отправитель.Пользователь));
			Отправитель = РаботаСоСтроками.ПолучитьПредставлениеАдресаЭлектроннойПочты(
				ОтправительОтображаемоеИмя,
				ОтправительАдрес);
		КонецЕсли;
		
		Идентификатор = ПолучитьИдентификаторПочта(
			Отправитель,
			Письмо.ДатаПолучения,
			РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Письмо.Тема));
		Если СерверныеИдентификаторыСообщений.Найти(Идентификатор) <> Неопределено Тогда
			Письмо.Непрочтено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Принимает ПочтовыйАдрес (ПочтовыйАдрес)
// Возвращает Результат (Строка)
//
Функция УдалитьИзАдресаЭлектроннойПочтыПриставкуSMTP(ПочтовыйАдрес)
	
	Результат = ПочтовыйАдрес.Адрес;
	Если Найти(Результат, "SMTP:") = 1 Тогда
		Результат = Сред(Результат, 6);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Отправляет сообщение, используя встроенный объект 1С "Почта"
//
// Параметры:
// - Сообщение (Структура)
//
Функция ОтправитьПочта(Сообщение, СтруктураПрофиля) Экспорт
	
	ПочтовоеСообщение = Новый ПочтовоеСообщение;
	
	Для каждого Получатель Из Сообщение.Получатели Цикл
		ПочтовоеСообщение.Получатели.Добавить(Получатель);
	КонецЦикла;
	Для каждого Получатель Из Сообщение.Копии Цикл
		ПочтовоеСообщение.Копии.Добавить(Получатель);
	КонецЦикла;
	Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
		ПочтовоеСообщение.СлепыеКопии.Добавить(Получатель);
	КонецЦикла;
	
	Для каждого Вложение Из Сообщение.Вложения Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Вложение.Адрес);
		ПочтовоеСообщение.Вложения.Добавить(ДвоичныеДанные, Вложение.ИмяФайла);
	КонецЦикла;
	
	ПочтовоеСообщение.Отправитель = СтруктураПрофиля.Данные.Отправитель;
	ПочтовоеСообщение.Тема = Сообщение.Тема;
	ПочтовоеСообщение.Текст = Сообщение.Текст;
	
	ОбъектПочта = Новый Почта;
	ПрофильMAPI = СтруктураПрофиля.Данные.Профиль;
	ОбъектПочта.Подключиться(ПрофильMAPI);
	ОбъектПочта.Послать(ПочтовоеСообщение, Ложь);
	ОбъектПочта.Отключиться();
	
	Возврат Истина;
	
КонецФункции
