
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Узел") И ЗначениеЗаполнено(Параметры.Узел) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Узел",
			Параметры.Узел,
			ВидСравненияКомпоновкиДанных.Равно,,
			Истина);
		Элементы.Узел.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Направление") И ЗначениеЗаполнено(Параметры.Направление) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Направление",
			Параметры.Направление,
			ВидСравненияКомпоновкиДанных.Равно,,
			Истина);
		Элементы.Направление.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
