
&НаСервере
Процедура ЦППК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	// { *Грошев (ТТС) [29.06.2020]
	НовыйЭлемент = Элементы.Вставить("ТТС_Направление", Тип("ПолеФормы")); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Запись.ТТС_Направление";
	// }
КонецПроцедуры

&НаСервере
&После("УстановитьВидимость")
Процедура ЦППК_УстановитьВидимость()
			
	// { *Грошев (ТТС) [29.06.2020]
	Элементы.ТТС_Направление.Видимость = 
		Запись.Нумератор.ТТС_НезависимаяНумерацияПоНаправлению;
	// }	

КонецПроцедуры
