// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Получить ключ записи регистра идентификаторов для существующей записи или Неопределено.
// 
// Параметры:
//  ЗначенияКлюча - Структура
// 
// Возвращаемое значение:
//  Неопределено, РегистрСведенийКлючЗаписи.ИдентификаторыОбъектовВСервисахВнешнегоПодписания -
//
Функция ПолучитьКлючЗаписиРегистраИдентификаторов(Знач ЗначенияКлюча) Экспорт
	
	Возврат РаботаСВнешнимПодписанием.ПолучитьКлючЗаписиРегистраИдентификаторов(ЗначенияКлюча);
	
КонецФункции

// Проверить подключенине к сервису кабинет сотрудника.
// 
// Параметры:
//  АдресПриложения      - Строка - Адрес приложения
//  ИдентификаторКлиента - Строка - Идентификатор клиента
//  СекретКлиента        - Строка - Секрет клиента
// 
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьПодключениеКСервисуКабинетСотрудника(Знач АдресПриложения, Знач ИдентификаторКлиента,
	Знач СекретКлиента) Экспорт
	
	Возврат КабинетСотрудникаМенеджерОбмена.ПроверитьПодключениеПоАдресуИКлючам(
				АдресПриложения, ИдентификаторКлиента, СекретКлиента);
	
КонецФункции

#КонецОбласти