
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ПравилоАК")
		ИЛИ Параметры.ПравилоАК = Неопределено
		ИЛИ Параметры.ПравилоАК.Пустая() Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Правило = Параметры.ПравилоАК;	
	
	Элементы.ДокументыПредприятия.Видимость = Ложь;
	Элементы.Файлы.Видимость = Ложь;
	Элементы.Проекты.Видимость = Ложь;
	Элементы.ПроектныеЗадачи.Видимость = Ложь;
	Элементы.Мероприятия.Видимость = Ложь;
	
	Для Каждого ТипОбъекта Из Правило.ТипыОбъектов Цикл
		Элементы[ОбщегоНазначения.ИмяЗначенияПеречисления(ТипОбъекта.ТипДанных)].Видимость = Истина;	
	КонецЦикла;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруДел") Тогда 
		Элементы.ИндексСостоянияДела.Видимость = Ложь;
	КонецЕсли;
		
	РезультатыПроверки.Очистить();
	Для Каждого Условие Из Правило.Условия Цикл
		НоваяСтрока = РезультатыПроверки.Добавить();
		НоваяСтрока.Условие = Условие.Выражение;
		НоваяСтрока.РезультатПроверки = "";		
	КонецЦикла;
	
 	СостояниеПроверкиПравила = 0;
	СостояниеПроверкиПравилаНадпись = "Проверка на данном объекте не произведена";
	
	Делопроизводство.СписокДокументовУсловноеОформлениеПомеченныхНаУдаление(СписокДокументыПредприятия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыКатегоризацииПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийЭлемент = Элементы["Список" + ТекущаяСтраница.Имя]; 
	Если НЕ ТекущийЭлемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> ТекущийЭлемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = ТекущийЭлемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументыПредприятия

&НаКлиенте
Процедура СписокДокументыПредприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСоСпискамиДокументовКлиент.ОбработкаВыбора(
		ЭтотОбъект, Элементы.СписокДокументыПредприятия, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументыПредприятияПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> Элемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = Элемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
		Если ПроверятьПриВыделении Тогда
			ПроверитьПравилоНаОбъекте(Неопределено);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> Элемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = Элемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
		Если ПроверятьПриВыделении Тогда
			ПроверитьПравилоНаОбъекте(Неопределено);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНевидимостьСтатусаПоиска()
	
	СостояниеПроверкиПравила = 0;
	СостояниеПроверкиПравилаНадпись = "Проверка на данном объекте не произведена";
	Для Каждого Строка Из РезультатыПроверки Цикл
		Строка.РезультатПроверки = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПравилоНаОбъекте(Команда)
	
	ДанныеПроверки = ПроверитьПравило(ТекущийОбъектВСписке);
		РезультатыПроверки.Очистить();
	Для Каждого РезультатПроверки Из ДанныеПроверки Цикл
		НоваяСтрока = РезультатыПроверки.Добавить();
		НоваяСтрока.Условие = РезультатПроверки.Условие;
		НоваяСтрока.РезультатПроверки = РезультатПроверки.РезультатПроверкиУсловия;
	КонецЦикла;
	
	ИтоговыйРезультат = Ложь;
	Для Каждого РезультатПроверки Из ДанныеПроверки Цикл
		ИтоговыйРезультат = ИтоговыйРезультат
			ИЛИ (ТипЗнч(РезультатПроверки.РезультатПроверкиУсловия) = Тип("Булево")
			И РезультатПроверки.РезультатПроверкиУсловия = Истина);
		Если ТипЗнч(РезультатПроверки.РезультатПроверкиУсловия) <> Тип("Булево") Тогда
			ИтоговыйРезультат = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
		
	Если ИтоговыйРезультат Тогда
		СостояниеПроверкиПравила = 2;
		СостояниеПроверкиПравилаНадпись = "Правило подходит для данного объекта";
	Иначе
		СостояниеПроверкиПравила = 1;
		СостояниеПроверкиПравилаНадпись = "Правило неприменимо для данного объекта";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПравило(ТекущийОбъект)
	
	Возврат РаботаСКатегориямиДанных.ВыполнитьПроверкуПрименимостиПравилаАвтоКатегоризацииНаОбъекте(Правило, ТекущийОбъектВСписке);
	
КонецФункции

&НаКлиенте
Процедура РезультатыПроверкиПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		ВыражениеТекущегоУсловия = Элемент.ТекущиеДанные.Условие;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМероприятияПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> Элемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = Элемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
		Если ПроверятьПриВыделении Тогда
			ПроверитьПравилоНаОбъекте(Неопределено);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектыПриАктивизацииСтроки(Элемент)

	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> Элемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = Элемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
		Если ПроверятьПриВыделении Тогда
			ПроверитьПравилоНаОбъекте(Неопределено);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектныеЗадачиПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И ТекущийОбъектВСписке <> Элемент.ТекущиеДанные.Ссылка Тогда
		ТекущийОбъектВСписке = Элемент.ТекущиеДанные.Ссылка;
		УстановитьНевидимостьСтатусаПоиска();
		Если ПроверятьПриВыделении Тогда
			ПроверитьПравилоНаОбъекте(Неопределено);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
