
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Установит основного сотрудника (затерев предыдущего, если он был)
//
// Параметры:
//  ФизическоеЛицо - СправочникССылка.ФизическиеЛица
//  Сотрудник - СправочникССылка.Сотрудники
//
Процедура УстановитьОсновногоСотрудника(ФизическоеЛицо, Сотрудник) Экспорт
	
	// Если текущий сотрудник уже основной, то не обновляем записи в базе. 
	Если Сотрудники.ОсновнойСотрудникФизЛица(ФизическоеЛицо) = Сотрудник Тогда
		Возврат;
	КонецЕсли;
		
	ВсеСотрудникиФизЛица = Сотрудники.ВсеСотрудникиФизЛица(ФизическоеЛицо);
	Действует = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Действует");
	
	Если Не Действует И ВсеСотрудникиФизЛица.Количество() > 0 Тогда
		// Не даем отметить основным недействительного сотрудника, если у физ. лица есть другие
		// действительные сотрудники. 		
		ВызватьИсключение НСтр("ru = 'Нельзя не действующего сотрудника указать как основного.'");
	КонецЕсли;	
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ФизическоеЛицо = ФизическоеЛицо;
	Запись.Сотрудник = Сотрудник;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удалит запись основного сотрудника (если нет действующих сотрудников)
//
// Параметры:
//  ФизическоеЛицо - СправочникССылка.ФизическиеЛица
//  Сотрудник - СправочникССылка.Сотрудники
//
Процедура УдалитьОсновногоСотрудника(ФизическоеЛицо) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли