///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	КомандаОКНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КомандаОКНаСервере()
	
	РаботаСРечьюБМОСервер.ВыполнитьРегистрациюСеанса(Логин, Пароль);
	Константы.ТокенСеансаРаботыСРечью.ЗаписатьТокенПоПараметрамВнешнегоПодключенияСеанса();
	
КонецПроцедуры

#КонецОбласти
