
&НаСервере
Процедура ЦППК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не (Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока)) Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
		"НоменклатураДел.Раздел = &Раздел", 
		"ИСТИНА");
	КонецЕсли;
	
	Порядок = Разделы.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Разделы.Порядок.ИдентификаторПользовательскойНастройки);
	Порядок.Элементы.Очистить();
	
	НовыйПорядок = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйПорядок.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	НовыйПорядок.Поле                = Новый ПолеКомпоновкиДанных("Ссылка.ЦППК_РазрядПорядка");
	НовыйПорядок.ТипУпорядочивания   = НаправлениеСортировкиКомпоновкиДанных.Возр;
	НовыйПорядок.Использование       = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦППК_ИерархическийСписокПосле(Команда)
	Элементы.Разделы.Отображение = ОтображениеТаблицы.ИерархическийСписок;
КонецПроцедуры

&НаКлиенте
Процедура ЦППК_ДеревоПосле(Команда)
	Элементы.Разделы.Отображение = ОтображениеТаблицы.Дерево;
КонецПроцедуры

&НаКлиенте
Процедура ЦППК_СписокПосле(Команда)
	Элементы.Разделы.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
&Перед("ОбработкаОжидания")
Процедура ЦППК_ОбработкаОжидания()
	ЦППК_ДобавитьОтборПоРазделуВЗапрос();
КонецПроцедуры  


&НаСервере 
Процедура ЦППК_ДобавитьОтборПоРазделуВЗапрос()
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
	"ИСТИНА",
	"НоменклатураДел.Раздел = &Раздел");
	
КонецПроцедуры

