#Область ПрограммныйИнтерфейс

// Устарел. Возвращает массив структур с описанием поставляемых областей делегирования
// 
// Возвращаемое значение:
//  Массив - Описания начального заполнения областей делегирования
Функция ОписанияНачальногоЗаполненияОбластейДелегирования() Экспорт
	
	ОписанияОбластейДелегирования = Новый Массив;
	
	// Документы
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "65a19e5a-fd0a-4a24-93de-64cd98f60e8b";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Документы'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Документы";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиДокументов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ДокументыПредприятия");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ВидыДокументов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныДокументов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Контрагенты");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Организации");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ДелаХраненияДокументов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.НоменклатураДел");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.МестаХраненияДел");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Файлы
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "05ae6734-7d75-4b51-8870-23fb26e785dc";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Файлы'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Файлы";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиФайлов");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Проекты
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "df8dda2c-a4d3-4b2d-823f-74df41598a4f";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Проекты'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Проекты";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Проекты");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиПроектов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПроектныеЗадачи");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.КонтрольныеТочки");
	ОписаниеОбластиДелегирования.Состав.Добавить("РегистрСведений.ФактическиеТрудозатраты");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
    // Процессы и задачи
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "59817e28-8acd-4f96-967f-4dc29cf7b94c";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Процессы и задачи'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "ПроцессыИЗадачи";
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Исполнение");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Ознакомление");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Подписание");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Приглашение");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Рассмотрение");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Регистрация");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.РешениеВопросовВыполненияЗадач");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Согласование");
	ОписаниеОбластиДелегирования.Состав.Добавить("БизнесПроцесс.Утверждение");
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.Задача");
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.ДействиеЗадачи");
	ОписаниеОбластиДелегирования.Состав.Добавить("Задача.ЗадачаИсполнителя");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныИсполнения");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныОзнакомления");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныПриглашения");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныРассмотрения");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныРегистрации");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныСогласования");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныПодписания");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныУтверждения");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныЗадач");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Ежедневные отчеты
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "742d51e8-7173-4d7d-a009-df6f0685374d";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Учет рабочего времени'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "ЕжедневныеОтчеты";
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.ЕжедневныйОтчет");
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.ЕженедельныйОтчет");
	ОписаниеОбластиДелегирования.Состав.Добавить("РегистрСведений.ФактическиеТрудозатраты");
	ОписаниеОбластиДелегирования.Состав.Добавить("РегистрНакопления.РабочееВремяСотрудников");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Почта
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "b0b32fc2-a0f8-4124-82f9-71e56b035570";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Почта'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Почта";
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.ВходящееПисьмо");
	ОписаниеОбластиДелегирования.Состав.Добавить("Документ.ИсходящееПисьмо");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.УчетныеЗаписиЭлектроннойПочты");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиПисем");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныПисем");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Мероприятия
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "51c24c1c-4a25-4c32-9100-a6482eb3b00e";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Мероприятия'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Мероприятия";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Мероприятия");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПротоколыМероприятий");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиМероприятий");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Контрагенты");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Организации");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Обсуждения
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "53a00d1c-e080-4d3a-8a9e-bfd68cf5463d";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Обсуждения'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Обсуждения";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ТемыОбсуждений");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.СообщенияОбсуждений");
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ПапкиФорума");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Календарь
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "57da031c-e234-423a-8a94-b2fb8cf5463d";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Календарь'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Календарь";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.ЗаписиРабочегоКалендаря");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Контроль
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "2fa99374-2682-4bf8-bc92-6ebe2b0e9e0e";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Контроль'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "Контроль";
	ОписаниеОбластиДелегирования.Состав.Добавить("Справочник.Контроль");
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	// Административные функции
	ОписаниеОбластиДелегирования = Новый Структура("Идентификатор, Наименование, ИмяПредопределенного, Состав", "", "", "", Новый Массив);
	ОписаниеОбластиДелегирования.Идентификатор = "2fa12344-2682-4bf8-bc92-6ebe2b0e9e0e";
	ОписаниеОбластиДелегирования.Наименование = НСтр("ru = 'Административные функции'");
	ОписаниеОбластиДелегирования.ИмяПредопределенного = "АдминистративныеФункции";
	ОписанияОбластейДелегирования.Добавить(ОписаниеОбластиДелегирования);
	
	Возврат ОписанияОбластейДелегирования;
	
КонецФункции

// Описания начального заполнения областей замещения.
// 
// Возвращаемое значение:
//  Массив из Структура - Описания начального заполнения областей замещения:
// * Идентификатор - Строка - уникальный идентификатор ссылки на область замещения
// * Наименование - Строка - Наименование области замещения
// * ИмяПредопределенного - Строка - Имя предопределенных данных области замещения
// * Состав - Массив из Строка - Массив из имен объектов метаданных, делегируемых областью
Функция ОписанияНачальногоЗаполненияОбластейЗамещения() Экспорт
	
	ОписанияОбластейЗамещения = Новый Массив;
	
	// Все области
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b3-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = '<Все области>'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ВсеОбласти";
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Все функции по документам
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b4-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Документы'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Документы";
	ДобавитьДокументыВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	СсылкаНаОбластьДокументы = Справочники.ОбластиЗамещения.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбластиЗамещения.Идентификатор));
	
	// Поручение, подзадачи, вопросы по задачам
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "bc2fd76f-cabf-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Поручения, подзадачи, вопросы по задачам'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыПоручение";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.РешениеВопросовВыполненияЗадач");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныЗадач");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Исполнение
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b5-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Исполнение'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыИсполнение";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Исполнение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныИсполнения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Ознакомление
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b6-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Ознакомление'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыОзнакомление";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Ознакомление");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныОзнакомления");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Подписание
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648bc-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Подписание'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыПодписание";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Подписание");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПодписания");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Рассмотрение
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b7-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Рассмотрение'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыРассмотрение";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Рассмотрение");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРассмотрения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Регистрация
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b8-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Регистрация'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыРегистрация";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Регистрация");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРегистрации");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Согласование
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648b9-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Согласование'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыСогласование";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Согласование");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныСогласования");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Утверждение
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648ba-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Утверждение'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыУтверждение";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Утверждение");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныУтверждения");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);

	// Просмотр, создание и редактирование документов
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648bb-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Просмотр, создание и редактирование всех документов'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ДокументыПросмотрИРедактирование";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьДокументы;
	ДобавитьДокументыВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Файлы
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c8-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Файлы'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Файлы";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиФайлов");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Проекты
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c3-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Проекты'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Проекты";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Проекты");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиПроектов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПроектныеЗадачи");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.КонтрольныеТочки");
	ОписаниеОбластиЗамещения.Состав.Добавить("РегистрСведений.ФактическиеТрудозатраты");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Ежедневные отчеты
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648bd-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Ежедневные отчеты'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ЕжедневныеОтчеты";
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.ЕжедневныйОтчет");
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.ЕженедельныйОтчет");
	ОписаниеОбластиЗамещения.Состав.Добавить("РегистрСведений.ФактическиеТрудозатраты");
	ОписаниеОбластиЗамещения.Состав.Добавить("РегистрНакопления.РабочееВремяСотрудников");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Почта
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c2-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Почта'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Почта";
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.ВходящееПисьмо");
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.ИсходящееПисьмо");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.УчетныеЗаписиЭлектроннойПочты");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиПисем");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПисем");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Мероприятия
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c0-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Мероприятия'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Мероприятия";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Мероприятия");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПротоколыМероприятий");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиМероприятий");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Контрагенты");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Организации");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Обсуждения
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c1-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Форум'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Форум";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ТемыОбсуждений");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.СообщенияОбсуждений");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиФорума");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Календарь
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648be-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Календарь'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Календарь";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ЗаписиРабочегоКалендаря");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Контроль
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648bf-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Контроль'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Контроль";
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Контроль");
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Административные функции
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "1f009e32-2558-4812-acb1-11d5e9107319";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Протокол работы сотрудников'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ПротоколРаботыСотрудников";
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Все задачи
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c4-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Задачи'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "Задачи";
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Исполнение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Ознакомление");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Подписание");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Приглашение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Рассмотрение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Регистрация");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.РешениеВопросовВыполненияЗадач");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Согласование");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Утверждение");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныИсполнения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныОзнакомления");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПриглашения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРассмотрения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРегистрации");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныСогласования");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПодписания");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныУтверждения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныЗадач");
	ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	СсылкаНаОбластьЗадачи = Справочники.ОбластиЗамещения.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбластиЗамещения.Идентификатор));
	
	// Выполнение прочих поручений
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c6-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Выполнение прочих задач'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ЗадачиВыполнениеПрочихПоручений";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьЗадачи;
	ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Постановка поручений
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c7-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Постановка задач'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ЗадачиПостановкаПоручений";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьЗадачи;
	ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	// Просмотр всех задач
	ОписаниеОбластиЗамещения = ОписаниеОбластиЗамещения();
	ОписаниеОбластиЗамещения.Идентификатор = "93b648c5-9c2d-11eb-80c6-cc1a7e589028";
	ОписаниеОбластиЗамещения.Наименование = НСтр("ru = 'Просмотр всех задач'");
	ОписаниеОбластиЗамещения.ИмяПредопределенного = "ЗадачиПросмотр";
	ОписаниеОбластиЗамещения.Родитель = СсылкаНаОбластьЗадачи;
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Исполнение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.КомплексныйПроцесс");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Ознакомление");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Подписание");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Приглашение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Рассмотрение");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Регистрация");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.РешениеВопросовВыполненияЗадач");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Согласование");
	ОписаниеОбластиЗамещения.Состав.Добавить("БизнесПроцесс.Утверждение");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныИсполнения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныОзнакомления");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПриглашения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРассмотрения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныРегистрации");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныСогласования");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныПодписания");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныУтверждения");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныТекстов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныЗадач");
	ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения);
	ОписанияОбластейЗамещения.Добавить(ОписаниеОбластиЗамещения);
	
	Возврат ОписанияОбластейЗамещения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет метаданные задач в состав переданного описания области замещения
// 
// Параметры:
//  ОписаниеОбластиЗамещения - Структура - Описание области замещения:
// * Идентификатор - Строка
// * Наименование - Строка
// * ИмяПредопределенного - Строка
// * Состав - Массив из Строка
Процедура ДобавитьЗадачиВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения)
	
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.Задача");
	ОписаниеОбластиЗамещения.Состав.Добавить("Документ.ДействиеЗадачи");
	ОписаниеОбластиЗамещения.Состав.Добавить("Задача.ЗадачаИсполнителя");
	
КонецПроцедуры

// Добавляет метаданные документов в состав переданного описания области замещения
// 
// Параметры:
//  ОписаниеОбластиЗамещения - Структура - Описание области замещения:
// * Идентификатор - Строка
// * Наименование - Строка
// * ИмяПредопределенного - Строка
// * Состав - Массив из Строка
Процедура ДобавитьДокументыВОписаниеОбластиЗамещения(ОписаниеОбластиЗамещения)
	
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ПапкиДокументов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ДокументыПредприятия");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ВидыДокументов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ШаблоныДокументов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Контрагенты");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.Организации");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.ДелаХраненияДокументов");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.НоменклатураДел");
	ОписаниеОбластиЗамещения.Состав.Добавить("Справочник.МестаХраненияДел");
	
КонецПроцедуры

// Конструктор нового описания области замещения
// 
// Возвращаемое значение:
//  Структура - Описание области замещения:
// * Идентификатор - Строка - уникальный идентификатор области
// * Наименование - Строка - Наименование области
// * ИмяПредопределенного - Строка - Имя предопределенной области
// * Родитель - СправочникСсылка.ОбластиЗамещения - вышестоящая область
// * Состав - Массив из Строка - Имена передаваемых метаданных
Функция ОписаниеОбластиЗамещения()
	
	ОписаниеОбластиЗамещения = Новый Структура;
	
	ОписаниеОбластиЗамещения.Вставить("Идентификатор", "");
	ОписаниеОбластиЗамещения.Вставить("Наименование", "");
	ОписаниеОбластиЗамещения.Вставить("ИмяПредопределенного", "");
	ОписаниеОбластиЗамещения.Вставить("Родитель", Справочники.ОбластиЗамещения.ПустаяСсылка());
	ОписаниеОбластиЗамещения.Вставить("Состав", Новый Массив);
	
	Возврат ОписаниеОбластиЗамещения;
	
КонецФункции

#КонецОбласти