//++AxelSoft Шарапова 30.10.2024 САНФ-029233
&ИзменениеИКонтроль("ЗавершитьВыборСрокаИсполненияДляСтрокиТаблицыИсполнители")
Процедура ЦППК_ЗавершитьВыборСрокаИсполненияДляСтрокиТаблицыИсполнители1(РезультатВыбора, ДопПараметры)

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВариантыМаршуртизацииЗадач = РаботаСБизнесПроцессамиКлиентСервер.ВариантыМаршуртизацииЗадач();

	ВариантыУстановкиСрокаИсполнения = 
	СрокиИсполненияПроцессовКлиентСервер.ВариантыУстановкиСрокаИсполнения();

	ТекущиеДанные = ДопПараметры.ТекущиеДанные;
	ВариантИсполнения = ДопПараметры.ВариантИсполнения;
	Форма = ДопПараметры.Форма;
	ЭлементИсполнители = ДопПараметры.ЭлементИсполнители;
	РеквизитИсполнители = ДопПараметры.РеквизитИсполнители;

	ТекущиеДанные.СрокИсполнения = РезультатВыбора;

	ТекущиеДанные.ВариантУстановкиСрокаИсполнения = ВариантыУстановкиСрокаИсполнения.ТочныйСрок;
	
	#Вставка
	Объект = Форма.Объект;
	
	ТипыПроцессаСОбработкойРезультатов = Новый Массив;
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Исполнение"));
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Приглашение"));
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Рассмотрение"));
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Регистрация"));
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Согласование"));
	ТипыПроцессаСОбработкойРезультатов.Добавить(Тип("БизнесПроцессСсылка.Утверждение"));
	
	ПроцессСОбработкойРезультата = ТипыПроцессаСОбработкойРезультатов.Найти(ТипЗнч(Объект.Ссылка)) <> Неопределено; 
	
	Если ПроцессСОбработкойРезультата Тогда
		
		Если ТекущиеДанные.СрокИсполнения > Объект.СрокОбработкиРезультатов Тогда
			
			Объект.СрокОбработкиРезультатов = ТекущиеДанные.СрокИсполнения;		
			Объект.ВариантУстановкиСрокаОбработкиРезультатов = ТекущиеДанные.ВариантУстановкиСрокаИсполнения;
			
		КонецЕсли;	
		
	КонецЕсли; 
	#КонецВставки
	
	ЗаполнитьСрокиИсполненияВТаблицеИсполнителейПоТекущейСтроке(
	РеквизитИсполнители, ТекущиеДанные, ВариантИсполнения);

	Форма.ЗаполнитьПредставлениеСроковИсполнения();

	ИндексИзмененнойСтроки = РеквизитИсполнители.Индекс(ТекущиеДанные);

	Форма.ОбновитьСрокиИсполненияОтложенно("Исполнители", ИндексИзмененнойСтроки);

	Форма.Модифицированность = Истина;

КонецПроцедуры
//AxelSoft Шарапова 30.10.2024 САНФ-029233
