
&НаКлиенте
Процедура ЦППК_ЦППК_КомментарийДействияНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ПравилаЭскалации.Форма.ЦППК_ФормаКомментария", Новый Структура("КомментарийДействия", Объект.ЦППК_КомментарийДействия),
	ЭтотОбъект,,,, Новый ОписаниеОповещения("КомментарийДействияОкончаниеВводеТекста", ЭтотОбъект));
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура КомментарийДействияОкончаниеВводеТекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ЦППК_КомментарийДействия = Результат;
	КонецЕсли;
	
КонецПроцедуры // КомментарийДействияОкончаниеВводеТекста()
	
