// @strict-types


#Область ПрограммныйИнтерфейс

// Выполняет загрузку настроек обработки
// 
// Параметры:
//  КонтекстЗагрузки - см. КопированиеНастроекОбработкиКлиентСервер.НовыйКонтекстЗагрузкиНастроек
Процедура ВыполнитьЗагрузкуНастроекОбработки(КонтекстЗагрузки) Экспорт
	
	КопированиеНастроекОбработки.ВыполнитьЗагрузкуНастроекОбработки(КонтекстЗагрузки);
	
КонецПроцедуры

// Заполняет доступные для выгрузки настройки обработки по настройке обработки
// 
// Параметры:
//  КонтекстВыгрузки - см. КопированиеНастроекОбработкиКлиентСервер.НовыйКонтекстВыгрузкиНастроек
Процедура ЗаполнитьДоступныеДляВыгрузкиДанныеПоНастройкеОбработки(КонтекстВыгрузки) Экспорт
	
	КопированиеНастроекОбработки.ЗаполнитьДоступныеДляВыгрузкиДанныеПоНастройкеОбработки(КонтекстВыгрузки);
	
КонецПроцедуры

// Заполняет адрес во временном хранилище двоичных данных выгрузки настроек
// 
// Параметры:
//  КонтекстВыгрузки - см. КопированиеНастроекОбработкиКлиентСервер.НовыйКонтекстВыгрузкиНастроек
Процедура ЗаполнитьАдресДанныхВыгрузкиНастроек(КонтекстВыгрузки) Экспорт
	
	КопированиеНастроекОбработки.ЗаполнитьАдресДанныхВыгрузкиНастроек(КонтекстВыгрузки);
	
КонецПроцедуры

#КонецОбласти
