#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные виджета.
// 
// Возвращаемое значение:
// 	Структура - Данные виджета. См. Справочник.Виджеты.НовыйДанныеВиджета.
//
Функция ДанныеВиджета(Виджет) Экспорт
	
	Виджеты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Виджет);
	ДанныеВиджетов = ДанныеВиджетов(Виджеты);
	ДанныеВиджета = ДанныеВиджетов[Виджет];
	
	Возврат ДанныеВиджета;
	
КонецФункции

// Получает данные виджета.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение: - Данные виджетов:
// 	 * Ключ - Строка - Виджет.
// 	 * Значение -  Структура - Данные виджета. См. Справочники.Виджеты.НовыйДанныеВиджета.
//
Функция ДанныеВиджетов(Виджеты = Неопределено) Экспорт
	
	ДанныеВиджетов = Новый Соответствие;
	
	Если Виджеты <> Неопределено Тогда
		
		ВиджетыВключаяВторойУровень = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВиджетыВключаяВторойУровень, Виджеты);
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ВиджетыВложенныеВиджеты.Виджет КАК Виджет
			|ИЗ
			|	Справочник.Виджеты.ВложенныеВиджеты КАК ВиджетыВложенныеВиджеты
			|ГДЕ
			|	ВиджетыВложенныеВиджеты.Ссылка В (&Виджеты)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВиджетыКомпоновка.Виджет
			|ИЗ
			|	Справочник.Виджеты.Компоновка КАК ВиджетыКомпоновка
			|ГДЕ
			|	ВиджетыКомпоновка.Ссылка В (&Виджеты)");
		
		Запрос.УстановитьПараметр("Виджеты", Виджеты);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Виджет)
				Или ВиджетыВключаяВторойУровень.Найти(Выборка.Виджет) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВиджетыВключаяВторойУровень.Добавить(Выборка.Виджет);
			
		КонецЦикла;
			
	Иначе
		
		ВиджетыВключаяВторойУровень = Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Виджеты.Ссылка,
		|	Виджеты.ВерсияДанных,
		|	Виджеты.ПометкаУдаления,
		|	Виджеты.Наименование,
		|	Виджеты.НаименованиеЯзык1,
		|	Виджеты.Вид,
		|	Виджеты.ВысотаСхемы,
		|	Виджеты.ДоступенДляВыбора,
		|	Виджеты.Заголовок,
		|	Виджеты.ЗаголовокЯзык1,
		|	Виджеты.Картинка,
		|	Виджеты.МК_Картинка,
		|	Виджеты.КомандаНастройки,
		|	Виджеты.МаксимальноеЗначение,
		|	Виджеты.МинимальноеЗначение,
		|	Виджеты.ПоложениеЗаголовка,
		|	Виджеты.ПредставлениеПустого,
		|	Виджеты.ПредставлениеПустогоЯзык1,
		|	Виджеты.ТипДиаграммы,
		|	Виджеты.Цвет,
		|	Виджеты.ШиринаСхемы,
		|	Виджеты.БлокиНавигации.(
		|		Ссылка,
		|		НомерСтроки,
		|		БлокНавигации),
		|	Виджеты.ВложенныеВиджеты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Виджет),
		|	Виджеты.ДополнительныеКоманды.(
		|		Ссылка,
		|		НомерСтроки,
		|		Команда),
		|	Виджеты.ДополнительныеПоказатели.(
		|		Ссылка,
		|		НомерСтроки,
		|		Показатель),
		|	Виджеты.Команды.(
		|		Ссылка,
		|		НомерСтроки,
		|		Команда),
		|	Виджеты.Компоновка.(
		|		Ссылка,
		|		НомерСтроки,
		|		ВертикальныйИнтервал,
		|		Виджет,
		|		Высота,
		|		ГоризонтальноеПоложениеВГруппе,
		|		ГоризонтальныйИнтервал,
		|		Группировка,
		|		Имя,
		|		МаксимальныйОтступ,
		|		Отступ,
		|		РастягиватьПоВертикали,
		|		РастягиватьПоГоризонтали,
		|		Родитель,
		|		Тип,
		|		ЦветВиджета,
		|		Ширина),
		|	Виджеты.ОсновныеПоказатели.(
		|		Ссылка,
		|		НомерСтроки,
		|		Показатель),
		|	Виджеты.ПоказателиЗаголовка.(
		|		Ссылка,
		|		НомерСтроки,
		|		Показатель),
		|	Виджеты.Предопределенный,
		|	Виджеты.ИмяПредопределенныхДанных,
		|	Виджеты.Представление
		|ИЗ
		|	Справочник.Виджеты КАК Виджеты
		|ГДЕ
		|	Виджеты.Ссылка В (&ВиджетыВключаяВторойУровень)
		|	И Виджеты.ПометкаУдаления = ЛОЖЬ");
	
	Если ВиджетыВключаяВторойУровень <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВиджетыВключаяВторойУровень", ВиджетыВключаяВторойУровень);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Виджеты.Ссылка В (&ВиджетыВключаяВторойУровень)", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Виджеты.ПометкаУдаления = ЛОЖЬ", "Виджеты.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Получим вспомогательные данные для формирования виджетов.
	БлокиНавигации = Новый Массив;
	КомандыВиджетов = Новый Массив;
	ПоказателиВиджетов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиБлоковНавигации = Выборка.БлокиНавигации.Выгрузить();
		Для Каждого СтрокаБлокаНавигации Из СтрокиБлоковНавигации Цикл
			
			Если ЗначениеЗаполнено(СтрокаБлокаНавигации.БлокНавигации)
				И БлокиНавигации.Найти(СтрокаБлокаНавигации.БлокНавигации) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			БлокиНавигации.Добавить(СтрокаБлокаНавигации.БлокНавигации);
			
		КонецЦикла;
		
		Команды = Выборка.Команды.Выгрузить();
		Для Каждого СтрокаКоманды Из Команды Цикл
			
			Если ЗначениеЗаполнено(СтрокаКоманды.Команда)
				И КомандыВиджетов.Найти(СтрокаКоманды.Команда) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КомандыВиджетов.Добавить(СтрокаКоманды.Команда);
			
		КонецЦикла;
		
		ДополнительныеКоманды = Выборка.ДополнительныеКоманды.Выгрузить();
		Для Каждого СтрокаКоманды Из ДополнительныеКоманды Цикл
			
			Если ЗначениеЗаполнено(СтрокаКоманды.Команда)
				И КомандыВиджетов.Найти(СтрокаКоманды.Команда) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КомандыВиджетов.Добавить(СтрокаКоманды.Команда);
			
		КонецЦикла;
		
		ОсновныеПоказатели = Выборка.ОсновныеПоказатели.Выгрузить();
		Для Каждого СтрокаПоказателя Из ОсновныеПоказатели Цикл
			
			Если ЗначениеЗаполнено(СтрокаПоказателя.Показатель)
				И ПоказателиВиджетов.Найти(СтрокаПоказателя.Показатель) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПоказателиВиджетов.Добавить(СтрокаПоказателя.Показатель);
			
		КонецЦикла;
		
		ПоказателиЗаголовка = Выборка.ПоказателиЗаголовка.Выгрузить();
		Для Каждого СтрокаПоказателя Из ПоказателиЗаголовка Цикл
			
			Если ЗначениеЗаполнено(СтрокаПоказателя.Показатель)
				И ПоказателиВиджетов.Найти(СтрокаПоказателя.Показатель) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПоказателиВиджетов.Добавить(СтрокаПоказателя.Показатель);
			
		КонецЦикла;
		
		ДополнительныеПоказатели = Выборка.ДополнительныеПоказатели.Выгрузить();
		Для Каждого СтрокаПоказателя Из ДополнительныеПоказатели Цикл
			
			Если ЗначениеЗаполнено(СтрокаПоказателя.Показатель)
				И ПоказателиВиджетов.Найти(СтрокаПоказателя.Показатель) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПоказателиВиджетов.Добавить(СтрокаПоказателя.Показатель);
			
		КонецЦикла;
		
	КонецЦикла;
	
	КомандыИПоказателиБлоков = Справочники.БлокиНавигации.КомандыИПоказатели(БлокиНавигации);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КомандыВиджетов, КомандыИПоказателиБлоков.Команды);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоказателиВиджетов, КомандыИПоказателиБлоков.Показатели);
	
	ДанныеКоманд = Справочники.КомандыВиджетов.ДанныеКоманд(КомандыВиджетов);
	
	ДанныеПоказателей = Справочники.ПоказателиВиджетов.ДанныеПоказателей(ПоказателиВиджетов);
	
	СУчетомНастроек = Истина;
	ДанныеБлоковНавигации = Справочники.БлокиНавигации.ДанныеБлоковНавигации(
		БлокиНавигации,
		СУчетомНастроек,
		ДанныеКоманд,
		ДанныеПоказателей);
	
	// Сформируем данные виджетов.
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		ДанныеВиджета = СформироватьДанныеВиджета(Выборка, ДанныеБлоковНавигации, ДанныеКоманд, ДанныеПоказателей);
		Если Не ДанныеВиджета.ВиджетДоступен Тогда
			Продолжить;
		КонецЕсли;
		
		ИнициализироватьВиджет(ДанныеВиджета);
		Если Не ДанныеВиджета.ВиджетДоступен Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджетов[ДанныеВиджета.Ссылка] = ДанныеВиджета;
		
	КонецЦикла;

	// Удалим данные виджетов, у которых нет ни одного вложенного доступного виджета.
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		ДанныеВиджета = ДанныеВиджетов[Выборка.Ссылка];
		Если ДанныеВиджета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьВложенныеВиджеты = Ложь;
		ЕстьДоступныеВложенныеВиджеты = Ложь;
		ВложенныеВиджеты = Выборка.ВложенныеВиджеты.Выгрузить();
		ВложенныеВиджеты.Сортировать("НомерСтроки Возр");
		Для Каждого СтрокаВиджета Из ВложенныеВиджеты Цикл
			
			ЕстьВложенныеВиджеты = Истина;
			ДанныеВложенногоВиджета = ДанныеВиджетов[СтрокаВиджета.Виджет];
			Если ДанныеВложенногоВиджета = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьДоступныеВложенныеВиджеты = Истина;
			ДанныеВиджета.ВложенныеВиджеты.Добавить(ДанныеВложенногоВиджета);
			
		КонецЦикла;
		Если ЕстьВложенныеВиджеты И Не ЕстьДоступныеВложенныеВиджеты Тогда
			ДанныеВиджетов.Удалить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеВиджетов;
	
КонецФункции

// Формирует данные всех виджетов.
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение - Данные виджетов:
// 	 * Ключ - Строка - Виджет.
// 	 * Значение -  Структура - Данные виджета. См. Справочники.Виджеты.НовыйДанныеВиджета.
//
Функция ДанныеВсехВиджетов() Экспорт
	
	ДанныеВсехВиджетов = ДанныеВиджетов();
	
	Возврат ДанныеВсехВиджетов;
	
КонецФункции

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	// Руководителя
	ВиджетОбъект = БлокНавигацииРуководителя.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Руководителя'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.БлокНавигации;
	ВиджетОбъект.ВысотаСхемы = 3;
	ВиджетОбъект.ДоступенДляВыбора = Ложь;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.КомандаНастройки = "e1cib/command/РегистрСведений.НастройкиБлоковНавигации.Команда.НастроитьБлокиНавигации";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.РеестрыРуководителя;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.БлокСправочники;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Настройки;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Классификаторы;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Предприятие;
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Сотрудника
	ВиджетОбъект = БлокНавигацииСотрудника.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Сотрудника'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.БлокНавигации;
	ВиджетОбъект.ВысотаСхемы = 3;
	ВиджетОбъект.ДоступенДляВыбора = Ложь;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.КомандаНастройки = "e1cib/command/РегистрСведений.НастройкиБлоковНавигации.Команда.НастроитьБлокиНавигации";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.РеестрыСотрудника;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.БлокСправочники;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Настройки;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Классификаторы;
	СтрокаБлока = ВиджетОбъект.БлокиНавигации.Добавить();
	СтрокаБлока.БлокНавигации = Справочники.БлокиНавигации.Предприятие;
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Ежедневные отчеты
	ВиджетОбъект = ЕжедневныеОтчеты.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Ежедневные отчеты'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Диаграмма;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЕжедневныеОтчеты";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 10;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "ГистограммаСНакоплением";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	СтрокаБлока = ВиджетОбъект.Команды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ЕжедневныеОтчеты;
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЕжедневныеОтчетыУчтено;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЕжедневныеОтчетыОсталось;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЕжедневныеОтчетыНетОтчета;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне
	ВиджетОбъект = ЗадачиМне.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗадачу;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеПоступилиОбновления;
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНовые;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеПросроченные;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне (диаграмма, по видам)
	ВиджетОбъект = ЗадачиМнеДиаграммаЗадачиПоВидам.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне (диаграмма, по видам)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.ДиаграммаСЛегендой;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "Кольцевая";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 2;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаИсполнение;
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаОзнакомление;
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаРегистрацию;
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеДругие;
	
	ВиджетОбъект.Команды.Очистить();
	СтрокаБлока = ВиджетОбъект.Команды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ЗадачиМне;
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаРассмотрение;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаСогласование;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеНаУтверждение;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне (диаграмма, по сроку)
	ВиджетОбъект = ЗадачиМнеДиаграммаЗадачиПоСроку.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне (диаграмма, по сроку)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.ДиаграммаСЛегендой;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "Кольцевая";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 2;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	СтрокаБлока = ВиджетОбъект.Команды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ЗадачиМне;
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеРуководителяПросроченные;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеРуководителяИстекаетСрок;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеРуководителяВСрок;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне (поступили обновления)
	ВиджетОбъект = ЗадачиМнеПоступилиОбновления.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне (поступили обновления)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеПоступилиОбновления;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне руководителя (заголовок)
	ВиджетОбъект = ЗадачиМнеРуководителяЗаголовок.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне руководителя (заголовок)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Заголовок;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Ложь;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗадачу;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеРуководителяВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне руководителя (новые)
	ВиджетОбъект = ЗадачиМнеРуководителяНовые.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне руководителя (новые)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеРуководителяНовые;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне (широкий)
	ВиджетОбъект = ЗадачиМнеШирокий.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне (широкий)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Комплексный;
	ВиджетОбъект.ВысотаСхемы = 2;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 2;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Родитель = "%РОДИТЕЛЬ%";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Вертикальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "Истина";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "Нет";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеРуководителяЗаголовок";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеРуководителяЗаголовок;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Вертикальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "Половинный";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "0";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Родитель = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Горизонтальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "Одинарный";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеРуководителяНовые";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеРуководителяНовые;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Синий;
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеПоступилиОбновления";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеПоступилиОбновления;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Оранжевый;
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "СтрокаВиджетаЗадачиМне2";
	СтрокаКомпоновки.Родитель = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Горизонтальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "Одинарный";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеДиаграммаЗадачиПоСроку";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне2";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеДиаграммаЗадачиПоСроку;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Зеленый;
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеВсего;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи мне (широкий, по видам задач)
	ВиджетОбъект = ЗадачиМнеШирокийПоВидамЗадач.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи мне (широкий, по видам задач)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Комплексный;
	ВиджетОбъект.ВысотаСхемы = 2;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиМне";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 2;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Родитель = "%РОДИТЕЛЬ%";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Вертикальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "Истина";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "Нет";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеРуководителяЗаголовок";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеРуководителяЗаголовок;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Вертикальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "Половинный";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "0";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Родитель = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Горизонтальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "Одинарный";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеРуководителяНовые";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеРуководителяНовые;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Синий;
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеПоступилиОбновления";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне1";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеПоступилиОбновления;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Оранжевый;
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "СтрокаВиджетаЗадачиМне2";
	СтрокаКомпоновки.Родитель = "ГруппировкаДанныхВиджетаЗадачиМне";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Горизонтальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "Одинарный";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиМнеДиаграммаЗадачиПоВидам";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиМне2";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиМнеДиаграммаЗадачиПоВидам;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Зеленый;
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиМнеВсего;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи от меня
	ВиджетОбъект = ЗадачиОтМеня.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи от меня'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиОтМеня";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗадачу;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиОтМеняЧерновики;
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиОтМеняНовые;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиОтМеняПросрочено;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиОтМеняВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи подчиненных
	ВиджетОбъект = ЗадачиПодчиненных.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи подчиненных'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиПодчиненных";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗадачу;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхНовые;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхПросрочено;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи подчиненных (заголовок)
	ВиджетОбъект = ЗадачиПодчиненныхЗаголовок.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи подчиненных (заголовок)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Заголовок;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Ложь;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиПодчиненных";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗадачу;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи подчиненных (новые)
	ВиджетОбъект = ЗадачиПодчиненныхНовые.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи подчиненных (новые)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиПодчиненных";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхНовые;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи подчиненных (просрочено)
	ВиджетОбъект = ЗадачиПодчиненныхПросрочено.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи подчиненных (просрочено)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиПодчиненных";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхПросрочено;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Задачи подчиненных (широкий)
	ВиджетОбъект = ЗадачиПодчиненныхШирокий.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Задачи подчиненных (широкий)'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Комплексный;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЗадачиПодчиненных";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 2;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ГруппировкаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Родитель = "%РОДИТЕЛЬ%";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Вертикальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "Истина";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "Нет";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "0";
	СтрокаКомпоновки.МаксимальныйОтступ = "0";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиПодчиненныхЗаголовок";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиПодчиненныхЗаголовок;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "СтрокаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Родитель = "ГруппировкаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Группа;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ПустаяСсылка();
	СтрокаКомпоновки.Группировка = "Горизонтальная";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "Одинарный";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "0";
	СтрокаКомпоновки.МаксимальныйОтступ = "";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.ПустаяСсылка();
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиПодчиненныхНовые";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиПодчиненныхНовые;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Оранжевый;
	СтрокаКомпоновки = ВиджетОбъект.Компоновка.Добавить();
	СтрокаКомпоновки.Имя = "ЗадачиПодчиненныхПросрочено";
	СтрокаКомпоновки.Родитель = "СтрокаВиджетаЗадачиПодчиненных";
	СтрокаКомпоновки.Тип = Перечисления.ТипыЭлементовРабочегоСтола.Виджет;
	СтрокаКомпоновки.Виджет = Справочники.Виджеты.ЗадачиПодчиненныхПросрочено;
	СтрокаКомпоновки.Группировка = "";
	СтрокаКомпоновки.РастягиватьПоГоризонтали = "";
	СтрокаКомпоновки.РастягиватьПоВертикали = "";
	СтрокаКомпоновки.ВертикальныйИнтервал = "";
	СтрокаКомпоновки.ГоризонтальныйИнтервал = "";
	СтрокаКомпоновки.Ширина = "";
	СтрокаКомпоновки.Высота = "";
	СтрокаКомпоновки.Отступ = "1";
	СтрокаКомпоновки.МаксимальныйОтступ = "2";
	СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе = "";
	СтрокаКомпоновки.ЦветВиджета = Перечисления.ЦветаВиджетов.Желтый;
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЗадачиПодчиненныхВсего;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Календарь
	ВиджетОбъект = Календарь.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Календарь'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетКалендарь";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетКалендарь";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'В ближайшее время нет событий'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьЗаписьКалендаря;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.КалендарьБлижайшие;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.КалендарьВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Календарь или мероприятия
	ВиджетОбъект = КалендарьИлиМероприятия.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Календарь или мероприятия'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Альтернативный;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетКалендарь";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетКалендарь";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	СтрокаБлока = ВиджетОбъект.ВложенныеВиджеты.Добавить();
	СтрокаБлока.Виджет = Справочники.Виджеты.Календарь;
	СтрокаБлока = ВиджетОбъект.ВложенныеВиджеты.Добавить();
	СтрокаБлока.Виджет = Справочники.Виджеты.Мероприятия;
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Контроль
	ВиджетОбъект = Контроль.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Контроль'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетКонтроль";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетКонтроль";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Нет ничего для контроля'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ПоставитьНаКонтроль;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.КонтрольПросрочено;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.КонтрольБлижайшие;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.КонтрольВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Мероприятия
	ВиджетОбъект = Мероприятия.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Мероприятия'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетКалендарь";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетКалендарь";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Нет ближайших мероприятий'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьМероприятие;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МероприятияБлижайшие;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МероприятийВБлижайшийМесяц;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Мои документы
	ВиджетОбъект = МоиДокументы.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Мои документы'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Показатели;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = НСтр("ru = 'Мои документы'");
	ВиджетОбъект.Картинка = "";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетМоиДокументы";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = "";
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ДокументыПредприятияСоздать;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МоиДокументыПросрочено;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МоиДокументыБезОтвета;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МоиДокументыИстекают;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.МоиДокументыВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Отсутствия
	ВиджетОбъект = Отсутствия.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Отсутствия'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = НСтр("ru = 'Отсутствия'");
	ВиджетОбъект.Картинка = "ПустойВиджетОтсутствия";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетОтсутствия";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Сейчас нет отсутствующих'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.ОтсутствияСотрудниковСоздать;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.БлижайшиеОтсутствия;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ОтсутствияВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Почта
	ВиджетОбъект = Почта.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Почта'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетПочта";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетПочта";
	ВиджетОбъект.КомандаНастройки = "e1cib/command/РегистрСведений.ПапкиПисемВиджетаПочта.Команда.НастроитьПапкиПисемВиджетаПочта";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Нет новых писем'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.НаписатьПисьмо;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ПочтаПоследние;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ПочтаВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Форум
	ВиджетОбъект = Форум.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Форум'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетФорум";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетФорум";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Нет новых сообщений'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	СтрокаБлока = ВиджетОбъект.ДополнительныеКоманды.Добавить();
	СтрокаБлока.Команда = Справочники.КомандыВиджетов.СоздатьТемуФорума;
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ФорумНовыеОтветы;
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ФорумПоследние;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ФорумВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
	// Я редактирую
	ВиджетОбъект = ЯРедактирую.ПолучитьОбъект();
	ВиджетОбъект.Наименование = НСтр("ru = 'Я редактирую'");
	ВиджетОбъект.Вид = Перечисления.ВидыВиджетов.Список;
	ВиджетОбъект.ВысотаСхемы = 1;
	ВиджетОбъект.ДоступенДляВыбора = Истина;
	ВиджетОбъект.Заголовок = "";
	ВиджетОбъект.Картинка = "ПустойВиджетЯРедактирую";
	ВиджетОбъект.МК_Картинка = "МК_ВиджетЯРедактирую";
	ВиджетОбъект.КомандаНастройки = "";
	ВиджетОбъект.МаксимальноеЗначение = 0;
	ВиджетОбъект.МинимальноеЗначение = 0;
	ВиджетОбъект.ПоложениеЗаголовка = "";
	ВиджетОбъект.ПредставлениеПустого = НСтр("ru = 'Нет файлов на редактировании'");
	ВиджетОбъект.ТипДиаграммы = "";
	ВиджетОбъект.Цвет = Перечисления.ЦветаВиджетов.Авто;
	ВиджетОбъект.ШиринаСхемы = 1;
	ВиджетОбъект.БлокиНавигации.Очистить();
	
	ВиджетОбъект.ВложенныеВиджеты.Очистить();
	
	ВиджетОбъект.ДополнительныеКоманды.Очистить();
	
	ВиджетОбъект.ДополнительныеПоказатели.Очистить();
	
	ВиджетОбъект.Команды.Очистить();
	
	ВиджетОбъект.Компоновка.Очистить();
	
	ВиджетОбъект.ОсновныеПоказатели.Очистить();
	СтрокаБлока = ВиджетОбъект.ОсновныеПоказатели.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЯРедактируюПервые;
	
	ВиджетОбъект.ПоказателиЗаголовка.Очистить();
	СтрокаБлока = ВиджетОбъект.ПоказателиЗаголовка.Добавить();
	СтрокаБлока.Показатель = Справочники.ПоказателиВиджетов.ЯРедактируюВсего;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВиджетОбъект);
	
КонецПроцедуры

// Инициализирует данные виджета.
Процедура ИнициализироватьВиджет(ДанныеВиджета) Экспорт
	
	ДанныеВиджета.ПространствоИмен = "Виджет" + ДанныеВиджета.Имя;
	Если ДанныеВиджета.ОсновнойШрифт = Неопределено Тогда
		ДанныеВиджета.ОсновнойШрифт = Перечисления.ВидыВиджетов.ОсновнойШрифтВиджета(ДанныеВиджета.Вид);
	КонецЕсли;
	Если ДанныеВиджета.ВспомогательныйШрифт = Неопределено Тогда
		ДанныеВиджета.ВспомогательныйШрифт = Перечисления.ВидыВиджетов.ВспомогательныйШрифтВиджета(ДанныеВиджета.Вид);
	КонецЕсли;
	
	Если ДанныеВиджета.Картинка <> Неопределено И ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.Команда Тогда
		ДанныеВиджета.Команды[0].Картинка = ДанныеВиджета.Картинка;
		ДанныеВиджета.Картинка = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеВиджета.Заголовок) И ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.Команда Тогда
		ДанныеВиджета.Команды[0].Заголовок = ДанныеВиджета.Заголовок;
		ДанныеВиджета.Заголовок = "";
	КонецЕсли;
	
	Если ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.Заголовок И ДанныеВиджета.Команды.Количество() = 0 Тогда
		ДанныеКоманды = Справочники.КомандыВиджетов.ДанныеКомандыНичегоНеДелать(ДанныеВиджета.Заголовок);
		ДанныеВиджета.Команды.Добавить(ДанныеКоманды);
	КонецЕсли;
	
	Если ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.Комплексный Тогда
		
		ДанныеВиджета.ЭлементыКомплексногоВиджета = ЭлементыКомплексногоВиджета(ДанныеВиджета.Компоновка);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру данных виджета.
// 
// Возвращаемое значение:
//  Структура - Новый данные виджета:
//   * Имя - Строка.
//   * Ссылка - СправочникСсылка.Виджеты.
//   * Наименование - Строка.
//   * Вид - ПеречислениеСсылка.ВидыВиджетов.
//   * Заголовок - Строка.
//   * Картинка - Картинка, Неопределено.
//   * ПоложениеЗаголовка - Строка.
//   * ПредставлениеПустого - Строка.
//   * МинимальноеЗначение - Неопределено.
//   * МаксимальноеЗначение - Неопределено.
//   * ТипДиаграммы - Неопределено.
//   * ВысотаСхемы - Число.
//   * ШиринаСхемы - Число.
//   * КомандаНастройки - Строка.
//   * Компоновка - Строка.
//   * ДоступенДляВыбора - Булево.
//   * Команды - Массив.
//   * ДополнительныеКоманды - Массив.
//   * ПоказателиЗаголовка - Массив.
//   * ОсновныеПоказатели - Массив.
//   * ДополнительныеПоказатели - Массив.
//   * БлокиНавигации - Массив.
//   * ВложенныеВиджеты - Массив.
//   * ЭлементыКомплексногоВиджета - ТаблицаЗначений. См. Справочники.РабочиеСтолы.НовыйЭлементыРабочегоСтола().
//   * ПространствоИмен - Строка, Неопределено.
//   * СчетчикЭлементов - Соответствие.
//   * ОсновнаяГруппа - ГруппаФормы, Неопределено.
//   * Цвет - ПеречислениеСсылка.ЦветаВиджетов.
//   * ОсновнойШрифт - Шрифт, Неопределено.
//   * ВспомогательныйШрифт - Шрифт, Неопределено.
//   * ВиджетДоступен - Булево.
Функция НовыйДанныеВиджета() Экспорт
	
	ДанныеВиджета = Новый Структура;
	ДанныеВиджета.Вставить("Имя", "");
	ДанныеВиджета.Вставить("Ссылка", Справочники.Виджеты.ПустаяСсылка());
	ДанныеВиджета.Вставить("Наименование", "");
	ДанныеВиджета.Вставить("Вид", Перечисления.ВидыВиджетов.ПустаяСсылка());
	ДанныеВиджета.Вставить("Заголовок", "");
	ДанныеВиджета.Вставить("Картинка");
	ДанныеВиджета.Вставить("МК_Картинка");
	ДанныеВиджета.Вставить("ПоложениеЗаголовка", "Верх");
	ДанныеВиджета.Вставить("ПредставлениеПустого", "");
	ДанныеВиджета.Вставить("МинимальноеЗначение", Неопределено);
	ДанныеВиджета.Вставить("МаксимальноеЗначение", Неопределено);
	ДанныеВиджета.Вставить("ТипДиаграммы", Неопределено);
	ДанныеВиджета.Вставить("ВысотаСхемы", 0);
	ДанныеВиджета.Вставить("ШиринаСхемы", 0);
	ДанныеВиджета.Вставить("КомандаНастройки", "");
	ДанныеВиджета.Вставить("Компоновка", "");
	ДанныеВиджета.Вставить("ДоступенДляВыбора", Ложь);
	
	ДанныеВиджета.Вставить("Команды", Новый Массив);
	ДанныеВиджета.Вставить("ДополнительныеКоманды", Новый Массив);
	ДанныеВиджета.Вставить("ПоказателиЗаголовка", Новый Массив);
	ДанныеВиджета.Вставить("ОсновныеПоказатели", Новый Массив);
	ДанныеВиджета.Вставить("ДополнительныеПоказатели", Новый Массив);
	ДанныеВиджета.Вставить("БлокиНавигации", Новый Массив);
	ДанныеВиджета.Вставить("ВложенныеВиджеты", Новый Массив);
	ДанныеВиджета.Вставить("ЭлементыКомплексногоВиджета", Справочники.РабочиеСтолы.НовыйЭлементыРабочегоСтола());
	
	ДанныеВиджета.Вставить("ПространствоИмен");
	ДанныеВиджета.Вставить("СчетчикЭлементов", Новый Соответствие);
	ДанныеВиджета.Вставить("ОсновнаяГруппа");
	ДанныеВиджета.Вставить("Цвет", Перечисления.ЦветаВиджетов.Авто);
	ДанныеВиджета.Вставить("ОсновнойШрифт");
	ДанныеВиджета.Вставить("ВспомогательныйШрифт");
	ДанныеВиджета.Вставить("ВиджетДоступен", Истина);
	
	Возврат ДанныеВиджета;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Виджеты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Виджеты КАК Виджеты
	|ГДЕ
	|	НЕ Виджеты.ПометкаУдаления
	|	И Виджеты.Наименование ПОДОБНО &СтрокаПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	Виджеты.Наименование";
	
	ОбъектМетаданных = Метаданные.Справочники.Виджеты;
	Если Не МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(ОбъектМетаданных.ТабличныеЧасти.Найти("Представления") = Неопределено) Тогда
		
		Если МультиязычностьСервер.ИспользуетсяПервыйДополнительныйЯзык() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"Виджеты.Наименование ПОДОБНО &СтрокаПоиска",
				"(Виджеты.Наименование ПОДОБНО &СтрокаПоиска ИЛИ Виджеты.НаименованиеЯзык1 ПОДОБНО &СтрокаПоиска)");
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует данные поставляемого виджета из строки поставляемых данных.
// 
// Параметры:
// 	Выборка - ВыборкаИзРезультатаЗапроса.
// 	
// Возвращаемое значение:
// 	Структура - Данные виджета. См. Справочники.Виджеты.НовыйДанныеВиджета.
//
Функция СформироватьДанныеВиджета(Выборка, ДанныеБлоковНавигации, ДанныеКоманд, ДанныеПоказателей)
	
	ДанныеВиджета = НовыйДанныеВиджета();
	ДанныеВиджета.Имя = ?(ЗначениеЗаполнено(Выборка.ИмяПредопределенныхДанных),
		Выборка.ИмяПредопределенныхДанных,
		СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", ""));
	ДанныеВиджета.Ссылка = Выборка.Ссылка;
	
	ДанныеВиджета.Наименование = Выборка.Наименование;
	ДанныеВиджета.Заголовок = Выборка.Заголовок;
	ДанныеВиджета.ПредставлениеПустого = Выборка.ПредставлениеПустого;

	КонфигурацияИспользуетТолькоОдинЯзык = МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(Ложь);
	Если Не КонфигурацияИспользуетТолькоОдинЯзык И Не МультиязычностьСервер.ЭтоОсновнойЯзык() Тогда
		ДанныеВиджета.Наименование = Выборка.НаименованиеЯзык1;
		ДанныеВиджета.Заголовок = Выборка.ЗаголовокЯзык1;
		ДанныеВиджета.ПредставлениеПустого = Выборка.ПредставлениеПустогоЯзык1;
	КонецЕсли;
	
	ДанныеВиджета.ПоложениеЗаголовка = Выборка.ПоложениеЗаголовка;
	ДанныеВиджета.КомандаНастройки = Выборка.КомандаНастройки;
	ДанныеВиджета.Компоновка = Выборка.Компоновка.Выгрузить();
	ДанныеВиджета.Компоновка.Сортировать("НомерСтроки Возр");
	ДанныеВиджета.Вид = Выборка.Вид;
	ДанныеВиджета.Цвет = Выборка.Цвет;
	ДанныеВиджета.ДоступенДляВыбора = Выборка.ДоступенДляВыбора;
	ДанныеВиджета.МинимальноеЗначение = Выборка.МинимальноеЗначение;
	ДанныеВиджета.МаксимальноеЗначение = Выборка.МаксимальноеЗначение;
	ДанныеВиджета.ВысотаСхемы = Выборка.ВысотаСхемы;
	ДанныеВиджета.ШиринаСхемы = Выборка.ШиринаСхемы;
	ДанныеВиджета.МаксимальноеЗначение = Выборка.МаксимальноеЗначение;
	
	Если ЗначениеЗаполнено(Выборка.Картинка) Тогда
		ДанныеВиджета.Картинка = БиблиотекаКартинок[Выборка.Картинка];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МК_Картинка) Тогда
		ДанныеВиджета.МК_Картинка = БиблиотекаКартинок[Выборка.МК_Картинка];
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Выборка.ТипДиаграммы) Тогда
		ДанныеВиджета.ТипДиаграммы = ТипДиаграммы[Выборка.ТипДиаграммы];
	КонецЕсли;
	
	Команды = Выборка.Команды.Выгрузить();
	Команды.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаКоманды Из Команды Цикл
		
		ДанныеКоманды = ДанныеКоманд[СтрокаКоманды.Команда];
		Если ДанныеКоманды = Неопределено Тогда
			ДанныеВиджета.ВиджетДоступен = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджета.Команды.Добавить(ДанныеКоманды);
		
	КонецЦикла;
	
	ОсновныеПоказатели = Выборка.ОсновныеПоказатели.Выгрузить();
	ОсновныеПоказатели.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаПоказателя Из ОсновныеПоказатели Цикл
		
		ДанныеПоказателя = Справочники.ПоказателиВиджетов.ДанныеПоказателя(СтрокаПоказателя.Показатель);
		Если ДанныеПоказателя = Неопределено Тогда
			ДанныеВиджета.ВиджетДоступен = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджета.ОсновныеПоказатели.Добавить(ДанныеПоказателя);
		
	КонецЦикла;
	
	ПоказателиЗаголовка = Выборка.ПоказателиЗаголовка.Выгрузить();
	ПоказателиЗаголовка.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаПоказателя Из ПоказателиЗаголовка Цикл
		
		ДанныеПоказателя = ДанныеПоказателей[СтрокаПоказателя.Показатель];
		Если ДанныеПоказателя = Неопределено Тогда
			ДанныеВиджета.ВиджетДоступен = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджета.ПоказателиЗаголовка.Добавить(ДанныеПоказателя);
		
	КонецЦикла;
	
	ДополнительныеПоказатели = Выборка.ДополнительныеПоказатели.Выгрузить();
	ДополнительныеПоказатели.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаПоказателя Из ДополнительныеПоказатели Цикл
		
		ДанныеПоказателя = ДанныеПоказателей[СтрокаПоказателя.Показатель];
		Если ДанныеПоказателя = Неопределено Тогда
			ДанныеВиджета.ВиджетДоступен = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджета.ДополнительныеПоказатели.Добавить(ДанныеПоказателя);
		
	КонецЦикла;
	
	ЕстьБлокиНавигации = Ложь;
	ЕстьДоступныеБлокиНавигации = Ложь;
	БлокиНавигации = Выборка.БлокиНавигации.Выгрузить();
	БлокиНавигации.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаБлокаНавигации Из БлокиНавигации Цикл
		
		ЕстьБлокиНавигации = Истина;
		ДанныеБлокаНавигации = ДанныеБлоковНавигации[СтрокаБлокаНавигации.БлокНавигации];
		Если ДанныеБлокаНавигации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьДоступныеБлокиНавигации = Истина;
		ДанныеВиджета.БлокиНавигации.Добавить(ДанныеБлокаНавигации);
		
	КонецЦикла;
	Если ЕстьБлокиНавигации И Не ЕстьДоступныеБлокиНавигации Тогда
		ДанныеВиджета.ВиджетДоступен = Ложь;
	КонецЕсли;
	
	ДополнительныеКоманды = Выборка.ДополнительныеКоманды.Выгрузить();
	ДополнительныеКоманды.Сортировать("НомерСтроки Возр");
	Для Каждого СтрокаКоманды Из ДополнительныеКоманды Цикл
		
		ДанныеКоманды = ДанныеКоманд[СтрокаКоманды.Команда];
		Если ДанныеКоманды = Неопределено Тогда
			ДанныеВиджета.ВиджетДоступен = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеВиджета.ДополнительныеКоманды.Добавить(ДанныеКоманды);
		
	КонецЦикла;
	
	Если (ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.Диаграмма
		Или ДанныеВиджета.Вид = Перечисления.ВидыВиджетов.ДиаграммаСЛегендой)
		И ДанныеВиджета.ТипДиаграммы <> ТипДиаграммы.ГистограммаСНакоплением
		И ДанныеВиджета.ТипДиаграммы <> ТипДиаграммы.Кольцевая Тогда
		ДанныеВиджета.ВиджетДоступен = Ложь;
	КонецЕсли;
	
	Возврат ДанныеВиджета
	
КонецФункции

Функция ЭлементыКомплексногоВиджета(ТаблицаКомпоновки)
	
	ЭлементыКомплексногоВиджета = Справочники.РабочиеСтолы.НовыйЭлементыРабочегоСтола();
	
	Для Каждого СтрокаКомпоновки Из ТаблицаКомпоновки Цикл
		
		ЭлементРабочегоСтола = ЭлементыКомплексногоВиджета.Добавить();
		ЭлементРабочегоСтола.Родитель = СтрокаКомпоновки.Родитель;
		ЭлементРабочегоСтола.Тип = СтрокаКомпоновки.Тип;
		ЭлементРабочегоСтола.Имя = СтрокаКомпоновки.Имя;
		ЭлементРабочегоСтола.Виджет = СтрокаКомпоновки.Виджет;
		ЭлементРабочегоСтола.ЦветВиджета = СтрокаКомпоновки.ЦветВиджета;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.Ширина) Тогда
			ЭлементРабочегоСтола.Ширина = Число(СтрокаКомпоновки.Ширина);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.Высота) Тогда
			ЭлементРабочегоСтола.Высота = Число(СтрокаКомпоновки.Высота);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.Отступ) Тогда
			ЭлементРабочегоСтола.Отступ = Число(СтрокаКомпоновки.Отступ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.МаксимальныйОтступ) Тогда
			ЭлементРабочегоСтола.МаксимальныйОтступ = Число(СтрокаКомпоновки.МаксимальныйОтступ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.Группировка) Тогда
			ЭлементРабочегоСтола.Группировка =
				ГруппировкаПодчиненныхЭлементовФормы[СтрокаКомпоновки.Группировка];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.РастягиватьПоГоризонтали) Тогда
			ЭлементРабочегоСтола.РастягиватьПоГоризонтали =
				Булево(СтрокаКомпоновки.РастягиватьПоГоризонтали);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.РастягиватьПоВертикали) Тогда
			ЭлементРабочегоСтола.РастягиватьПоВертикали =
				Булево(СтрокаКомпоновки.РастягиватьПоВертикали);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.ВертикальныйИнтервал) Тогда
			ЭлементРабочегоСтола.ВертикальныйИнтервал =
				ИнтервалМеждуЭлементамиФормы[СтрокаКомпоновки.ВертикальныйИнтервал];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.ГоризонтальныйИнтервал) Тогда
			ЭлементРабочегоСтола.ГоризонтальныйИнтервал =
				ИнтервалМеждуЭлементамиФормы[СтрокаКомпоновки.ГоризонтальныйИнтервал];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе) Тогда
			ЭлементРабочегоСтола.ГоризонтальноеПоложениеВГруппе =
				ГоризонтальноеПоложениеЭлемента[СтрокаКомпоновки.ГоризонтальноеПоложениеВГруппе];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭлементыКомплексногоВиджета;
	
КонецФункции

#КонецОбласти

#КонецЕсли