
&ИзменениеИКонтроль("ИзменитьОтносительныйСрок")
Процедура ЦППК_ИзменитьОтносительныйСрок(Дни, Часы, Минуты, Длительность)

#Удаление
	Если ЗначениеЗаполнено(Минуты) Тогда
		Минуты = Минуты + Длительность;
	ИначеЕсли ЗначениеЗаполнено(Часы) Тогда
		Часы = Часы + Длительность;
	Иначе
		Дни = Дни + Длительность;
	КонецЕсли;
#КонецУдаления
#Вставка
//++AxelSoft Шарапова 30.10.2024 САНФ-029233
		Дни = Дни + Длительность;
//--AxelSoft Шарапова 30.10.2024 САНФ-029233
#КонецВставки    

	Если Минуты > 59 Тогда
		Минуты = Минуты - 60;
		Часы = Часы + 1;
	КонецЕсли;

	Если Часы > 23 Тогда
		Часы = Часы - 23;
		Дни = Дни + 1;
	КонецЕсли;

	Если Дни > 999 Тогда
		Дни = 999;
	КонецЕсли;

КонецПроцедуры
