
#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("СотрудникиВключаяЗамещения")
Функция ЦППК_СотрудникиВключаяЗамещения(ТекущийПользователь, ДляМероприятий)
	
	#Удаление
	ПользовательИЕгоСотрудники = Сотрудники.ПользовательИЕгоСотрудники(
	ТекущийПользователь);
	#КонецУдаления
	#Вставка
	ВсеПользователиИЕгоСотрудники = Сотрудники.ПользовательИЕгоСотрудники(
	ТекущийПользователь);
	
	ПользовательИЕгоСотрудники = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ВсеПользователиИЕгоСотрудники);
	#КонецВставки
	
	// Получим заместителей и помощников.
	ОбластиЗамещения = Новый Массив;
	ОбластиЗамещения.Добавить(Справочники.ОбластиЗамещения.ВсеОбласти);

	Если ДляМероприятий Тогда
		ОбластиЗамещения.Добавить(Справочники.ОбластиЗамещения.Мероприятия);
	Иначе
		ОбластиЗамещения.Добавить(Справочники.ОбластиЗамещения.Документы);
	КонецЕсли;

	АктуальныеЗамещения = Справочники.ЗамещающиеИПомощники.АктуальныеЗамещения(
	ПользовательИЕгоСотрудники, ОбластиЗамещения);
	ВсеЗамещающиеИПомощники = АктуальныеЗамещения.ВыгрузитьКолонку("Сотрудник");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПользовательИЕгоСотрудники, ВсеЗамещающиеИПомощники, Истина);

	Возврат ПользовательИЕгоСотрудники;

КонецФункции

#КонецОбласти