// Модуль устарел и будет удален.

// Устарела.
// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаДляАвтозаполнения.
//
Функция ПолучитьЗначениеРеквизитаДляАвтозаполнения(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаДляАвтозаполнения(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// Устарела.
// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеДопРеквизитаДляЗамены
//
Функция ПолучитьЗначениеДопРеквизитаДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт 
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеДопРеквизитаДляЗамены(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// Устарела.
// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеКонтактнойИнформацииДляЗамены
//
Функция ПолучитьЗначениеКонтактнойИнформацииДляЗамены(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеКонтактнойИнформацииДляЗамены(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции

// Устарела.
// См. АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения
//
Функция ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения(Файл, НазваниеПоля, ФактическийВладелецФайла) Экспорт
	
	Возврат АвтозаполнениеШаблоновФайловВызовСервераПовтИспВызов.ПолучитьЗначениеРеквизитаТабличнойЧастиДляАвтозаполнения(
			Файл, НазваниеПоля, ФактическийВладелецФайла);
	
КонецФункции
