////////////////////////////////////////////////////////////////////////////////
// Работа с анализом текста (клиент).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Находит дату в переданном текста.
// 
// Параметры:
//  Текст - Строка - Обрабатываемый текст.
//  ДатаТекста - Дата - Дата, к которой относится текст.
// 
// Возвращаемое значение:
//  Дата, Неопределено - Найденная дата в тексте.
//
Функция НайтиДату(Текст, ДатаТекста) Экспорт
	
	НайденнаяДата = РаботаСАнализомТекстаВызовСервера.НайтиДату(Текст, ДатаТекста);
	
	Возврат НайденнаяДата;
	
КонецФункции

// Находит событие в переданном текста.
//
// Параметры:
//  Текст - Строка - Обрабатываемый текст.
//  ДатаТекста - Дата - Дата, к которой относится текст.
// 
// Возвращаемое значение:
//  Структура, Неопределено - Найденное событие в тексте:
//   * Тип - Строка - Тип найденного в тексте события.
//   * Дата - Строка - Дата события.
//   * Время - Строка - Время события.
//   * Начало - Дата - Дата начала события.
//   * Конец - Дата - Дата окончания события.
//   * Место - Строка - Место проведения события.
//   * Email - Строка - Email для связи.
//   * Текст - Строка - Часть текста, соответствующая событию.
//
Функция НайтиСобытие(Текст, ДатаТекста) Экспорт
	
	НайденноеСобытие = РаботаСАнализомТекстаВызовСервера.НайтиСобытие(Текст, ДатаТекста);
	
	Возврат НайденноеСобытие;
	
КонецФункции

#КонецОбласти