// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Проверка действительности участников.
// 
// Параметры:
//  ОбъектФормы - ДанныеФормыСтруктура - Объект формы инициаторы проверки.
// 
// Возвращаемое значение:
//  см. РаботаСУчастниками.ПроверитьДействительностьУчастников
//
Функция ПроверитьДействительностьУчастников(Знач ОбъектФормы) Экспорт
	
	Возврат РаботаСУчастниками.ПроверитьДействительностьУчастников(ОбъектФормы);
	
КонецФункции

// Заполнить результат проверки участников по правилам коммуникаций.
// 
// Параметры:
//  УчастникиПоВидамиУчастников - Соответствие Из КлючИЗначение - участники по видам участников:
//   * Ключ - СправочникСсылка.ВидыУчастниковЗадач
//   * Значение - Структура:
//     ** КонтекстПравилКоммуникации - Структура
//     ** Участники - Массив Из СправочникСсылка
//  РезультатПроверкиПравилКоммуникации - Структура:
//   * УчастникиПодходят - Булево - Признак того, что все участники подходят по правилам коммуникаций.
//   * НеПрошедшиеПроверку - Массив Из см. РаботаСУчастниками.НеПрошедшийПроверкуПКУчастник
//
Процедура ЗаполнитьРезультатПроверкиУчастниковПоПравиламКоммуникаций(УчастникиПоВидамиУчастников,
	РезультатПроверкиПравилКоммуникации) Экспорт
	
	РаботаСУчастниками.ЗаполнитьРезультатПроверкиУчастниковПоПравиламКоммуникаций(УчастникиПоВидамиУчастников,
		РезультатПроверкиПравилКоммуникации);
	
КонецПроцедуры

#КонецОбласти
