#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Делает первоначальное заполнение справочника, согласно Приложению
// Приказа Минцифры России о требованиях к обмену электронными документами
// Учитывает разные версии формата МЭДО
// https://gosedo.ru/законодательство/
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	Если Не МЭДОПереопределяемый.ЭтоЦентральныйУзел() Тогда
		Возврат; // В периферийные узлы данные приходят обменом, это НСИ.
	КонецЕсли;
	
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Причины.Ссылка
		|ИЗ
		|	Справочник.ПричиныОтказаВРегистрацииМЭДО КАК Причины
		|ГДЕ
		|	Причины.ВерсияОт <> ЗНАЧЕНИЕ(Перечисление.ВерсииФорматаМЭДО.ПустаяСсылка)
		|	ИЛИ Причины.ВерсияДо <> ЗНАЧЕНИЕ(Перечисление.ВерсииФорматаМЭДО.ПустаяСсылка)");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 10 Тогда
		Возврат; // Считаем, что уже заполнено
	КонецЕсли;
	
	
	Версии = Перечисления.ВерсииФорматаМЭДО;
	Пусто = Версии.ПустаяСсылка();
	Версия27 = Версии.Версия27;
	Версия271 = Версии.Версия271;
	
	НачатьТранзакцию();
	Попытка
		// Здесь везде строки не локализованные, т.к. это фиксированный текст, выводящийся по требованиям xsd-схемы в 
		// файл сообщения МЭДО. Они всегда только на русском.
		
		// в 2.7 есть, в 2.7.1 нет:
		//
		ЗаписатьЕслиОтличается(
			НетИсковогоЗаявления,
			"Нет искового заявления",
			Пусто, Версия27,
			"");
		
		ЗаписатьЕслиОтличается(
			ОтсутствуетТекст,
			"Отсутствует текст",
			Пусто, Версия27,
			"Текст документа или приложений не удалось найти");
		
		ЗаписатьЕслиОтличается(
			НетПодписи,
			"Нет подписи",
			Пусто, Версия27,
			"Документ (или приложения) не подписаны обычно или электронной подписью тогда, когда подпись требуется по регламенту");
		
		ЗаписатьЕслиОтличается(
			ПриложениеОтсутствует,
			"Приложение отсутствует",
			Пусто, Версия27, 
			"Отсутствуют приложения к документу, перечисленные или предполагаемые в письме");
		
		ЗаписатьЕслиОтличается(ЛистажПриложенияУказанОшибочно,
			"Листаж приложения указан ошибочно",
			Пусто, Версия27, 
			"Несоответствие фактического количества страниц в приложении указанному в паспорте");
		
		ЗаписатьЕслиОтличается(
			НесовпадениеРеквизитовПриложенияСПриложеннымиДокументами,
			"Несовпадение реквизитов приложения с приложенными документами",
			Пусто, Версия27,
			"");
		
		ЗаписатьЕслиОтличается(
			НетНомераИДаты,
			"Нет № и даты",
			Пусто, Версия27,
			"Номер и (или) дата ""исходящего"" по данным СЭД отправителя не указаны в паспорте документа");
		
		ЗаписатьЕслиОтличается(
			НеПолнаяКомплектация, 
			"Не полная комплектация",
			Пусто, Версия27,
			"Отсутствуют приложения к документу, перечисленные или предполагаемые в письме");
		
		ЗаписатьЕслиОтличается(
			ДатаДокументаНеразборчива,
			"Дата документа неразборчива",
			Пусто, Версия27,
			"Дату документа не удалось прочитать");
		
		ЗаписатьЕслиОтличается(
			ИсходящийНомерДокументаНеразборчив,
			"Исходящий номер документа неразборчив",
			Пусто, Версия27,
			"Номер документа не удалось прочитать");
		
		ЗаписатьЕслиОтличается(
			ОтсутствуетИлиНеВиднаПодпись,
			"Отсутствует (не видна) подпись",
			Пусто, Версия27,
			"Документ (или приложения) не подписаны обычно или электронной подписью тогда, когда подпись требуется по регламенту");
		
		ЗаписатьЕслиОтличается(
			ПеревернутыСтраницы,
			"Перевернуты страницы",
			Пусто, Версия27,
			"Текст документа или приложений отсканирован с оборотом или поворотом");
		
		ЗаписатьЕслиОтличается(
			ПродублированыСтраницы,
			"Продублированы страницы",
			Пусто, Версия27,
			"Текст документа или приложений содержит дублированные страницы");
		
		ЗаписатьЕслиОтличается(
			ВПриложенииПроектНормативногоАкта,
			"В приложении проект нормативного акта",
			Пусто, Версия27,
			"");
		
		ЗаписатьЕслиОтличается(
			ДокументИИлиПриложениеОтсканированыСОборотом,
			"Документ и/или приложение отсканированы с оборотом",
			Пусто, Версия27,
			"Текст документа или приложений отсканирован с оборотом или поворотом");
		
		ЗаписатьЕслиОтличается(
			ДокументЗарегистрированРанееТекстВзаменРазосланногоЗагружен,
			"Документ зарегистрирован ранее, текст взамен разосланного загружен",
			Пусто, Версия27,
			"Используется при получении документа со связью ""взамен разосланного"", подтверждает приемку нового текста документа и загрузку его в СЭД получателя вместо ранее принятого");
		
		ЗаписатьЕслиОтличается(
			КоличествоСтраницВТекстеДокументаНеСоответствуетЗаявленному,
			"Количество страниц в тексте документа не соответствует заявленному",
			Пусто, Версия27,
			"Несоответствие фактического количества страниц в документе указанному в паспорте");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеПереданныхРеквизитовТекстуДокумента,
			"Несоответствие переданных реквизитов тексту документа",
			Пусто, Версия27,
			"Структурированные атрибуты документа в ""паспорте документа"" не соответствуют содержимому в PDF образе документа и/или приложениях к основному документу");
		
		ЗаписатьЕслиОтличается(
			ОтсутствуетПриложениеУказанноеВДокументе,
			"Отсутствует приложение, указанное в документе",
			Пусто, Версия27,
			"Отсутствуют приложения к документу, перечисленные или предполагаемые в письме");
		
		ЗаписатьЕслиОтличается(
			ТекстНеСоответствуетРегламенту,
			"Текст не соответствует регламенту",
			Пусто, Версия27,
			"Содержание документа или приложений не соответствует регламенту, определенному указанным видом документа и связями");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеСодержимогоТранспортногоКонтейнераУтвержденнымТребованиям,
			"Несоответствие содержимого транспортного контейнера утвержденным требованиям",
			Пусто, Версия27,
			"");
		
		
		// 2.7, 2.7.1 и выше:
		//
		ЗаписатьЕслиОтличается(
			НеПодлежитРегистрации,
			"Не подлежит регистрации",
			Версия27, Пусто,
			"Если не подходит ни одна из перечисленных выше причин, либо причин несколько, тогда текст с пояснением причин можно указать дополнительно к выбору данного пункта");
		
		ЗаписатьЕслиОтличается(
			ОшибкаАдресации,
			"Ошибка адресации",
			Версия27, Пусто,
			"Техническая ошибка при указании адресата, например отсутствующий GUID абонента");
		
		ЗаписатьЕслиОтличается(
			НеУказанКорреспондент,
			"Не указан корреспондент",
			Версия27, Пусто,
			"Корреспондент (получатель) не указан в паспорте сообщения или контейнера");
		
		ЗаписатьЕслиОтличается(
			ДокументДСП,
			"Документ ДСП",
			Версия27, Пусто,
			"Документ ""для служебного пользования"" передан через несертифицированный СЭД");
		
		ЗаписатьЕслиОтличается(
			ДокументНеверноАдресован,
			"Документ неверно адресован",
			Версия27, Пусто,
			"Содержание документа не позволяет отнести его к компетенции получателя");
		
		ЗаписатьЕслиОтличается(
			ДокументПолученРанееНаБумажномНосителе,
			"Документ получен ранее на бумажном носителе",
			Версия27, Пусто,
			"Документ уже был получен и зарегистрирован ранее, на бумажном носителе");
		
		ЗаписатьЕслиОтличается(
			ТекстНеразборчив,
			"Текст неразборчив",
			Версия27, Пусто,
			"Текст документа или приложений не удалось прочитать");
		
		ЗаписатьЕслиОтличается(
			ТекстОтсутствует,
			"Текст отсутствует",
			Версия27, Пусто,
			"Текст документа или приложений не удалось найти");
		
		
		// Только 2.7.1 и выше
		ЗаписатьЕслиОтличается(
			НеУказанВидДокумента,
			"Не указан вид документа",
			Версия271, Пусто,
			"Атрибут ""Вид документа"" не заполнен (необходимо заполнять вид документа в строгом соответствии со справочником)");
		
		ЗаписатьЕслиОтличается(
			НеУказаныНомерИДатаИсходящегоДокумента,
			"Не указаны номер и дата исходящего документа",
			Версия271, Пусто,
			"Номер и (или) дата ""исходящего"" по данным СЭД отправителя не указаны в паспорте документа");
		
		ЗаписатьЕслиОтличается(
			НеУказаныНомерИДатаОснованияДляОтвета,
			"Не указаны номер и дата основания для ответа",
			Версия271, Пусто,
			"Номер и (или) дата ""исходящего"" по данным СЭД получателя не указаны в паспорте ""ответа""");
		
		ЗаписатьЕслиОтличается(
			ФорматСообщенияНеСоответствуетТребованиям,
			"Формат сообщения не соответствует требованиям",
			Версия271, Пусто,
			"Паспорт сообщения, паспорт транспортного контейнера не соответствует XML-схеме или другим требованиям приказа");
		
		ЗаписатьЕслиОтличается(
			ДокументЗарегистрированРанееНовыйТекстВзаменРазосланногоЗагружен,
			"Документ зарегистрирован ранее, новый текст ""взамен разосланного"" загружен",
			Версия271, Пусто,
			"Используется при получении документа со связью ""взамен разосланного"", подтверждает приемку нового текста документа и загрузку его в СЭД получателя вместо ранее принятого");
		
		ЗаписатьЕслиОтличается(
			ДокументНеСоответствуетРегламенту,
			"Документ не соответствует регламенту",
			Версия271, Пусто,
			"Содержание документа или приложений не соответствует регламенту, определенному указанным видом документа и связями");
		
		ЗаписатьЕслиОтличается(
			ДокументНеСоответствуетРеквизитамПаспорта,
			"Документ не соответствует реквизитам паспорта",
			Версия271, Пусто,
			"Структурированные атрибуты документа в ""паспорте документа"" не соответствуют содержимому в PDF образе документа и/или приложениях к основному документу");
		
		ЗаписатьЕслиОтличается(
			ДокументПодписанНеУполномоченнымЛицом,
			"Документ подписан не уполномоченным лицом",
			Версия271, Пусто,
			"Содержание документа не соответствует полномочиям подписавшего его лица");
		
		ЗаписатьЕслиОтличается(
			ДокументПолученРанееВЭлектронномВиде,
			"Документ получен ранее в электронном виде",
			Версия271, Пусто,
			"Документ уже был получен и зарегистрирован ранее, в электронном виде");
		
		ЗаписатьЕслиОтличается(
			НетПодписиИлиЭП,
			"Нет подписи или ЭП",
			Версия271, Пусто,
			"Документ (или приложения) не подписаны обычно или электронной подписью тогда, когда подпись требуется по регламенту");
		
		ЗаписатьЕслиОтличается(
			ТекстОтсканированСДефектами,
			"Текст отсканирован с дефектами",
			Версия271, Пусто,
			"Текст документа или приложений отсканирован с оборотом или поворотом");
		
		ЗаписатьЕслиОтличается(
			ТекстСодержитДублированиеСтраниц,
			"Текст содержит дублирование страниц",
			Версия271, Пусто,
			"Текст документа или приложений содержит дублированные страницы");
		
		ЗаписатьЕслиОтличается(
			НетПриложенияИлиНеполнаяКомплектация,
			"Нет приложения или неполная комплектация",
			Версия271, Пусто,
			"Отсутствуют приложения к документу, перечисленные или предполагаемые в письме");
		
		ЗаписатьЕслиОтличается(
			КоличествоСтраницВДокументеНеСоответствуетЗаявленному,
			"Количество страниц в документе не соответствует заявленному",
			Версия271, Пусто,
			"Несоответствие фактического количества страниц в документе указанному в паспорте");
		
		ЗаписатьЕслиОтличается(
			КоличествоСтраницВПриложенииНеСоответствуетЗаявленному,
			"Количество страниц в приложении не соответствует заявленному",
			Версия271, Пусто,
			"Несоответствие фактического количества страниц в приложении указанному в паспорте");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеТребованиямКПроцедурамДелопроизводстваПриФормированииДокумента,
			"Несоответствие требованиям к процедурам делопроизводства при формировании документа",
			Версия271, Пусто,
			"При формировании документа в электронном виде нарушены требования к процедурам делопроизводства (или применения ЭП) из раздела III Требований. Приказ Минцифры 04.12.2020 N 667/233");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеТребованиямКФорматуФайлаДокумента,
			"Несоответствие требованиям к формату файла документа",
			Версия271, Пусто,
			"Формат файла документа не соответствует требованиям из Раздела IV Требований. Приказ Минцифры 04.12.2020 N 667/233");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеТребованиямКФорматуЭлектроннойПодписи,
			"Несоответствие требованиям к формату электронной подписи",
			Версия271, Пусто,
			"Формат электронной подписи не соответствует требованиям из Раздела V Требований. Приказ Минцифры 04.12.2020 N 667/233");
		
		ЗаписатьЕслиОтличается(
			НесоответствиеТребованиямКТранспортномуКонтейнеру,
			"Несоответствие требованиям к транспортному контейнеру",
			Версия271, Пусто,
			"Транспортный контейнер не соответствует требованиям из Раздела VI Требований. Приказ Минцифры 04.12.2020 N 667/233");
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось заполнить справочник ""Причины отказа в регистрации МЭДО"":
			|%1'"), ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЕслиОтличается(ПредметСсылка, Наименование, ВерсияОт, ВерсияДо, ПояснениеКПрименению)
	
	Предмет = ПредметСсылка.ПолучитьОбъект();
	
	Если Предмет.Наименование = Наименование
		И Предмет.ВерсияОт = ВерсияОт
		И Предмет.ВерсияДо = ВерсияДо
		И Предмет.ПояснениеКПрименению = ПояснениеКПрименению Тогда
		Возврат; // отличий нет
	КонецЕсли;
	
	Предмет.ВерсияОт = ВерсияОт;
	Предмет.ВерсияДо = ВерсияДо;
	Предмет.ПояснениеКПрименению = ПояснениеКПрименению;
	Предмет.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли