#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	// Если необходимо включает/выключает регламентное задание -
	// см. РегламентноеЗадание.ОбновлениеИсторическихДанныхВУзлахКОД
	ДолжноБытьВключено = КОДСлужебный.НужноФоновоеОбновлениеИсторическихДанных();
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.ОбновлениеИсторическихДанныхВУзлахКОД);
	Если РегламентноеЗадание.Использование <> ДолжноБытьВключено Тогда
		РегламентноеЗадание.Использование = ДолжноБытьВключено;
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли