////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции по работе со схемами процессов, для вызова с клиента.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступность настройки скриптов в схемах процессов.
// 
// Возвращаемое значение:
// 	Булево
//
Функция ДоступнаНастройкаСкриптовВСхемахПроцессов() Экспорт
	
	Возврат СхемыПроцессовСервер.ДоступнаНастройкаСкриптовВСхемахПроцессов();
	
КонецФункции

#КонецОбласти