#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокИнструкцийПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		ТекстВыбраннойИнструкции = РаботаСИнструкциямиКлиент.ТекстИнструкции(Элемент.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если ТекстВыбраннойИнструкции <> Неопределено Тогда
		Элементы.ТекстВыбраннойИнструкции.Документ.execCommand("Print");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокИнструкцийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнструкции(Команда)

	 Элементы.СписокИнструкций.Обновить();
	
КонецПроцедуры

#КонецОбласти
