#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет вариант важности объектов по важности писем.
// 
// Параметры:
//  ВажностьПисем - ПеречислениеСсылка.ВажностьПисем
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыВажностиОбъектов
// 
Функция ВариантВажностиОбъектов(ВажностьПисем) Экспорт
	
	Если ВажностьПисем = Высокая Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Высокая;
	ИначеЕсли ВажностьПисем = Обычная Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Обычная;
	ИначеЕсли ВажностьПисем = Низкая Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Низкая;
	Иначе
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВариантВажностиОбъектов;
	
КонецФункции

#КонецОбласти

#КонецЕсли