#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СоздатьДляДокументов(Команда)
	
	ПараметрыДляФормы = Новый Структура("Назначение", "Документы");
	ОткрытьФорму("Справочник.ШаблоныИменФайлов.ФормаОбъекта", ПараметрыДляФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДляЛюбогоВладельцаФайла(Команда)
	
	ПараметрыДляФормы = Новый Структура("Назначение", "Любые");
	ОткрытьФорму("Справочник.ШаблоныИменФайлов.ФормаОбъекта", ПараметрыДляФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДляМероприятия(Команда)
	
	ПараметрыДляФормы = Новый Структура("Назначение", "Мероприятия");
	ОткрытьФорму("Справочник.ШаблоныИменФайлов.ФормаОбъекта", ПараметрыДляФормы);
	
КонецПроцедуры

#КонецОбласти
