////////////////////////////////////////////////////////////////////////////////
// Работа с процессами по обработкам объектов (клиент, повторного использования): содержит
// функции с закэшированными результатами для работы с процессами по обработкам объектов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает необходимость выполнения обработки объектов процессами.
//
// Возвращаемое значение:
//  Булево
//
Функция ВыполнятьОбработкуОбъектовПроцессами() Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектовКлиент.ВыполнятьОбработкуОбъектовПроцессами();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СхемыДляОбработокОбъектов

#Область УсловияСхемы

// Возвращает пустое условие схемы обработки объекта.
// 
// Возвращаемое значение:
// 	НастройкиКомпоновкиДанных
//
Функция ПустоеУсловиеСхемыОбработкиОбъекта() Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектовВызовСервера.ПустоеУсловиеСхемыОбработкиОбъекта();
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти