
#Область ПрограммныйИнтерфейс

// Возвращает признак использования сервиса Таймлист в программе
// 
// Возвращаемое значение:
//  Булево - Истина, если сервис используется в программе.
// 
Функция ТаймлистИспользуется() Экспорт
	
	Возврат Таймлист.ТаймлистИспользуется();
	
КонецФункции

// Возвращает доступность распознавания с помощью сервиса Таймлист для текущего пользователя.
// 
// Возвращаемое значение:
//  Булево - Истина, если у пользователя есть права на работу с сервисом.
// 
Функция ДоступноРаспознаваниеПоЗапросу() Экспорт
	
	Если Не ДокументооборотПраваДоступаПовтИсп.ВключеноИспользованиеПравДоступа() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Пользователи.РолиДоступны("РаспознаваниеТаймлист");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает данные токена
//
// Возвращаемое значение:
//  Неопределено, Структура - Неопределено, если токен не установлен в базе;
//  если токен установлен в базе, то Структура - см. Таймлист.ОписаниеДанныхТокена
//
Функция ДанныеТокена() Экспорт
	
	ДанныеТокена = Константы.ТаймлистТокен.Получить().Получить();
	
	Если ЗначениеЗаполнено(ДанныеТокена) Тогда
		Возврат ДанныеТокена;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
