////////////////////////////////////////////////////////////////////////////////
// Работа с процессами по обработкам объектов (вызов сервера):
// содержит процедуры и функции для работы с процессами по обработкам объектов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает необходимость выполнения обработки объектов процессами.
//
// Возвращаемое значение:
//  Булево
//
Функция ВыполнятьОбработкуОбъектовПроцессами() Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектов.ВыполнятьОбработкуОбъектовПроцессами();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СхемыДляОбработокОбъектов

// Возвращает ссылку на параметры схемы по владельцу.
// 
// Параметры:
//  ВладелецСхемы - СправочникСсылка.ПараметрыСхемДляОбработокОбъектов,
//                  СправочникСсылка.ОбработкиОбъектов
// 
// Возвращаемое значение:
//   СправочникСсылка.ПараметрыСхемДляОбработокОбъектов
// 	
Функция ПараметрыСхемыПоВладельцу(ВладелецСхемы) Экспорт
	
	Возврат Справочники.ПараметрыСхемДляОбработокОбъектов.ПараметрыСхемыПоВладельцу(ВладелецСхемы);
	
КонецФункции

// Возвращает параметры схемы обработки, для объекта.
// 
// Параметры:
// 	Объект - СправочникСсылка.ДокументыПредприятия
// 	
// Возвращаемое значение:
//  Структура
//   * ПараметрыСхемы - СправочникСсылка.ПараметрыСхемДляОбработокОбъектов
//   * Владелец - СправочникСсылка.ОбработкиОбъектов, СправочникСсылка.НастройкиОбработкиВидовОбъектов 
//
Функция ПараметрыСхемыДляОбъекта(Объект) Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектов.ПараметрыСхемыДляОбъекта(Объект);
	
КонецФункции

// Возврщает параметры открытия схемы обработки, для объекта.
// 
// Параметры:
// 	Объект - СправочникСсылка.ДокументыПредприятия
// 	
// Возвращаемое значение:
//  Структура
//   * ПараметрыСхемы - см. РаботаСПроцессамиПоОбработкамОбъектов.ПараметрыСхемыДляОбъекта
//   * Действия - Соответствие
//      ** Ключ - СправочникСсылка.ВидыДействий - вид действия.
//      ** Значение - ОпределяемыйТип.Действия
//   * ОбработкаОбъекта - СправочникСсылка.ОбработкиОбъектов
//   * ТекущиеЭлементы - Соответствие
//      ** Ключ - Строка - имя элемента в схеме.
//      ** Значение - Булево - всегда Истина.
//   * ПройденныеЭлементы - Соответствие
//      ** Ключ - Строка - имя элемента в схеме.
//      ** Значение - Булево - всегда Истина.
//
Функция ПараметрыОтрытияСхемыОбработкиДляОбъекта(Объект) Экспорт
	
	ПараметрыОтрытия = Новый Структура;
	
	ПараметрыОтрытия.Вставить("ПараметрыСхемы",
		РаботаСПроцессамиПоОбработкамОбъектов.ПараметрыСхемыДляОбъекта(Объект));
	
	ДанныхВидовДействий = 
		РаботаСПроцессамиПоОбработкамОбъектов.ДанныхВидовДействийОбработкиОбъекта(Объект);
	
	Действия = Новый Соответствие();
	Для Каждого ДанныхВида Из ДанныхВидовДействий Цикл
		Действия[ДанныхВида.ВидДействия] = ДанныхВида.Действие;
	КонецЦикла;
	
	ПараметрыОтрытия.Вставить("Действия", Действия);
	
	ПараметрыОтрытия.Вставить("ОбработкаОбъекта",
		Справочники.ОбработкиОбъектов.ОбработкаОбъекта(Объект));
	
	ТекущиеИПройденныеЭлементы = 
		РаботаСПроцессамиПоОбработкамОбъектов.ТекущиеИПройденныеЭлементыСхемыОбработкиОбъекта(
			ПараметрыОтрытия.ОбработкаОбъекта);
	
	ПараметрыОтрытия.Вставить("ТекущиеЭлементы", ТекущиеИПройденныеЭлементы.ТекущиеЭлементы);
	ПараметрыОтрытия.Вставить("ПройденныеЭлементы", ТекущиеИПройденныеЭлементы.ПройденныеЭлементы);
	
	Возврат ПараметрыОтрытия;
	
КонецФункции

// Возвращает виды действий обработки объекта или настройки обработки объекта.
// С учетом заданного порядка.
// 
// Параметры:
// 	ОбработкаОбъекта - СправочникОбъект.НастройкиОбработкиВидовОбъектов,
// 	                   СправочникСсылка.ОбработкиОбъектов
// 
// Возвращаемое значение:
// 	Массив
// 	 * см. СправочникСсылка.ВидыДействий
//
Функция ВидыДействийОбработкиОбъекта(ОбработкаОбъекта) Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектов.ВидыДействийОбработкиОбъекта(ОбработкаОбъекта); 
	
КонецФункции

#Область УсловияСхемы

// Возвращает пустое условие схемы обработки объекта.
// 
// Возвращаемое значение:
// 	НастройкиКомпоновкиДанных
//
Функция ПустоеУсловиеСхемыОбработкиОбъекта() Экспорт
	
	Возврат РаботаСПроцессамиПоОбработкамОбъектов.ПустоеУсловиеСхемыОбработкиОбъекта();
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти