
&ИзменениеИКонтроль("ПредставлениеФактическогоИсполнителя")
Функция ЦППК_ПредставлениеФактическогоИсполнителя(Данные, Расширенное, СуффиксЯзыка="") Экспорт
	
	Представление = "";
	
	Если Расширенное Тогда
		Представление = СокрЛП(Данные.Адресат);
	Иначе
		Представление = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Данные.Адресат, Ложь, СуффиксЯзыка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Факт) Тогда
		
		Если Расширенное Тогда
			ПредставлениеФакт = СокрЛП(Данные.Факт);
		Иначе
			ПредставлениеФакт = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Данные.Факт, Ложь, СуффиксЯзыка);
		КонецЕсли;
		
		Если Данные.План <> Данные.Факт Тогда
			
			РеквизитыПлана = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Данные.План, "Владелец");
			
			ПлановыйСклонение = СклонениеПредставленийОбъектов.ПросклонятьПредставление(
				Строка(РеквизитыПлана.Владелец),
				4,
				РеквизитыПлана.Владелец);
			
			Латиница = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
			Кириллица = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщыъьэюя"; // АПК:1036 проверка орфографии не требуется.
			ДопустимыеСимволы = Латиница + Кириллица + " ";
			ПредставлениеДопускаетСокращение = РаботаСЗадачами.СтрокаСодержитТолькоДопустимыеСимволы(
				ПлановыйСклонение,
				ДопустимыеСимволы);
			
			Если Не Расширенное И ПредставлениеДопускаетСокращение Тогда
				ПредставлениеПлан = ФизическиеЛица.ФамилияИнициалыФизЛица(ПлановыйСклонение);
			Иначе
				ПредставлениеПлан = ПлановыйСклонение;
			КонецЕсли;
			
			Представление = СтрШаблон(НСтр("ru = '%1 за %2'"), 
				ПредставлениеФакт, 
				ПредставлениеПлан);
			
		Иначе
			
			Представление = ПредставлениеФакт;
			
		КонецЕсли;
		
		#Удаление
		Если ЗначениеЗаполнено(Данные.Отметил)
			И Данные.Отметил <> Данные.Факт Тогда
			
			Если Расширенное Тогда
				ПредставлениеОтметил = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Данные.Отметил,
					"ПредставлениеВПереписке");
			Иначе
				ПредставлениеОтметил = РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(Данные.Отметил, Ложь, СуффиксЯзыка);
			КонецЕсли;
			
			МассивСтроки = Новый Массив;
			МассивСтроки.Добавить(Представление);
			МассивСтроки.Добавить(СтрШаблон(НСтр("ru = '(Отметил(а): %1)'"), ПредставлениеОтметил));
			Представление = СтрСоединить(МассивСтроки, " ");
			
		КонецЕсли;
		#КонецУдаления
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции
