#Область ПрограммныйИнтерфейс

// Возвращает число страниц в порции.  Для предпросмотра или согласования в режиме замечаний
// 
// Возвращаемое значение:
//  Число
Функция ЧислоСтраницДляПредпросмотраПорции() Экспорт
	
	Возврат 20;
	
КонецФункции	

// Возвращает число страниц , выше которого идет в долгую очередь.  Для согласования в режиме замечаний
// 
// Возвращаемое значение:
//  Число
Функция ПороговоеЧислоСтраницФайлаСогласованияДляДолгойОчереди() Экспорт
	
	Возврат 50;
	
КонецФункции	

// Возвращает число страниц , выше которого не делается подготовка html 
// (и замечания можно дать только к файлу в целом, не к отдельным участкам текста внутри него).
//   Для согласования в режиме замечаний
// 
// Возвращаемое значение:
//  Число
Функция ПредельноеЧислоСтраницФайлаСогласованияДляHtmlОбраза() Экспорт
	
	Возврат 100;
	
КонецФункции	

	
#КонецОбласти