
&ИзменениеИКонтроль("ОбрабатывающийРезолюцию")
Функция ЦППК_ОбрабатывающийРезолюцию(ЗадачаПроцесса, ДействиеЗадачи)

	Если ТипЗнч(ЗадачаПроцесса) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		БизнесПроцесс = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
		ЗадачаПроцесса,
		"БизнесПроцесс");
	Иначе
		БизнесПроцесс = ЗадачаПроцесса.БизнесПроцесс;
		ЗадачаПроцесса = ЗадачаПроцесса.Задача;
	КонецЕсли;

	ОбрабатывающийРезолюцию = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
	БизнесПроцесс,
	"ОбрабатывающийРезолюцию");

	Если ЗначениеЗаполнено(ОбрабатывающийРезолюцию) Тогда
		Возврат ОбрабатывающийРезолюцию;
	КонецЕсли;

	АктуальныеПомощники = ЗамещающиеИПомощники.ПодходящиеЗамещения(
	ДействиеЗадачи,
	Перечисления.ВидыЗамещения.Помощники);

#Удаление
	Если АктуальныеПомощники.Количество() > 0 Тогда
		ОбрабатывающийРезолюцию = АктуальныеПомощники[0].Замещающий;
	Иначе
#КонецУдаления
		ОбрабатывающийРезолюцию = 
		ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(БизнесПроцесс, "Автор");
#Удаление
	КонецЕсли;
#КонецУдаления

	Возврат ОбрабатывающийРезолюцию;

КонецФункции

&ИзменениеИКонтроль("ДополнительныеДанныеПоЗадаче")
Функция ЦППК_ДополнительныеДанныеПоЗадаче(Задача)

	СтруктураВозврата = Новый Структура("РезультатВыполнения, КонтекстВыполненияЗадачи");

	Если Не Задача.Выполнена Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;

	ТочкаМаршрута = Задача.ТочкаМаршрута;
	ТочкиМаршрутаПроцесса = БизнесПроцессы.Рассмотрение.ТочкиМаршрута;

	РезультатДействия = Справочники.РезультатыДействийЗадач.ПустаяСсылка();
	ТекстРезультатаВыполнения = Задача.РезультатВыполнения;

	Если ТочкаМаршрута = ТочкиМаршрутаПроцесса.Рассмотреть Тогда

		ВариантРассмотрения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Задача.БизнесПроцесс, "ВариантРассмотрения");

		Если ВариантРассмотрения = Перечисления.ВариантыРассмотрения.НаправитьПомощнику Тогда
			РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоПомощнику;
#Вставка
			РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоАвтору;
#КонецВставки
		ИначеЕсли ВариантРассмотрения = Перечисления.ВариантыРассмотрения.НаправитьАвтору Тогда
			РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоАвтору;

		ИначеЕсли ВариантРассмотрения = Перечисления.ВариантыРассмотрения.Рассмотрено Тогда
			РезультатДействия = Справочники.РезультатыДействийЗадач.Рассмотрено;

		ИначеЕсли ВариантРассмотрения = 
			Перечисления.ВариантыРассмотрения.НаправитьНаИсполнение Тогда

			РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаИсполнение;
			ТекстРезультатаВыполнения = "";

		ИначеЕсли ВариантРассмотрения = Перечисления.ВариантыРассмотрения.НаправитьНаОзнакомление Тогда

			РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаОзнакомление;
			ТекстРезультатаВыполнения = "";
		КонецЕсли;

	ИначеЕсли ТочкаМаршрута = ТочкиМаршрутаПроцесса.Ознакомиться Тогда
		РезультатДействия = Справочники.РезультатыДействийЗадач.ОбработанаРезолюция;
	КонецЕсли;

	ДанныеИсполнителяДляИсторииВыполнения = Задача.ДанныеИсполнителяДляИсторииВыполнения();

	КонтекстВыполненияЗадачи = РегистрыСведений.ИсторияЗадач.КонтекстВыполнения();
	КонтекстВыполненияЗадачи.Исполнитель = ДанныеИсполнителяДляИсторииВыполнения.Исполнитель;
	КонтекстВыполненияЗадачи.ПлановыйИсполнитель = 
	ДанныеИсполнителяДляИсторииВыполнения.ПлановыйИсполнитель;

	КонтекстВыполненияЗадачи.ОснованиеФактическогоИсполнителя =
	ДанныеИсполнителяДляИсторииВыполнения.ОснованиеФактическогоИсполнителя;
	КонтекстВыполненияЗадачи.ТекстРезультатаВыполнения = ТекстРезультатаВыполнения;

	КонтекстВыполненияЗадачи.ПриложенияРезультатаВыполнения = 
	РаботаСЗадачами.СлепокПриложенийРезультатаПоИсточнику(Задача.Ссылка);

	КонтекстВыполненияЗадачи.РезультатДействия = РезультатДействия;
	КонтекстВыполненияЗадачи.ФактическийИсполнитель = 
	ДанныеИсполнителяДляИсторииВыполнения.ФактическийИсполнитель;

	СтруктураВозврата.РезультатВыполнения = Неопределено;
	СтруктураВозврата.КонтекстВыполненияЗадачи = КонтекстВыполненияЗадачи;

	Возврат СтруктураВозврата;

КонецФункции
