// @strict-types


#Область ПрограммныйИнтерфейс

// Метод добавлен для обеспечения работы подсистем ЭП версии БСП 3.1.10.295
// Вызывает метод ПоказатьИнформациюОбОшибке объекта ОбработкаОшибок.
// Требуется использовать для возможности автоматического тестирования,
// чтобы перехватывать ошибки с помощью расширения. 
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке
//
// Пример:
//	// Параметры:
//	//  Результат - см. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
//	//  ДополнительныеПараметры - Неопределено
//	//
//	&НаКлиенте
//	Процедура ОбновитьТекущийСписокЗавершение(Результат, ДополнительныеПараметры) Экспорт
//		Если Результат = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//		Если Результат.Статус = "Ошибка" Тогда
//			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
//			Возврат;
//		КонецЕсли;
//		... // Статус = "Выполнено"
//	КонецПроцедуры
//
Процедура ВывестиИнформациюОбОшибке(ИнформацияОбОшибке) Экспорт
	
	ОбработкаОшибок.ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке);
	
КонецПроцедуры

#КонецОбласти

