
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Направление") Тогда
		СтандартнаяОбработка = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Станции_ТТС.Ссылка
		               |ИЗ
		               |	РегистрСведений.ТТС_НаправленияСтанций КАК ТТС_НаправленияСтанций
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Станции_ТТС КАК Станции_ТТС
		               |		ПО ТТС_НаправленияСтанций.Станция = Станции_ТТС.Ссылка
		               |ГДЕ
		               |	ТТС_НаправленияСтанций.Направление = &Направление
		               |	И Станции_ТТС.Наименование ПОДОБНО &СтрокаПоиска";
		Запрос.УстановитьПараметр("Направление",Параметры.Отбор.Направление);
		Запрос.УстановитьПараметр("СтрокаПоиска",Параметры.СтрокаПоиска+"%");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#КонецЕсли

