////////////////////////////////////////////////////////////////////////////////
// Работа с HTML (клиент-сервер).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает пустой HTML текст.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ДанныеСобытия - Структура - Данные события.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//  Форма - ФормаКлиентскогоПриложения
//
Функция ПустойHTML() Экспорт
	
	ПустойHTML = "<html><body></body></html>";
	
	Возврат ПустойHTML;
	
КонецФункции

#КонецОбласти