
// Добавляет запись
Процедура ДобавитьЗапись(Файл, МаксимальныйНомер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.МаксимальныеНомераПравок.СоздатьМенеджерЗаписи();
	Запись.Файл = Файл;
	Запись.МаксимальныйНомер = МаксимальныйНомер;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает МаксимальныйНомер
Функция ПолучитьЗапись(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.МаксимальныеНомераПравок.СоздатьМенеджерЗаписи();
	Запись.Файл = Файл;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Запись.МаксимальныйНомер;
	
КонецФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли