////////////////////////////////////////////////////////////////////////////////
// Обзор объектов (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует данные обзора объекта.
// 
// Параметры:
//  ОбъектОбзора - Произвольный.
//  УникальныйИдентификаторФормы - УникальныйИдентификатор.
// 
// Возвращаемое значение:
//  см. ОбзорОбъектовКлиентСервер.НовыеДанныеОбзораОбъекта.
// 
Функция ДанныеОбзораОбъекта(Знач ОбъектОбзора, Знач УникальныйИдентификаторФормы) Экспорт
	
	ДанныеОбзораОбъекта = ОбзорОбъектов.ДанныеОбзораОбъекта(
		ОбъектОбзора,
		УникальныйИдентификаторФормы);
	
	Возврат ДанныеОбзораОбъекта;
	
КонецФункции

#КонецОбласти