#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Источник = Неопределено;
	КомандаОткрыть = Неопределено;
	КомандаСоздать = Неопределено;
	 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтрокаДоступ = Доступ.Добавить();
	СтрокаДоступ.Контейнер = Справочники.РабочиеГруппы.ВсеПользователи;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаОбъекта = Ссылка;
	Если Не ЗначениеЗаполнено(СсылкаОбъекта) Тогда
		СсылкаОбъекта = ПолучитьСсылкуНового();
		Если Не ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			СсылкаНового = Справочники.Реестры.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНового);
			СсылкаОбъекта = СсылкаНового;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КомандаОткрыть) Тогда
		КомандаОткрыть = Справочники.КомандыВиджетов.СоздатьКомандуОткрытьРеестр(СсылкаОбъекта);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КомандаСоздать) Тогда
		КомандаСоздать = Справочники.КомандыВиджетов.СоздатьКомандуСоздатьЭлементРеестра(СсылкаОбъекта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли