#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные набора состояний.
//
// Параметры:
//  НаборСостояний - СправочникСсылка.НаборыСостоянийЗадач - Набор состояний задач.
// 
// Возвращаемое значение:
//  Структура - Данные набора состояний:
//   * СостоянияУчастниковВРаботе - Соответствие Из КлючИЗначение - Состояния участников "В работе":
//      ** Ключ - СправочникСсылка.ВидыУчастниковЗадач - Вид участника.
//      ** Значение - СправочникСсылка.СостоянияУчастниковЗадач - Состояние участника "В работе":
//   * СостоянияУчастниковСовершено - Соответствие Из КлючИЗначение - Состояния участников "Совершено":
//      ** Ключ - СправочникСсылка.ВидыУчастниковЗадач - Вид участника.
//      ** Значение - Соответствие Из КлючИЗначение - Состояния участников "Совершено" по результатам:
//          *** Ключ - СправочникСсылка.РезультатыДействийЗадач - Результата действия участника.
//          *** Значение - СправочникСсылка.СостоянияУчастниковЗадач - Состояния участника "Совершено".
//   * ПорядокРезультатов - Соответствие Из КлючИЗначение - Порядок результатов:
//      ** Ключ - СправочникСсылка.ВидыУчастниковЗадач - Вид участника.
//      ** Значение - Массив Из СправочникСсылка.РезультатыДействийЗадач - Порядок результатов.
//
Функция ДанныеНабораСостояний(НаборСостояний) Экспорт
	
	ДанныеНабора = Новый Структура(
		"СостоянияУчастниковВРаботе, СостоянияУчастниковСовершено, ПорядокРезультатов");
	ДанныеНабора.СостоянияУчастниковВРаботе = Новый Соответствие;
	ДанныеНабора.СостоянияУчастниковСовершено = Новый Соответствие;
	ДанныеНабора.ПорядокРезультатов = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(НаборСостояний) Тогда
		Возврат ДанныеНабора;
	КонецЕсли;
	
	РеквизитыНабора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НаборСостояний,
		"СостоянияУчастниковВРаботе, СостоянияУчастниковСовершено");
	
	Для Каждого СтрокаСостояния Из РеквизитыНабора.СостоянияУчастниковВРаботе.Выгрузить() Цикл
		ДанныеНабора.СостоянияУчастниковВРаботе.Вставить(
			СтрокаСостояния.ВидУчастника,
			СтрокаСостояния.СостояниеУчастникаВРаботе);
	КонецЦикла;
	
	ТаблицаСостоянияУчастниковСовершено = РеквизитыНабора.СостоянияУчастниковСовершено.Выгрузить();
	ТаблицаСостоянияУчастниковСовершено.Сортировать("НомерСтроки");
	Для Каждого СтрокаСостояния Из ТаблицаСостоянияУчастниковСовершено Цикл
		
		// Состояния участников "Совершено".
		Если ДанныеНабора.СостоянияУчастниковСовершено[СтрокаСостояния.ВидУчастника] = Неопределено Тогда
			ДанныеНабора.СостоянияУчастниковСовершено.Вставить(
				СтрокаСостояния.ВидУчастника,
				Новый Соответствие);
		КонецЕсли;
		
		ДанныеНабора.СостоянияУчастниковСовершено[СтрокаСостояния.ВидУчастника].Вставить(
			СтрокаСостояния.РезультатДействия,
			СтрокаСостояния.СостояниеУчастникаСовершено);
		
		// Порядок результатов.
		Если ДанныеНабора.ПорядокРезультатов[СтрокаСостояния.ВидУчастника] = Неопределено Тогда
			ДанныеНабора.ПорядокРезультатов.Вставить(
				СтрокаСостояния.ВидУчастника,
				Новый Массив);
		КонецЕсли;
		
		ДанныеНабора.ПорядокРезультатов[СтрокаСостояния.ВидУчастника].Добавить(
			СтрокаСостояния.РезультатДействия);
		
	КонецЦикла;
	
	Возврат ДанныеНабора;
	
КонецФункции

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	// Исполнение.
	НаборСостоянийОбъект = Исполнение.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Ответственный;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.ВРаботе;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Исполнитель;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.ВРаботе;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Проверяющий;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаПроверке;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Ответственный;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Выполнена;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Исполнитель;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Выполнена;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Проверяющий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Проверено;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Проверено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Проверяющий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ВозвращеноНаДоработку;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ВозвращеноНаДоработку;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Ознакомление.
	НаборСостоянийОбъект = Ознакомление.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Ознакомляемый;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Ознакомляемый;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Подписание.
	НаборСостоянийОбъект = Подписание.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Подписывающий;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаПодписании;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбеспечивающийПодписание;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбеспеченииПодписания;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Подписывающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Подписано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Подписано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Подписывающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НеПодписано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НеПодписано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбеспечивающийПодписание;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Подписано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Подписано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбеспечивающийПодписание;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НеПодписано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НеПодписано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Приглашение.
	НаборСостоянийОбъект = Приглашение.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Приглашенный;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Приглашенный;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ПринятоПриглашение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Принято;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Приглашенный;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтклоненоПриглашение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Отклонено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ПодтвержденоПриглашение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ПодтвержденоПриглашение;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтмененоПриглашение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтмененоПриглашение;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Рассмотрение.
	НаборСостоянийОбъект = Рассмотрение.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезолюцию;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезолюции;
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Рассмотрено;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Рассмотрено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезолюцию;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОбработанаРезолюция;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОбработанаРезолюция;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоАвтору;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоАвтору;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоПомощнику;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоПомощнику;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаИсполнение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоНаИсполнение;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Рассматривающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаОзнакомление;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоНаОзнакомление;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезолюцию;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаИсполнение;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоНаИсполнение;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезолюцию;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоНаОзнакомление;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НаправленоНаОзнакомление;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Регистрация.
	НаборСостоянийОбъект = Регистрация.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Регистратор;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаРегистрации;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомленииСРезультатом;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Регистратор;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Зарегистрировано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Зарегистрировано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Регистратор;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НеЗарегистрировано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НеЗарегистрировано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Решение вопросов.
	НаборСостоянийОбъект = РешениеВопросов.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.РассматривающийВопрос;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.РассматривающийЗапрос;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаРассмотрении;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОтКого;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.РассматривающийВопрос;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Рассмотрено;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Рассмотрено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.РассматривающийЗапрос;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ПеренесенСрок;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ПеренесенСрок;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.РассматривающийЗапрос;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтказаноВПереносеСрока;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтказаноВПереносеСрока;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОтКого;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ЗакрытЗапрос;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОтКого;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ЗакрытВопрос;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОтКого;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Согласование.
	НаборСостоянийОбъект = Согласование.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Согласующий;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаСогласовании;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Согласующий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Согласовано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Согласовано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Согласующий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.СогласованоСЗамечаниями;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Согласующий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НеСогласовано;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НеСогласовано;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
	// Утверждение.
	НаборСостоянийОбъект = Утверждение.ПолучитьОбъект();
	
	НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Утверждающий;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаУтверждении;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОбработкеРезультата;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковВРаботе.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.СостояниеУчастникаВРаботе = Справочники.СостоянияУчастниковЗадач.НаОзнакомлении;
	
	
	НаборСостоянийОбъект.СостоянияУчастниковСовершено.Очистить();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Утверждающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Утверждено;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Утверждено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Утверждающий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.НеУтверждено;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.НеУтверждено;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОбрабатывающийРезультат;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ОтправленоПовторно;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Завершил;
	
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.ОзнакомляемыйСРезультатом;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.Ознакомился;
	
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(НаборСостоянийОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли