
&ИзменениеИКонтроль("НоваяЗапись")
Функция ЦППК_НоваяЗапись()

	НоваяЗапись = Новый Структура;
	НоваяЗапись.Вставить("Документ", Справочники.ДокументыПредприятия.ПустаяСсылка());
	НоваяЗапись.Вставить("ДатаНачалаДействия", Дата(1, 1, 1));
	НоваяЗапись.Вставить("ДатаОкончанияДействия", Дата(1, 1, 1));
	НоваяЗапись.Вставить("Бессрочный", Ложь);
#Вставка
	НоваяЗапись.Вставить("ДоИсполненияОбязательств", Ложь);
#КонецВставки
	НоваяЗапись.Вставить("ПорядокПродления", Перечисления.ПорядокПродления.ПустаяСсылка());
	НоваяЗапись.Вставить("ДокументИсточникИзменения", Справочники.ДокументыПредприятия.ПустаяСсылка());
	НоваяЗапись.Вставить("Комментарий", "");

	Возврат НоваяЗапись;

КонецФункции

&ИзменениеИКонтроль("ДобавитьЗапись")
Процедура ЦППК_ДобавитьЗапись(Параметры)

	УстановитьПривилегированныйРежим(Истина);

	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Параметры.Документ;
	Запись.ДатаИзменения = ТекущаяДата();
	Запись.ДатаНачалаДействия = Параметры.ДатаНачалаДействия;
	Запись.ДатаОкончанияДействия = Параметры.ДатаОкончанияДействия;
	Запись.Бессрочный = Параметры.Бессрочный;
	Запись.ПорядокПродления = Параметры.ПорядокПродления;
	Запись.Изменил = Сотрудники.ОсновнойСотрудник();
	Запись.ДокументИсточникИзменения = Параметры.ДокументИсточникИзменения;
	Запись.Комментарий = Параметры.Комментарий;
#Вставка
	Попытка
		Запись.ДоИсполненияОбязательств = Параметры.ДоИсполненияОбязательств;
	Исключение
		Запись.ДоИсполненияОбязательств = Ложь;
	КонецПопытки;
#КонецВставки
	Запись.Записать(Истина);

КонецПроцедуры
