
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКР7Builder = "";
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		ПутьКР7Builder = "C:\R7-Office\DocumentBuilder\docbuilder.exe";
	КонецЕсли;

	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ПутьКР7Builder = "docbuilder.exe";
	КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиСравненияФайлов");
	Элемент.Вставить("Настройка", "СпособСравненияВерсийФайлов");
	Элемент.Вставить("Значение", СпособСравненияВерсийФайлов);
	МассивСтруктур.Добавить(Элемент);

	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиСравненияФайлов");
	Элемент.Вставить("Настройка", "ПутьКР7Builder");
	Элемент.Вставить("Значение", ПутьКР7Builder);
	МассивСтруктур.Добавить(Элемент);
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, Истина);
	
	РезультатВыбора = КодВозвратаДиалога.ОК;
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры
