
&НаСервере
Процедура ЦППК_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	НастройкаУсловияХранилищеЗначения = Параметры.НастройкаУсловия;
	
	Настройки = НастройкаУсловияХранилищеЗначения.Получить();
	
	// Добавлен собственный отбор по грифу в макет.
	//СхемаКомпоновкиДанных = Справочники.ПравилаРазмещенияФайловВТомах.ПолучитьМакет("Версии");
	СхемаКомпоновкиДанных = Справочники.ПравилаРазмещенияФайловВТомах.ПолучитьМакет("ЦППК_Версии");
	
	Если Настройки = Неопределено Тогда
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;

	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(Настройки);
	
	ПредставлениеПравил = Строка(Компоновщик.Настройки.Отбор);
	Заголовок = СтрШаблон(
		НСтр("ru = 'Версии файлов, которые подходят для правила: ""%1""'"), 
		ПредставлениеПравил);
	
	РаботаСФайламиВызовСервера.СкопироватьОтбор(Список.Отбор, Компоновщик.Настройки.Отбор);

КонецПроцедуры
