
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		ЭтаФорма.Заголовок = Параметры.Заголовок;
		ЭтаФорма.АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	Если Параметры.ПоказатьТолькоСвязиСДокументами Тогда
		УстановитьОтборНедопустимыхСвязей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНедопустимыхСвязей()
		
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаСвязей.ТипСвязи,
		|	ТИПЗНАЧЕНИЯ(НастройкаСвязей.СсылкаНа) КАК ТипСсылкиНа
		|ИЗ
		|	РегистрСведений.НастройкаСвязей КАК НастройкаСвязей
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(НастройкаСвязей.СсылкаНа) <> &ТипДокументыПредприятия";
	Запрос.УстановитьПараметр("ТипДокументыПредприятия", Тип("СправочникСсылка.ВидыДокументов"));
	НедопустимыеСвязи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипСвязи");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(НедопустимыеСвязи);
	
	Если НедопустимыеСвязи.Количество() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Ссылка",
			НедопустимыеСвязи,
			ВидСравненияКомпоновкиДанных.НеВСписке);
		
		Элементы.ОтборСвязейДляНумерации.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
