
&НаКлиенте
Процедура ЦППК_ИсполнительПриИзмененииПосле(Элемент) //+ЦППК САНФ-023288 08.02.2024
	
	//++AxelSoft Шарапова 10.05.2025 САНФ-033681	
	Если Объект.Исполнители.Количество() = 1 Тогда
		
		ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
		
		ТипыПредметов = Новый Массив;
		ТипыПредметов.Добавить(Тип("СправочникСсылка.ДокументыПредприятия"));
		
		ОбрабатываемыеПредметы = МультипредметностьКлиентСервер.ПолучитьМассивПредметовОбъекта(Объект, ТипыПредметов, Истина);
		
		СрокИсполнения = ЦППК_ОбщийМодульВызовСервера.ЗаполнитьСрокИсполнения(ОбрабатываемыеПредметы, Объект.ГлавнаяЗадача);

		ЦППК_ОбщийМодульКлиентСервер.ЗаполнитьСтрокуСрокИсполнения(ТекущиеДанные, СрокИсполнения, Объект.Дата);
				
	КонецЕсли;
 	//--AxelSoft Шарапова 10.05.2025 САНФ-033681	

КонецПроцедуры

&НаСервере
Процедура ЦППК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТипыПредметов = Новый Массив;
	ТипыПредметов.Добавить(Тип("СправочникСсылка.ДокументыПредприятия"));
	
	ОбрабатываемыеПредметы = МультипредметностьКлиентСервер.ПолучитьМассивПредметовОбъекта(Объект, ТипыПредметов, Истина);
	
	Объект.СрокИсполненияПроцесса = ЦППК_ОбщийМодульВызовСервера.ЗаполнитьСрокИсполнения(ОбрабатываемыеПредметы, Объект.ГлавнаяЗадача);

КонецПроцедуры
