////////////////////////////////////////////////////////////////////////////////
// Модуль для работы со сторонами, вызов сервера.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует список для выбора стороны.
//
// Параметры:
//  Параметры - структура, по которой выполняется поиск.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты
//
Функция СформироватьДанныеВыбораСтороны(Параметры) Экспорт
	
	Возврат РаботаСПодписямиДокументов.СформироватьДанныеВыбораСтороны(Параметры);
	
КонецФункции

// Формирует список для выбора контактных лиц стороны.
//
// Параметры:
//  Параметры - структура, по которой выполняется поиск.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты
//
Функция СформироватьДанныеВыбораКонтактногоЛицаСтороны(Параметры) Экспорт

	Возврат РаботаСПодписямиДокументов.СформироватьДанныеВыбораКонтактногоЛицаСтороны(Параметры);	

КонецФункции 

// Формирует список для выбора ответственного поставившего подпись.
//
// Параметры:
//  Параметры - структура, по которой выполняется поиск.
//
// Возвращает:
//  СписокЗначений - Список значений, содержащий ссылки на найденные по части наименования объекты
//
Функция СформироватьДанныеВыбораПодписал(Параметры) Экспорт

	Возврат РаботаСПодписямиДокументов.СформироватьДанныеВыбораПодписал(Параметры);	

КонецФункции

#КонецОбласти
