#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет основной шрифт виджета.
Функция ОсновнойШрифтВиджета(ВидВиджета) Экспорт
	
	Если ВидВиджета = ДиаграммаСЛегендой Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ПоказательВиджетаШрифт");
		
	ИначеЕсли ВидВиджета = Заголовок Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ЗаголовокВиджетаШрифт");
		
	Иначе
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("НадписьВиджетаОбычная");
		
	КонецЕсли;
	
	Возврат ШрифтВиджета;
	
КонецФункции

// Определяет вспомогательный шрифт виджета.
Функция ВспомогательныйШрифтВиджета(ВидВиджета) Экспорт
	
	Если ВидВиджета = Заголовок Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("ДополнительныйПоказательВиджета");
		
	ИначеЕсли ВидВиджета = ДиаграммаСЛегендой Тогда
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("СписокВиджетаШрифт");
		
	Иначе
		ШрифтВиджета = РаботаСРабочимСтоломПовтИсп.ШрифтСтиля("НадписьВиджетаОбычная");
		
	КонецЕсли;
	
	Возврат ШрифтВиджета;
	
КонецФункции

// Определяет автоматически цвет виджета.
//
// Параметры:
//  ВидВиджета - ПеречислениеСсылка.ВидыВиджетов.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ЦветаВиджетов - Цвет виджета.
//
Функция АвтоЦвет(ВидВиджета) Экспорт
	
	Если ВидВиджета = БлокНавигации
		Или ВидВиджета = Диаграмма
		Или ВидВиджета = Заголовок Тогда
		
		Возврат Перечисления.ЦветаВиджетов.Белый;
		
	Иначе
		
		Возврат Перечисления.ЦветаВиджетов.Авто;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли