#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипДействия") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями") Тогда
			
			Если Параметры.ТипДействия = Перечисления.ТипыДействий.Исполнение Тогда
				
				ДанныеВыбора.Добавить(ЗапроситьМатериалы);
				ДанныеВыбора.Добавить(ИсполнитьПротокол);
				ДанныеВыбора.Добавить(ПодготовитьПротокол);
				ДанныеВыбора.Добавить(ПровестиМероприятие);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Ознакомление Тогда
				
				ДанныеВыбора.Добавить(ОзнакомитьСМатериалами);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Согласование Тогда
				
				ДанныеВыбора.Добавить(СогласоватьПротокол);
				
			ИначеЕсли Параметры.ТипДействия = Перечисления.ТипыДействий.Утверждение Тогда
				
				ДанныеВыбора.Добавить(УтвердитьПрограмму);
				ДанныеВыбора.Добавить(УтвердитьПротокол);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

