#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив имен ключевых реквизитов
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	МассивИмен = Новый Массив;
	
	// Подписание и доступность полей в карточке документа
	Если Версия = Неопределено Тогда
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("ДатаИсполнения");
		МассивИмен.Добавить("РезультатСогласования");
		МассивИмен.Добавить("Исполнитель");
		
	// Проверка подписей
	Иначе
		
		Если Версия = 1 Тогда
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
			МассивИмен.Добавить("Наименование");
		ИначеЕсли Версия = 2 Тогда
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
			МассивИмен.Добавить("Наименование");
			МассивИмен.Добавить("ИдентификаторУчастника");
		Иначе
			МассивИмен.Добавить("Документ");
			МассивИмен.Добавить("ДатаИсполнения");
			МассивИмен.Добавить("РезультатСогласования");
			МассивИмен.Добавить("Исполнитель");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

// Возвращает массив авторов виз по указанному документу
Функция ПолучитьМассивАвторовВизПоДокументу(Документ) Экспорт
	
	Результат = Новый Массив;
	
	Выборка = РаботаСВизамиСогласования.ПолучитьАктивныеВизыДокумента(Документ);
	
	Для Каждого Элемент Из Выборка Цикл
		Результат.Добавить(Элемент.Исполнитель);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает участников визы согласования.
// 
// Параметры:
//  ВизаСогласования - СправочникСсылка.ВизыСогласования - Ссылка на визу согласования
// 
// Возвращаемое значение:
//  - Структура - содержащая участников Визы.
//  
Функция УчастникиВизыСогласования(ВизаСогласования) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВизаСогласования, 
		"Автор, ПоместилВИсторию, РольИсполнителя, Исполнитель, УстановилРезультат");
	
КонецФункции

#КонецОбласти

#КонецЕсли