///////////////////////////////////////////////////////////////////////////////////////////////
// Модуль содержит код для работы с диспетчером обработки заданий
// 

#Область СлужебныйПрограммныйИнтерфейс

#Область ВыполнениеЗаданийНаКлиенте

// Вернет массив структур заданий
// 
// Параметры
// РазмерПорцииЗаданийДляВыполненияНаКлиенте - Число
// Ссылка - СправочникСсылка.ОчередьЗаданийДокументооборота
// 
// Возвращаемое значение:
// Массив из Структура ("Тип, Задание, ПредметЗадания, ПараметрыВыполнения")
// 	
Функция ЗаданияДляОбработкиНаКлиенте(Знач РазмерПорцииЗаданийДляВыполненияНаКлиенте,
	Ссылка = Неопределено) Экспорт
	
	Возврат ДиспетчерОбработкиОчередиЗаданийПолныеПрава.ЗаданияДляОбработкиНаКлиенте(
		РазмерПорцииЗаданийДляВыполненияНаКлиенте, Ссылка);
	
КонецФункции

// Отразит в базе результат выполнения - например пометит задание как выполненное
// 
// Параметры:
// Задание - СправочникСсылка.ОчередьЗаданийДокументооборота
// 	РезультатВыполнения - Структура
//    *ЗаданиеЗавершено - Булево
//    *ЗаписьЛога - Строка
//  УникальныйИдентификатор -УникальныйИдентификатор формы
Процедура ОтработатьРезультатВыполнения(Знач Задание, Знач РезультатВыполнения, 
	УникальныйИдентификатор = Неопределено) Экспорт

	ДиспетчерОбработкиОчередиЗаданийПолныеПрава.ОтработатьРезультатВыполнения(
		Задание, РезультатВыполнения, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
