
#Область ПрограммныйИнтерфейс

// Обновляет значение константы:
// Если включены механизмы, использующие отметки, константа включается, иначе выключается.
// 
Процедура ОбновитьЗначение() Экспорт
	
	ИспользоватьОтметкиВремени =
		Константы.ИнтеграцияС1САрхивом.Получить() = Истина
			Или Константы.ПереходСтадия.Получить() > 0
			Или Константы.ИспользоватьКОД.Получить() = Истина;
	
	Если Получить() <> ИспользоватьОтметкиВремени Тогда
		Установить(ИспользоватьОтметкиВремени);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти
