
#Область ПрограммныйИнтерфейс

// Получает список расширений аудио- и видеофайлов, загружаемых в сервис Таймлист.
// 
// Возвращаемое значение:
//  Массив Из Строка - массив расширений файлов
// 
Функция РасширенияФайловТаймлист() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РасширенияФайловТаймлист = СтрЗаменить(Константы.ТаймлистСписокРасширенийФайлов.Получить(), " ", "");
	
	МассивРасширенийФайлов = Новый Массив;
	Если ЗначениеЗаполнено(РасширенияФайловТаймлист) Тогда
		МассивРасширенийФайлов = СтрРазделить(РасширенияФайловТаймлист, ",", Ложь);
	КонецЕсли;
	
	Возврат МассивРасширенийФайлов;
	
КонецФункции

#КонецОбласти
