
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Отображение фото контактов
	ОтображатьФотографииПерсональнаяНастройка =
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПрограммы",
		"ОтображатьФотографииПерсональнаяНастройка",
		Истина);
		
	ОтображатьФотографииОбщаяНастройка = ПолучитьФункциональнуюОпцию(
		"ОтображатьФотографииОбщаяНастройка");
	
	ПоказыватьФотографии = Истина;
		
	Если Не ОтображатьФотографииОбщаяНастройка 
		Или Не ОтображатьФотографииПерсональнаяНастройка
		Или ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая 
		Тогда
		
		ПоказыватьФотографии = Ложь;
	КонецЕсли;

	// тут заполняем превью.
	
	HTMLОписание = 
		"<html>
	|<style>
	|
	|	A {
	|   text-decoration: none; /* Убирает подчеркивание для ссылок */
	|	color: #2D54A8;
	|   } 
	|   A:hover { 
	|    text-decoration: underline; /* Добавляем подчеркивание при наведении курсора на ссылку */
	|	color: #2D54A8;
	|   } 
   	|
	|   .block {
	|	background: #fffbea;
	|	width: 400;
	|	display: inline-block;
	|	vertical-align:top; 
	|	padding: 10px;
	|	border: 8px solid white;
	|  }
	|
	|   .headerBlock {
	|	background: #FBF3D8;
	|	width: 400;
	|	vertical-align:top; 
	|  }
	|
	|   .title {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: normal;
	|	font-size: 20px;
	|	line-height: 23px;
	|	color: #333333;
	|  }
	|
	|	 .email {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: normal;
	|	font-size: 13px;
	|	line-height: 15px;
	|	color: #2D54A8;
	|	}
	|	
	|	 .emailComment {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: normal;
	|	font-size: 13px;
	|	line-height: 15px;
	|	color: #333333;
	|	opacity: 0.5;
	|	}
	|
	|	 .comment {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: normal;
	|	font-size: 11px;
	|	line-height: 13px;
	|	letter-spacing: 0.01em;
	|	color: #333333;
	|	opacity: 0.7;
	|	}
	|	
	|	
	|	 .department {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: bold;
	|	font-size: 17px;
	|	line-height: 20px;
	|	letter-spacing: 0.01em;
	|	color: #333333;
	|	}
	|	
	|	
	|	 .otherField {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: bold;
	|	font-size: 13px;
	|	line-height: 15px;
	|	letter-spacing: 0.01em;
	|	color: #333333;
	|	}
	|	
	|	 .mainEmployee {
	|	font-family: Arial;
	|	font-style: normal;
	|	font-weight: bold;
	|	font-size: 11px;
	|	line-height: 13px;
	|	letter-spacing: 0.01em;
	|	color: #FFFFFF;
	|	background: #009646;
	|	}
	|
	|</style>
	|<body>";
		
	HTMLОписание = HTMLОписание + ПолучитьHtmlОбщий();
	
	ВсеСотрудники = Сотрудники.ВсеСотрудникиТекущегоПользователя();
	ОсновнойСотрудник = Сотрудники.ОсновнойСотрудник();
	ЧислоСотрудников = ВсеСотрудники.Количество();
	
	Если ЧислоСотрудников > 1 Тогда
		ИндексОсновного = ВсеСотрудники.Найти(ОсновнойСотрудник);
		Если ИндексОсновного <> Неопределено Тогда
			ВсеСотрудники.Удалить(ИндексОсновного);
			ВсеСотрудники.Вставить(0, ОсновнойСотрудник);
		КонецЕсли;
	КонецЕсли;
		
	Для Каждого Сотрудник Из ВсеСотрудники Цикл
		
		ЭтоОсновной = (Сотрудник = ОсновнойСотрудник);
		Если ЧислоСотрудников = 1 Тогда
			ЭтоОсновной = Ложь;
		КонецЕсли;	
		HTMLОписание = HTMLОписание + ПолучитьHtmlСотрудника(Сотрудник, ЭтоОсновной);
		
	КонецЦикла;	
	
	HTMLОписание = HTMLОписание + "</body></html>";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура HTMLОписаниеКонтактаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Лев(ДанныеСобытия.Href, 6) = "v8doc:" Тогда 
		
		НавигационнаяСсылкаПоля = Сред(ДанныеСобытия.Href, 7);
		
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПоля);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаСервере
Функция ПолучитьHtmlОбщий()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	HTMLОписаниеКонтакта = "";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<table>";
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<tr>";
	
	// Фото контакта
	Если ПоказыватьФотографии Тогда

		ЕстьФото = Ложь;
		ДвоичныеДанныеФото = Неопределено;

		ДвоичныеДанныеФото = РаботаСФотографиями.ПолучитьДвоичныеДанныеФото(ТекущийПользователь);
		Если ЗначениеЗаполнено(ДвоичныеДанныеФото) Тогда
			ЕстьФото = Истина;
			ДвоичныеДанныеФото = ДвоичныеДанныеФото;
		КонецЕсли;
			
		АдресФото = "";
		
		Если ЕстьФото Тогда
			Картинка = Новый Картинка(ДвоичныеДанныеФото);
			Расширение = Строка(Картинка.Формат());
			АдресФото = "data:image/" + Расширение + ";base64," + Base64Строка(ДвоичныеДанныеФото);
		Иначе
			Расширение = Строка(БиблиотекаКартинок.ПользовательБезФото.Формат());
			ДвоичныеДанныеФото = БиблиотекаКартинок.ПользовательБезФото.ПолучитьДвоичныеДанные();
			АдресФото = "data:image/" + Расширение + ";base64," + Base64Строка(ДвоичныеДанныеФото);
		КонецЕсли;
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<td width = ""20"">";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта +
			СтрШаблон(
				"<img border=""1"" src=""%1"" height=""90"" style=""border-color: #bdbdbd"" >", 
				АдресФото);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</td>";
		
	КонецЕсли;
	
	// Описание контакта
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<td valign=top>";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
		+ "<span class=""title"">";
		
	ФИО = Строка(ТекущийПользователь);
	ФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ФизЛицо");
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		ФИО = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
			ФизЛицо, "Наименование");
	КонецЕсли;	 	
	
	ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
		HTMLОписаниеКонтакта,
		ФИО,
		"");
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
	
	EmailДляВосстановленияПароля = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя,, ТекущаяДатаСеанса(),
		Новый Структура("ТолькоПервая", Истина));
		
	Если ЗначениеЗаполнено(EmailДляВосстановленияПароля) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""email"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			EmailДляВосстановленияПароля,
			"2d54a8");
			
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		
			
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""emailComment"">";	
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "&nbsp;&nbsp;";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'используется для восстановления пароля'"),
			"333333");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
			
	КонецЕсли;
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</td>";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</tr>";
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</table>";
	
	Возврат HTMLОписаниеКонтакта;
	
КонецФункции	

&НаСервере
Функция ПолучитьHtmlСотрудника(Сотрудник, ЭтоОсновной)
	
	HTMLОписаниеКонтакта = "<div class=""block"">";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Подразделение КАК Подразделение,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ГрафикРаботы,
	|	Сотрудники.Помещение,
	|	Сотрудники.ПредставлениеВДокументах,
	|	Сотрудники.ПредставлениеВПереписке
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЦветПодписи = "706f6a";
	
	
	// верхний блок - для отдела и должности, и там же Основной и ссылка
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<div class=""headerBlock"">";
	
	// таблица только в верхнем блоке
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<table width=""100%"">";
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<tr>";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<td>";
	
	Если ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'Подразделение'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""department"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.Подразделение,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Должность) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'Должность'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""department"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.Должность,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;

	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</td>";
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<td valign=top align=right>";

	Если ЭтоОсновной Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""mainEmployee"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'Основной'"),
			"");
			
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";	
	КонецЕсли;	

	// ссылка на сотрудника
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "&nbsp;";
	СсылкаСотрудника = СтрШаблон(
			"v8doc:%1",
			ПолучитьНавигационнуюСсылку(Сотрудник));
	
	ОбзорОбъектовКлиентСервер.ДобавитьКартинку(
		HTMLОписаниеКонтакта, БиблиотекаКартинок.СтрелкаНаСотрудника, СсылкаСотрудника,
		НСтр("ru = 'Открыть карточку сотрудника'"));
			
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</td>";
		
	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</tr>";
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</table>";

	//	конец верхнего блока
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</div>"; 
	
	
	Руководитель = СтруктураПредприятия.РуководительПодразделения(Выборка.Подразделение);
	Если Руководитель = Сотрудник Тогда
		Руководитель = Неопределено;
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Выборка.Подразделение, "Родитель");
		ОчередноеПодразделение = РеквизитыПодразделения.Родитель;
		Если ЗначениеЗаполнено(ОчередноеПодразделение) Тогда
			Руководитель = СтруктураПредприятия.РуководительПодразделения(ОчередноеПодразделение);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Руководитель) Тогда
	
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'Руководитель'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""otherField"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Руководитель,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
			
	КонецЕсли;
	
	// прочие поля.
	Если ЗначениеЗаполнено(Выборка.ПредставлениеВДокументах) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'В документах'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""otherField"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.ПредставлениеВДокументах,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПредставлениеВПереписке) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'В переписке'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""otherField"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.ПредставлениеВПереписке,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.ГрафикРаботы) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'График работы'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""otherField"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.ГрафикРаботы,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.Помещение) Тогда
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			НСтр("ru = 'Помещение'"),
			ЦветПодписи);
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
		
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
			+ "<span class=""otherField"">";
		
		ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
			HTMLОписаниеКонтакта,
			Выборка.Помещение,
			"");
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
		HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
		
	КонецЕсли;
	
	
	// тут контактная информация
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Сотрудник,,,Ложь);
		
	Для Каждого СтрокаКИ Из КонтактнаяИнформацияОбъекта Цикл
		
		Представление = СтрокаКИ.Представление;
		Вид = СтрокаКИ.Вид;
		
		Если ЗначениеЗаполнено(Представление) Тогда
			
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<span class=""comment"">";
			ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
				HTMLОписаниеКонтакта,
				Строка(Вид),
				ЦветПодписи);
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>";
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>";
			
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта 
				+ "<span class=""otherField"">";
			
			ОбзорОбъектовКлиентСервер.ДобавитьЗначение(
				HTMLОписаниеКонтакта,
				Представление,
				"");
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</span>" + Символы.ПС;
			HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "<br>" + "<br>";
			
		КонецЕсли;
		
	КонецЦикла;	 	

	
	HTMLОписаниеКонтакта = HTMLОписаниеКонтакта + "</div>";
	
	Возврат HTMLОписаниеКонтакта;
	
КонецФункции	

#КонецОбласти