
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Файл Из Параметры.Файлы Цикл
		Строка = Файлы.Добавить();
		Строка.Ссылка = Файл.Ссылка;
		Строка.Расширение = Файл.Расширение;
		Строка.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Файл.Расширение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураЗакрытия = Новый Структура("Файл, Расширение", Элементы.Файлы.ТекущиеДанные.Ссылка,
		Элементы.Файлы.ТекущиеДанные.Расширение);
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

#КонецОбласти
