#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру данных необходимых для представления настроек ручного отражения документа в учете
// 
// Возвращаемое значение:
//  Структура:
// * КоличествоШаблонов - Число
// * ПервыйШаблон - СправочникСсылка.ШаблоныДокументов
// * ПерваяТематика - СправочникСсылка.ТематикиДокументов
//
Функция НовыеДанныеДляПредставленияНастройкиРучногоОтраженияВУчете() Экспорт
	
	НовыеДанные = Новый Структура;
	НовыеДанные.Вставить("КоличествоШаблонов", 0);
	НовыеДанные.Вставить("ПервыйШаблон", Справочники.ШаблоныДокументов.ПустаяСсылка());
	НовыеДанные.Вставить("ПерваяТематика", Справочники.ТематикиДокументов.ПустаяСсылка());
	
	Возврат НовыеДанные;
	
КонецФункции

#КонецОбласти