#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиВызовСервера.ОбновитьИспользованиеРаспознаванияПриПомощиCuneiForm();
	РаботаСФайламиВызовСервера.ОбновитьИспользуетсяРаспознаваниеПриПомощиСервиса();
	ТаймлистВызовСервера.ОбновитьИспользуетсяРаспознаваниеПриПомощиТаймлист();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли