//#Область ОбработчикиФормы

//&НаСервере
//Процедура ЦППК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	
//	Если Параметры.Свойство("БылаОткрытаФормаПодписи") Тогда
//		БылаОткрытаФормаПодписи = Параметры.БылаОткрытаФормаПодписи;	
//	КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыФормы

//&НаКлиенте
//Процедура ЦППК_ПодписатьПосле(Команда)
//	
//	Если БылаОткрытаФормаПодписи Тогда
//		Оповестить("ПодписаноЧерезФормуПодписи_ВыполнитьЗадачу");
//	КонецЕсли; 
//	
//КонецПроцедуры


//#КонецОбласти