
&НаКлиенте
Процедура НастройкаДоступностиПоСостояниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ВидДокумента) Тогда 
		
		СтандартнаяОбработка = Ложь;
		ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ДокументыПредприятия");	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ТипДокумента", ТипДокумента));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.НастройкаДоступностиПоСостоянию);
		
		ОткрытьФорму("Справочник.НастройкиДоступностиПоСостоянию.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.НастройкаДоступностиПоСостоянию) Тогда 
		
		СтандартнаяОбработка = Ложь;	
		ИмяФормыВыбора = "Справочник.ВидыДокументов.ФормаВыбора";
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.ВидДокумента);
		
		ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры
