////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РольПредмета = Параметры.РольПредмета;
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
		Параметры.БизнесПроцесс.Метаданные().ПолноеИмя());
	РолиПредметов = Менеджер.ПолучитьДоступныеРолиПредметов();
	
	ТипыОсновныхПредметов = 
		Мультипредметность.ТипыОсновныхПредметовВПользовательскомИнтерфейсе(
			Параметры.БизнесПроцесс);
	
	Элементы.РольПредмета.СписокВыбора.Очистить();
	
	Если РолиПредметов.Найти(Перечисления.РолиПредметов.Основной) <> Неопределено
		И (Параметры.ТипПредмета = Тип("Неопределено")
			Или ТипыОсновныхПредметов.Найти(Параметры.ТипПредмета) <> Неопределено) Тогда
		
		Элементы.РольПредмета.СписокВыбора.Добавить(
			Перечисления.РолиПредметов.Основной);
	КонецЕсли;
	
	Если РолиПредметов.Найти(Перечисления.РолиПредметов.Вспомогательный) <> Неопределено Тогда
		Элементы.РольПредмета.СписокВыбора.Добавить(
			Перечисления.РолиПредметов.Вспомогательный);
	КонецЕсли;
	
	Если РолиПредметов.Найти(Перечисления.РолиПредметов.Заполняемый) <> Неопределено Тогда
		Элементы.РольПредмета.СписокВыбора.Добавить(
			Перечисления.РолиПредметов.Заполняемый);
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(Элементы.РольПредмета.СписокВыбора.Количество());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(РольПредмета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть()
	
КонецПроцедуры

