// @strict-types

#Область ПрограммныйИнтерфейс

// Добавляет задание обновления обсуждений в очередь отложенной обработки.
//
// Параметры:
//	Объект - СправочникОбъект,
//		   - РегистрСведенийНаборЗаписей - Объект, для которого необходимо добавить задание.
//
// Возвращаемое значение:
//	Булево - Истина - Задание добавлено.
//
Функция ДобавитьЗаданиеОбновитьОбсужденияПоОбъекту(Объект) Экспорт
	
	Если Не ОбщегоНазначенияДокументооборот.ЭтоДокументооборотХолдинга()
			Или Не ОбщегоНазначенияДокументооборотХолдинг.ЭтоЗагрузкаОбъекта(Объект)
			Или Не КОДПовтИсп.ИспользуетсяОтложеннаяОбработкаДанныхКОД() Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	КОДСлужебный.ДобавитьЗаданиеОтложеннойОбработки(
		Перечисления.ТипыОтложеннойОбработки.ОбновлениеОбсуждений,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Новый Структура("Объект, Параметры", Объект, Объект.ДополнительныеСвойства)));
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти