
&Перед("ПередЗаписью")
Процедура ЦППК_ПередЗаписью(Отказ)
	
	// Горбачев А.В. 26.07.2024
	//
	// Отключаем данную функциональность, т.к. данный функционал присутствует в типовой конфигурации.
	// TODO: удалить из расширения справочник "ЗначенияСвойствОбъектов".
	//
	//Если Не УправлениеСвойствами.ЗначениеСвойства(Пользователи.ТекущийПользователь(), "ДоступноДобавлениеДопЗначений") = Истина Тогда
	//	Отказ = Истина;
	//	ОбщегоНазначения.СообщитьПользователю("Недостаточно прав на создание дополнительного значения");
	//КонецЕсли;

КонецПроцедуры
