
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истина, если включена ФО ИспользоватьМоиДокументы.
//
// Возвращаемое значение:
//   Булево - Истина, если включена ФО ИспользоватьМоиДокументы.
//
Функция МоиДокументыИспользуются() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьМоиДокументы");
	
КонецФункции

// Возвращает Истина, если есть виды документов ИсходящаяКорреспонденция с настройкой "Учитывать входящий номер и дату получателя"
//
// Возвращаемое значение:
//   Булево
//
Функция ЕстьИсходящиеВидыДокументовСУчетомВходящегоНомера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыДокументов КАК ВидыДокументов
		|ГДЕ
		|	ВидыДокументов.ЯвляетсяИсходящейКорреспонденцией = ИСТИНА
		|	И ВидыДокументов.УчитыватьВходящийНомерИДатуПолучателя = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
