
&ИзменениеИКонтроль("ПолучитьНастройкиАвтообновленияФормы")
Функция ЦППК_ПолучитьНастройкиАвтообновленияФормы(Форма)

	Результат = Новый Структура("Автообновление, ПериодАвтоОбновления", Ложь, 0);

	Если ТипЗнч(Форма) = Тип("Строка") Тогда
		КлючОбъекта = Форма + ".Автообновление";
	Иначе
		КлючОбъекта = Форма.ИмяФормы + ".Автообновление";
	КонецЕсли;

	КлючНастройки = Строка(ПолучитьСкоростьКлиентскогоСоединения());
	Настройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастройки);
	Если ЗначениеЗаполнено(Настройки) Тогда
		#Удаление
		Результат.Автообновление = Настройки.Автообновление;
		Результат.ПериодАвтоОбновления = Настройки.ПериодАвтоОбновления;
		#КонецУдаления
		#Вставка
		Результат.Автообновление = Ложь;;
		Результат.ПериодАвтоОбновления = 3600;
		#КонецВставки
		
	КонецЕсли;

	Возврат Результат;

КонецФункции
