
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	ПрочитатьПараметрыСхемыВФорму(Параметры.ПараметрыСхемы);

	СхемыПроцессовСервер.ПрочитатьСхемуВФорму(ДанныеПараметров.Схема, ЭтотОбъект);
	СхемыПроцессовКлиентСервер.ЗаполнитьНавигационнуюСсылкуФормыПоДаннымСхемы(ЭтотОбъект);
	
	ЗаполнитьЗаголовок(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьПараметрыСхемыВФорму(ПараметрыСхемы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПараметров = Новый Структура("Ссылка, Схема");
	
	ДанныеПараметров.Ссылка = ПараметрыСхемы;	
	ДанныеПараметровСхемы = Справочники.ПараметрыСхемДляОбработокОбъектов.ДанныеПараметровСхемы(ПараметрыСхемы);
	ДанныеПараметров.Схема = ДанныеПараметровСхемы.Схема;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовок(Форма)
	
	Форма.Заголовок = СтрШаблон("%1 (схема обработки)",
		СхемыПроцессовКлиентСервер.НаименованиеСхемыПоДаннымВФорме(Форма));
	
КонецПроцедуры

#КонецОбласти
