 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтотОбъект.Параметры.ЗначенияЗаполнения.Свойство("Направление") Тогда
		Направление = ЭтотОбъект.Параметры.ЗначенияЗаполнения.Направление;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Направление) Тогда
		РегистрыСведений.ТТС_НаправленияСтанций.ЗаписатьНаправлениеСтанции(Объект.Ссылка,Направление);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
