#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееЗначение = Константы.ИспользоватьЧатБота.Получить();
	ДополнительныеСвойства.Вставить("ПредыдущееЗначение", ПредыдущееЗначение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если КОДСервер.ЭтоЦентральныйУзел()
		И ДополнительныеСвойства.ПредыдущееЗначение <> Значение Тогда
		
		Если Константы.ИспользоватьУведомленияЧерезTelegram.Получить() Тогда
			Константы.ИспользоватьУведомленияЧерезTelegram.Установить(Ложь);
		КонецЕсли;
		
		Если Константы.ИспользоватьУведомленияЧерезВКонтакте.Получить() Тогда
			Константы.ИспользоватьУведомленияЧерезВКонтакте.Установить(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли