
&НаКлиенте
Процедура ЦППК_ИсполнительПриИзмененииПосле(Элемент) //+ЦППК САНФ-023288 08.02.2024

	//++AxelSoft Шарапова 10.05.2025 САНФ-033681	
	Если Объект.Исполнители.Количество() = 1 Тогда
	
		ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
		
		ТипыПредметов = Новый Массив;
		ТипыПредметов.Добавить(Тип("СправочникСсылка.ДокументыПредприятия"));
		
		ОбрабатываемыеПредметы = МультипредметностьКлиентСервер.ПолучитьМассивПредметовОбъекта(Объект, ТипыПредметов, Истина);
		
		СрокИсполнения = ЦППК_ОбщийМодульВызовСервера.ЗаполнитьСрокИсполнения(ОбрабатываемыеПредметы, Объект.ГлавнаяЗадача);

		ЦППК_ОбщийМодульКлиентСервер.ЗаполнитьСтрокуСрокИсполнения(ТекущиеДанные, СрокИсполнения, Объект.Дата);
				
	КонецЕсли;
 	//--AxelSoft Шарапова 10.05.2025 САНФ-033681	

КонецПроцедуры

//++AxelSoft Шарапова 30.10.2024 САНФ-029233
&НаКлиенте
Процедура ЦППК_ИсполнителиСрокИсполненияПредставлениеРегулированиеПосле(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.СрокОбработкиРезультатов = Объект.СрокИсполненияПроцесса;
	
КонецПроцедуры
//--AxelSoft Шарапова 30.10.2024 САНФ-029233
