
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Штрихкод = Истина;
	
	УстановитьВидимость();
	
	РеквизитыКарточки = Истина;
	ВестиУчетТоваровИУслуг = ВключенУчетТоваров;
	ДопРеквизиты = Истина;
	ИсторияСрокаДействия = Ложь;
	ПриложенныеФайлы = Истина;
	ВерсииФайлов = Ложь;
	ЭП = Ложь;
	СоставКомплекта = Истина;
	СвязанныеДокументы = Истина;
	ЖурналПередачи = Истина;
	Резолюции = Истина;
	Обработка = Истина;
	Стороны = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("РеквизитыКарточки", РеквизитыКарточки);
	ПараметрыПечати.Вставить("ВестиУчетТоваровИУслуг", ВестиУчетТоваровИУслуг И ВключенУчетТоваров);
	ПараметрыПечати.Вставить("ДопРеквизиты", ДопРеквизиты);
	ПараметрыПечати.Вставить("ИсторияСрокаДействия", ИсторияСрокаДействия);
	ПараметрыПечати.Вставить("ПриложенныеФайлы", ПриложенныеФайлы);
	ПараметрыПечати.Вставить("ВерсииФайлов", ВерсииФайлов);
	ПараметрыПечати.Вставить("ЭП", ЭП);
	ПараметрыПечати.Вставить("СоставКомплекта", СоставКомплекта);
	ПараметрыПечати.Вставить("СвязанныеДокументы", СвязанныеДокументы);
	ПараметрыПечати.Вставить("ЖурналПередачи", ЖурналПередачи);
	ПараметрыПечати.Вставить("Резолюции", Резолюции);
	ПараметрыПечати.Вставить("Стороны", Стороны);
	ПараметрыПечати.Вставить("Штрихкод", Штрихкод);
	
	ПараметрыПечати.Вставить("Обработка", Обработка);
	
	Закрыть();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Справочник.ДокументыПредприятия",
		"Карточка",
		Параметры.ПараметрКоманды,
		ВладелецФормы,
		ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки()
	
	УстановкаПометок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки()
	
	УстановкаПометок(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПометок(Значение)
	
	РеквизитыКарточки = Значение;
	ДопРеквизиты = Значение;
	ИсторияСрокаДействия = Значение;
	ПриложенныеФайлы = Значение;
	ВерсииФайлов = Значение;
	ЭП = Значение;
	СоставКомплекта = Значение;
	СвязанныеДокументы = Значение;
	ЖурналПередачи = Значение;
	Резолюции = Значение; 
	Обработка = Значение;
	ВестиУчетТоваровИУслуг = Значение;
	Стороны = Значение;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	УчитыватьСрокДействия = Ложь; ВключенУчетТоваров = Ложь;
	ВключенУчетСторон = Ложь;
	
	Для Каждого Параметр Из Параметры.ПараметрКоманды Цикл
		РеквизитыПараметра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметр, 
			"ВидДокумента.УчитыватьСрокДействия,
			|ВидДокумента.ВестиУчетТоваровИУслуг, ВидДокумента.ВестиУчетСторон");
		
		Если РеквизитыПараметра.ВидДокументаУчитыватьСрокДействия Тогда
			УчитыватьСрокДействия = Истина;
		КонецЕсли;
				
		Если РеквизитыПараметра.ВидДокументаВестиУчетТоваровИУслуг Тогда
			ВключенУчетТоваров = Истина;
		КонецЕсли;
		
		Если РеквизитыПараметра.ВидДокументаВестиУчетСторон Тогда
			ВключенУчетСторон = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	Элементы.ИсторияСроковДействия.Видимость = УчитыватьСрокДействия;
	Элементы.ВестиУчетТоваровИУслуг.Видимость = ВключенУчетТоваров;
	Элементы.Стороны.Видимость = ВключенУчетСторон;   
	
	ИспользоватьШтрихкоды = ПолучитьФункциональнуюОпцию("ИспользоватьШтрихкоды");
	Элементы.Штрихкод.Видимость = ИспользоватьШтрихкоды;
	Если Не ИспользоватьШтрихкоды Тогда
		Штрихкод = Ложь;
	КонецЕсли;	
	
КонецПроцедуры