
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на пополнение баланса сервиса распознавания текстов.
//
// Возвращаемое значение:
//  Строка
//
Функция АдресЛичногоКабинета() Экспорт
	
	Возврат "https://portal.1c.ru/application/list/1C-Document-Recognition";
	
КонецФункции

#Область ПодключениеСервисовСопровождения

// Возвращает идентификатор сервиса распознавания текстов.
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторСервиса() Экспорт
	
	Возврат "1C-Document-Recognition";
	
КонецФункции

#КонецОбласти

#КонецОбласти