
&ИзменениеИКонтроль("ДобавитьОбзорЛистаПодписанияДокумента")
Процедура ЦППК_ДобавитьОбзорЛистаПодписанияДокумента(HTMLТекст, Документ, ВсеДействия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеВизыПодписания = ПодписантыИлиУтвердившиеДокументСРезультатамиДляОбзора(Документ, ВсеДействия);
	
	Если ВсеВизыПодписания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<p>";
	HTMLТекст = HTMLТекст + "<p>";

	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<table border=""0"" bordercolor = ""white"" style=""border-collapse: collapse;"" >";
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td align=center colspan=""6"">";
	
	HTMLТекст = HTMLТекст + СтрШаблон(
		"<B>%1</B>",
		НСтр("ru = 'Лист подписания'"));
	
	HTMLТекст = HTMLТекст + "<p>";
	HTMLТекст = HTMLТекст + "</td>";
	HTMLТекст = HTMLТекст + "</tr>";
	HTMLТекст = HTMLТекст + "</table>";
	HTMLТекст = HTMLТекст + "</tr>";
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<table border=""1"" bordercolor = ""black"" style=""border-collapse: collapse;"" >";
	HTMLТекст = HTMLТекст + "<tr>";
	
	ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'ФИО, Должность'"), "30%",, "black");
	ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Результат'"), "20%",, "black");
	ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Дата'"), "20%",, "black");
	ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Комментарий'"), "30%",, "black");
	
	HTMLТекст = HTMLТекст + "</tr>";

	Для Каждого СтрокаИсполнитель Из ВсеВизыПодписания Цикл

		ТекстПодписи = "";	ФИОДолжность = ""; РезультатВыполнения = "";		
		ПредставленияПравок = Новый Массив;
		ПодписыватьУЭП = Ложь;	
		Если ЗначениеЗаполнено(СтрокаИсполнитель.Результат) Тогда
			
			СпособПодписания = Перечисления.СпособыПодписанияПредметаДействия.НаБумаге;
			Если ТипЗнч(СтрокаИсполнитель.Действие) = Тип("СправочникСсылка.ДействияПодписания") Тогда
				
				СпособПодписания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					СтрокаИсполнитель.Действие, "СпособПодписания");	
			КонецЕсли;	
			
			Если СпособПодписания = Перечисления.СпособыПодписанияПредметаДействия.НаБумаге Тогда
				
				ТекстПодписи = НСтр("ru='На бумаге'");
				
			ИначеЕсли СпособПодписания = Перечисления.СпособыПодписанияПредметаДействия.УЭП
				И СтрокаИсполнитель.Результат <> Перечисления.СостоянияДокументов.Отклонен Тогда
				
				УстановилПодпись = Неопределено;
				Если ТипЗнч(СтрокаИсполнитель.Подписант) = Тип("СправочникСсылка.ФактическиеИсполнители") Тогда
					УстановилПодпись = Сотрудники.ПользовательСотрудника(
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаИсполнитель.Подписант, "Отметил"));
				Иначе
					УстановилПодпись = Сотрудники.ПользовательСотрудника(СтрокаИсполнитель.Подписант);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаИсполнитель.ПравилоЭскалации) Тогда
					ПодписыватьУЭП = Истина;
					ТекстПодписи = РаботаСЭП.ТекстПодписиУЭПДляВывода(Документ, УстановилПодпись);
				Иначе
					СтрокаИсполнитель.Комментарий = НСТр("ru = 'Подписано автоматически'"); 
				КонецЕсли;
				
			Иначе
				
				ТекстПодписанта = СтрокаИсполнитель.ПредставлениеФактическогоИсполнителя;
				
				Если Не ЗначениеЗаполнено(СтрокаИсполнитель.ПравилоЭскалации) Тогда
					
					ТекстПодписи = НСтр("ru = 'ПРОСТАЯ ЭЛЕКТРОННАЯ ПОДПИСЬ'")
						+ Символы.ПС 
						+ ТекстПодписанта;
					
				Иначе
					
					СтрокаИсполнитель.Комментарий = НСТр("ru = 'Подписано автоматически'");
					
				КонецЕсли;
				 
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсполнитель.Комментарий) Тогда 
			ПредставленияПравок.Добавить(СтрокаИсполнитель.Комментарий);
		КонецЕсли;
		
		Если ПредставленияПравок.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПредставленияПравок, "");
			РезультатВыполнения = СтрСоединить(ПредставленияПравок, Символы.ПС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсполнитель.Подписант) Тогда
			
			ФИОДолжность = ""; 
			Если ЗначениеЗаполнено(СтрокаИсполнитель.ПредставлениеФактическогоИсполнителя) Тогда
				// Подписание завершено
				ФИОДолжность = СтрокаИсполнитель.ПредставлениеФактическогоИсполнителя;
			Иначе
				// Подписание не завершено
				ФИОДолжность = Строка(СтрокаИсполнитель.Подписант);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаИсполнитель.РольИсполнителя) Тогда
				
				ФИОДолжность = СтрШаблон("%1 (%2)",
					СтрокаИсполнитель.ПредставлениеФактическогоИсполнителя,
					СтрокаИсполнитель.РольИсполнителя);
				
			КонецЕсли;
			
		КонецЕсли;
		
#Удаление
		Если ЗначениеЗаполнено(СтрокаИсполнитель.Результат) И ЗначениеЗаполнено(ТекстПодписи) Тогда
			HTMLТекст = HTMLТекст + "<tr>";
			
			HTMLТекст = HTMLТекст + "<td width=""30%"" Rowspan = ""2"" align=left bordercolor = ""black"" >";
			ФИОДолжность = СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(ФИОДолжность), Символы.ПС, "<br>");
			ДобавитьРеквизит(HTMLТекст, ФИОДолжность, "");
			HTMLТекст = HTMLТекст + "</td>";
			
			ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаИсполнитель.Результат, "20%");
			ДобавитьЯчейкуТаблицы(HTMLТекст, Формат(СтрокаИсполнитель.ДатаИсполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'"), "20%", "left");
			
			HTMLТекст = HTMLТекст + "<td width=""30%"" Rowspan = ""2"" align=left bordercolor = ""black"" >";
			РезультатВыполнения = СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(РезультатВыполнения), Символы.ПС, "<br>");
			ДобавитьРеквизит(HTMLТекст, РезультатВыполнения, "");
			HTMLТекст = HTMLТекст + "</td>";
			
			HTMLТекст = HTMLТекст + "</tr>";
			
			// Строка с подписью
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td colspan=""2"" align=left bordercolor = ""black"" >";
			
			Если ПодписыватьУЭП Тогда
				HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A>",
				"DigitalSignature",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ТекстПодписи));
			Иначе
				ДобавитьПодписьСЦветом(HTMLТекст, ТекстПодписи, "#006699");
			КонецЕсли;
			
			HTMLТекст = HTMLТекст + "</td>";
			HTMLТекст = HTMLТекст + "</tr>";
			
		Иначе
				
			HTMLТекст = HTMLТекст + "<tr>";
			
			ДобавитьЯчейкуТаблицы(HTMLТекст, ФИОДолжность, "30%", "left");
			ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаИсполнитель.Результат, "20%");
			ДобавитьЯчейкуТаблицы(HTMLТекст, 
				Формат(СтрокаИсполнитель.ДатаИсполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'"), "20%", "left");
			ДобавитьЯчейкуТаблицы(HTMLТекст, РезультатВыполнения, "30%", "left");
							
			HTMLТекст = HTMLТекст + "</tr>";
			
		КонецЕсли;
#КонецУдаления
#Вставка
		HTMLТекст = HTMLТекст + "<tr>";

		ДобавитьЯчейкуТаблицы(HTMLТекст, ФИОДолжность, "30%", "left");
		ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаИсполнитель.Результат, "20%");
		ДобавитьЯчейкуТаблицы(HTMLТекст, 
		Формат(СтрокаИсполнитель.ДатаИсполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'"), "20%", "left");
		ДобавитьЯчейкуТаблицы(HTMLТекст, РезультатВыполнения, "30%", "left");

		HTMLТекст = HTMLТекст + "</tr>";
#КонецВставки
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</table>";
	HTMLТекст = HTMLТекст + "</tr>";
	
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьОбзорЛистаСогласованияДокумента")
Процедура ЦППК_ДобавитьОбзорЛистаСогласованияДокумента(HTMLТекст, Документ)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = РаботаСВизамиСогласования.ТекстЗапросаДляЛистаСогласования();
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Документ);
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Действие = Неопределено;
	
	ДействияСоответствие = Новый Соответствие;
	ВсеВизыСогласования = Новый Массив;
	// сперва найдем все Действия
	Для Каждого СтрокаСсылка Из Результат.Строки Цикл
		Для Каждого СтрокаИсполнитель Из СтрокаСсылка.Строки Цикл
			
			Действие = СтрокаИсполнитель.Источник;
			Ветка = СогласованиеВРежимеЗамечанийСервер.НайтиВеткуОбработки(Действие);
			Если ЗначениеЗаполнено(Ветка) Тогда
				ДействияСоответствие[Действие] = Ветка;
			Иначе
				ДействияСоответствие[Действие] = 1;
			КонецЕсли;
			
			Если ВсеВизыСогласования.Найти(СтрокаИсполнитель.ВизаСогласования) = Неопределено Тогда
				ВсеВизыСогласования.Добавить(СтрокаИсполнитель.ВизаСогласования);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;	
	ВеткиМассив = Новый Массив;
	Для Каждого КлючИЗначение Из ДействияСоответствие Цикл
		ВеткиМассив.Добавить(КлючИЗначение.Значение);
	КонецЦикла;	
	Замечания = РаботаСВизамиСогласования.ЗамечанияПоВеткам(ВеткиМассив);
	
	НомерИтерации = РегистрыСведений.ИтерацииДействий.НомерИтерации(Действие);
	Разногласия = РаботаСВизамиСогласования.ВсеРазногласия(Действие, НомерИтерации);
	ВерсииСогласованныхФайлов = РегистрыСведений.ВерсииСогласованныхФайлов.ВсеВерсииПоСпискуВиз(
		ВсеВизыСогласования);
	
	Если ВсеВизыСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<p>";
	HTMLТекст = HTMLТекст + "<p>";
		
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""4"" align=center>";
	
	HTMLТекст = HTMLТекст + СтрШаблон(
		"<B>%1</B>",
		НСтр("ru = 'Лист согласования'"));
	
	HTMLТекст = HTMLТекст + "<p>";
	HTMLТекст = HTMLТекст + "</td>";
	
	Для Каждого СтрокаСсылка Из Результат.Строки Цикл
		HTMLТекст = HTMLТекст + "<table border=""1"" bordercolor = ""black"" style=""border-collapse: collapse;"" >";
		HTMLТекст = HTMLТекст + "<tr>";
		
		ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'ФИО, Должность'"), "30%",, "black");
		ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Результат'"), "20%",, "black");
		ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Дата'"), "20%",, "black");
		ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Замечания, комментарии'"), "30%",, "black");
		
		HTMLТекст = HTMLТекст + "</tr>";
	
		Для Каждого СтрокаИсполнитель Из СтрокаСсылка.Строки Цикл

			ТекстПодписи = "";	ФИОДолжность = ""; РезультатВыполнения = "";
			ПодписыватьУЭП = Ложь;
			Если ЗначениеЗаполнено(СтрокаИсполнитель.ФактическийИсполнитель) Тогда
				
				ПредставленияПравок = Новый Массив;
				
				ДанныеОбИзмененииФайлов = РаботаСВизамиСогласования.ДанныеОбИзмененииФайловПоВизеСогласования(
					ВерсииСогласованныхФайлов, СтрокаИсполнитель.ВизаСогласования);
				ВерсииИзменились = ДанныеОбИзмененииФайлов.ВерсииОтличаются; 
				ОтслеживаниеВерсийПроизводилось = ДанныеОбИзмененииФайлов.ОтслеживаниеВерсийПроизводилось;
				
				Ветка = ДействияСоответствие.Получить(СтрокаИсполнитель.Источник);
				
				Если ЗначениеЗаполнено(СтрокаИсполнитель.РезультатСогласования) 
					И ЗначениеЗаполнено(СтрокаИсполнитель.Источник)
					И Не ЗначениеЗаполнено(СтрокаИсполнитель.ПравилоЭскалации) Тогда
					
					Если ТипЗнч(СтрокаИсполнитель.Источник) = Тип("СправочникСсылка.ДействияСогласования") Тогда
						
						ПодписыватьУЭП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							СтрокаИсполнитель.Источник, "ПодписыватьУЭП");
							
					ИначеЕсли ТипЗнч(СтрокаИсполнитель.Источник) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда		
							
						БизнесПроцесс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							СтрокаИсполнитель.Источник, "БизнесПроцесс");
							
						Если ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.Согласование") Тогда	
							ПодписыватьУЭП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								БизнесПроцесс, "ПодписыватьЭП");
						КонецЕсли;	
						
					КонецЕсли;
					
#Удаление
					ТекстПодписи = РаботаСВизамиСогласования.ТекстШтампаЛистаСогласования(СтрокаИсполнитель, ПодписыватьУЭП); 
#КонецУдаления
				
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Ветка)
					И ТипЗнч(Ветка) = Тип("СправочникСсылка.ВеткиОбработки") Тогда // это согл в режиме замечаний
					
					СтруктураПоиска = Новый Структура("ВеткаОбработки, ТипЗамечания, НомерЭтапа",
						Ветка,
						Неопределено,
						СтрокаИсполнитель.НомерИтерации);
						
					СтруктураПоиска.Вставить("ИдентификаторАвтора", СтрокаИсполнитель.ИдентификаторУчастника);
					
					// Замечания.
					СтруктураПоиска.ТипЗамечания = Перечисления.ТипыЗамечаний.Замечание;
					ЗамечанияСтроки = Замечания.НайтиСтроки(СтруктураПоиска);
					
					Для Каждого Замечание Из ЗамечанияСтроки Цикл 
						ПредставленияПравок.Добавить(РаботаСВизамиСогласования.ПредставлениеЗамечания(Замечание));
					КонецЦикла;
					
					// Комментарии.
					СтруктураПоиска.ТипЗамечания = Перечисления.ТипыЗамечаний.Комментарий;
					КомментарииСтроки = Замечания.НайтиСтроки(СтруктураПоиска);
					
					ВыделятьКомментарий = 
						СтрокаИсполнитель.РезультатСогласования = Перечисления.РезультатыСогласования.НеСогласовано;
					
					Для Каждого Комментарий Из КомментарииСтроки Цикл 
						ПредставленияПравок.Добавить(РаботаСВизамиСогласования.ПредставлениеЗамечания(Комментарий, ВыделятьКомментарий));
					КонецЦикла;
				
				ИначеЕсли ЗначениеЗаполнено(СтрокаИсполнитель.РезультатВыполнения) Тогда 
					ПредставленияПравок.Добавить(СтрокаИсполнитель.РезультатВыполнения);	
				КонецЕсли;		
				
				Если ПредставленияПравок.Количество() > 0 Тогда
					ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПредставленияПравок, "");
					РезультатВыполнения = СтрСоединить(ПредставленияПравок, Символы.ПС);
				Иначе 
					РезультатВыполнения = СтрокаИсполнитель.РезультатВыполнения;
				КонецЕсли;
			КонецЕсли;
			
#Удаление
			ФИОДолжность = СтрокаИсполнитель.ПредставлениеФактическогоИсполнителя; 
			Если Не ЗначениеЗаполнено(ФИОДолжность) Тогда
				ФИОДолжность = Строка(СтрокаИсполнитель.ФактическийИсполнитель); 
			КонецЕсли;
#КонецУдаления
#Вставка 					
			ФИОДолжность = Строка(СтрокаИсполнитель.ФактическийИсполнитель); 
#КонецВставки 					
			
			Если Не ЗначениеЗаполнено(СтрокаИсполнитель.Исполнитель) Тогда 
				
				Если ЗначениеЗаполнено(СтрокаИсполнитель.ФактическийИсполнитель) Тогда 
					ФИОДолжность = 
						СтрШаблон("%1 (%2)", 
						ФИОДолжность, 
						СтрокаИсполнитель.РольИсполнителя);
#Вставка 					
					РезультатВыполнения = СтрокаИсполнитель.РезультатВыполнения;
					ФИОДолжность = СтрокаИсполнитель.ФактическийИсполнитель;
					
					Если СтрНайти(ФИОДолжность, "Отметил(а):") > 0 Тогда
						ФИОДолжность = СтрокаИсполнитель.ФактическийИсполнитель.Факт;	 
					КонецЕсли;
					
					Если СтрокаИсполнитель.ФактическийИсполнитель.Факт.Должность.Наименование = СтрокаИсполнитель.ФактическийИсполнитель.Факт.Подразделение.Наименование Тогда
						ПодстрокаПоиска = СтрШаблон(", %1", СтрокаИсполнитель.ФактическийИсполнитель.Факт.Должность.Наименование); 
						ФИОДолжность = СтрЗаменить(ФИОДолжность, ПодстрокаПоиска, ", Руководство");	 
					КонецЕсли;
									
#КонецВставки
				Иначе
					ФИОДолжность = СтрокаИсполнитель.РольИсполнителя;
				КонецЕсли;
				
			Иначе
				
				Если Не ЗначениеЗаполнено(СтрокаИсполнитель.ФактическийИсполнитель) Тогда
					ФИОДолжность = СтрокаИсполнитель.Исполнитель;
#Вставка 
					РезультатВыполнения = СтрокаИсполнитель.РезультатВыполнения;
					Если СтрНайти(ФИОДолжность, "Отметил(а):") > 0 Тогда
						ФИОДолжностьФИОДолжность = СтрокаИсполнитель.Исполнитель;	 
					КонецЕсли; 
					
					Если СтрокаИсполнитель.Исполнитель.Должность.Наименование = СтрокаИсполнитель.Исполнитель.Подразделение.Наименование Тогда
						ПодстрокаПоиска = СтрШаблон(", %1", СтрокаИсполнитель.Исполнитель.Должность.Наименование); 
						ФИОДолжность = СтрЗаменить(СтрокаИсполнитель.Исполнитель, ПодстрокаПоиска, ", Руководство");	 
					КонецЕсли;
#КонецВставки
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаИсполнитель.РезультатСогласования) И ЗначениеЗаполнено(ТекстПодписи) Тогда
				
				HTMLТекст = HTMLТекст + "<tr>";
				HTMLТекст = HTMLТекст + "<td width=""30%"" Rowspan = ""3"" align=left bordercolor = ""black"" >";
				ФИОДолжность = СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(ФИОДолжность), Символы.ПС, "<br>");
				ДобавитьРеквизит(HTMLТекст, ФИОДолжность, "");
				HTMLТекст = HTMLТекст + "</td>";
				
				ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаИсполнитель.РезультатСогласования, "20%");
				ДобавитьЯчейкуТаблицы(HTMLТекст, Формат(СтрокаИсполнитель.ДатаИсполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'"), "20%", "left");
				
				HTMLТекст = HTMLТекст + "<td width=""30%"" Rowspan = ""3"" align=left bordercolor = ""black"" >";
				РезультатВыполнения = СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(РезультатВыполнения), Символы.ПС, "<br>");
				
				HTMLТекст = HTMLТекст + СтрШаблон(
					"<A color=""black"" href=v8doc:%1><FONT color=""black"">%2</FONT></A>",
					СтрШаблон("v8doc:MXLDetails/ShowApprovedFileVersions/%1",
						ПолучитьНавигационнуюСсылку(СтрокаИсполнитель.ВизаСогласования)),
					РезультатВыполнения);
				HTMLТекст = HTMLТекст + "<br>";
				HTMLТекст = HTMLТекст + "</td>";
				
				HTMLТекст = HTMLТекст + "</tr>";
				
				// Строка с подписью
				HTMLТекст = HTMLТекст + "<tr>";
				HTMLТекст = HTMLТекст + "<td style =""border-bottom:0px"" colspan=""2"" align=left bordercolor = ""black"" >";
				Если ПодписыватьУЭП Тогда
											
					HTMLТекст = HTMLТекст + СтрШаблон(
						"<A href=v8doc:%1>%2</A>",
						ПолучитьНавигационнуюСсылку(СтрокаИсполнитель.ВизаСогласования),
						РаботаС_HTML.ЗаменитьСпецСимволыHTML(ТекстПодписи));
				
				Иначе
					ДобавитьПодписьСЦветом(HTMLТекст, ТекстПодписи, "#006699");
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "</td>";
				HTMLТекст = HTMLТекст + "</tr>";
				
				HTMLТекст = HTMLТекст + "<tr>";
				HTMLТекст = HTMLТекст + "<td style =""border-top:0px"" colspan=""2"" align=left bordercolor = ""black"" >";
				
				Если ВерсииИзменились Тогда
					
					ДобавитьПодписьСЦветом(HTMLТекст, РаботаСВизамиСогласования.ТекстЗамечанияОбИзмененииВерсии(), 
						"#FF0000");
					
				Иначе
					
					HTMLТекст = HTMLТекст + "<br/>";
					
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "</td>";
				HTMLТекст = HTMLТекст + "</tr>";
				
			Иначе
					
				HTMLТекст = HTMLТекст + "<tr>";
				
				ДобавитьЯчейкуТаблицы(HTMLТекст, ФИОДолжность, "30%", "left");
				ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаИсполнитель.РезультатСогласования, "20%");
				ДобавитьЯчейкуТаблицы(HTMLТекст, 
					Формат(СтрокаИсполнитель.ДатаИсполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'"), "20%", "left");
				ДобавитьЯчейкуТаблицы(HTMLТекст, РезультатВыполнения, "30%", "left");
								
				HTMLТекст = HTMLТекст + "</tr>";
				
			КонецЕсли;
		КонецЦикла;
		
		HTMLТекст = HTMLТекст + "</table>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		// Выведем протокол разногласий, если есть разногласия
		Если Разногласия.Количество() > 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
			HTMLТекст = HTMLТекст + "<p>";

			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<table border=""0"" bordercolor = ""white"" style=""border-collapse: collapse;"" >";
			
			HTMLТекст = HTMLТекст + "<tr>";
		    HTMLТекст = HTMLТекст + "<td align=center colspan=""6"">";
			
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<B>%1</B>",
				НСтр("ru = 'Протокол разногласий'"));
			
			HTMLТекст = HTMLТекст + "<p>";
			HTMLТекст = HTMLТекст + "</td>";
			HTMLТекст = HTMLТекст + "</tr>";
			HTMLТекст = HTMLТекст + "</table>";
			HTMLТекст = HTMLТекст + "</tr>";
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<table border=""1"" bordercolor = ""black"" style=""border-collapse: collapse;"" >";
			
			HTMLТекст = HTMLТекст + "<tr>";

			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = '№'"), "5%",, "black");
			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Автор'"), "25%",, "black");
			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Замечание'"), "20%",, "black");
			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Комментарий инициатора'"), "20%",, "black");
			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Принятая редакция'"), "20%",, "black");
			ДобавитьЯчейкуТаблицы(HTMLТекст, НСтр("ru = 'Дата'"), "10%",, "black");
			
			HTMLТекст = HTMLТекст + "</tr>";
			
			Номер = 1;
			
			ИДУчастникаИРолиСоответствие = Новый Соответствие;
			Для Каждого СтрокаИсполнитель Из ВсеВизыСогласования Цикл  
				ИДУчастникаИРолиСоответствие[СтрокаИсполнитель.ИдентификаторУчастника]= СтрокаИсполнитель.РольИсполнителя;
			КонецЦикла;
			
			Для Каждого СтрокаРазногласия Из Разногласия Цикл
				HTMLТекст = HTMLТекст + "<tr>";
				
				ДобавитьЯчейкуТаблицы(HTMLТекст, Номер, "5%");
				
				РольИсполнителя = ИДУчастникаИРолиСоответствие[СтрокаРазногласия.ИдентификаторАвтора];
				Если ЗначениеЗаполнено(РольИсполнителя) Тогда
					АвторСРольюПредставление = СтрШаблон("%1 (%2)",
						СтрокаИсполнитель.Автор,
						РольИсполнителя);
					ДобавитьЯчейкуТаблицы(HTMLТекст, АвторСРольюПредставление, "25%", "Left");
				Иначе
					ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаРазногласия.Автор, "25%", "Left");
				КонецЕсли;
				
				ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаРазногласия.Замечание, "20%", "Left");
				ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаРазногласия.Комментарий, "20%", "Left");
				ДобавитьЯчейкуТаблицы(HTMLТекст, СтрокаРазногласия.ПринятаяРедакция, "20%", "Left");
				ДобавитьЯчейкуТаблицы(HTMLТекст, Формат(СтрокаРазногласия.Дата, "ДФ=dd.MM.yyyy;"), "10%");
				
				HTMLТекст = HTMLТекст + "</tr>";
				
				Номер = Номер + 1;
			КонецЦикла;

			HTMLТекст = HTMLТекст + "</table>";
			HTMLТекст = HTMLТекст + "</tr>";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
